[{
        "id": "e3268c79-614c-4978-8f22-e6495c1e067f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e3268c79-614c-4978-8f22-e6495c1e067f",
        "created_at": "Wed Sep 04 19:54:29 UTC 2019",
        "company": "Stride Consulting",
        "company_url": "https://www.stridenyc.com/careers",
        "location": "New York City",
        "title": "Lead Software Development Consultant",
        "description": "<p><strong>Join our Family</strong></p>\n<p>Stride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’re in great company.</p>\n<p>Our goal is to leave our clients functioning at a higher level than when we found them.  We do this by writing high quality code alongside them, and by mentoring their developers, product teams and stakeholders in software development best practices.</p>\n<p>We believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.</p>\n<p><strong>As a Strider, you’ll find an unmatched opportunity. You will:</strong></p>\n<p>Be a senior member of an engineering-driven culture, one that is employee owned, has a 4.9 star Glassdoor review, and has won Crain’s Best Places to Work 2 years in a row.\nWrite high-quality code with some of the smartest engineers in town.\nMentor and manage a Stride team\nManage projects:\nCreate technical engagement strategy with Stride’s account team\nForm trust with client leadership\nHelp structure how the project is run, including Agile process and development/architecture decisions</p>\n<p><strong>Day In The Life of an Engineering Manager</strong></p>\n<p>You are empowered to define what work/life balance means to you. You’ll work onsite at your client in NYC. We are proud to call some of the most outstanding tech teams our clients.</p>\n<p>Your work week will involve 60%-80% client work (coding, managing a Stride team, and running the engagement). The rest of your time will be spent on strategic initiatives.</p>\n<p>A sample day:</p>\n<ul>\n<li>\n<p>9am: Weekly Sprint Planning.  Me and the client Product Owner co-run weekly sprint planning. We’ve got the meeting down to a nice rhythm. We walk away with a plan.</p>\n</li>\n<li>\n<p>10am: Daily Standup.</p>\n</li>\n<li>\n<p>10:10-12:30 Pair Programming. This morning, I’m pairing with another Strider, a mid-level engineer. She’s got strong fundamentals. We’re doing a deep dive into complex backend code. She’s driving, I’m asking questions when I see she gets stuck. She noticed inefficient code and we spent about 20 minutes refactoring.</p>\n</li>\n<li>\n<p>12:30-1:30 Lunch</p>\n</li>\n<li>\n<p>1:30-3:00 Pair Programming</p>\n</li>\n<li>\n<p>3:00-3:30 Mob programming  A team member gets stuck on a piece of code. I sit down with Jean and his pair. We call over 2 other developers and we mob program. We figure out a plan and everyone is excited about the collaboration.</p>\n</li>\n<li>\n<p>3:30-4:30 Mind Map Over the past two months, I’ve observed the team’s strengths and areas for improvement. Today, I’m leading a Mind Mapping session with the Striders. We visually organize areas for improvement. We prioritize each item by complexity and importance. Next Monday, I’m presenting this to the client CTO.</p>\n</li>\n<li>\n<p>4:30- 5: Code Review Today, one of the Striders was coding solo. So, I sit down and review her code.</p>\n</li>\n<li>\n<p>5-6: Stride U DevOps Jam Stride U is ongoing education for Striders by Striders. Seven of us are taking the DevOps Jam course now, it’s 1 hour weekly, for 8 weeks.  DevOps is something I’m dipping a toe in and having a safe space to learn real world stuff that I can bring back to my client is amazing.</p>\n</li>\n<li>\n<p>6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.</p>\n</li>\n</ul>\n<p><strong>About your job at Stride</strong></p>\n<p>Your job: write high quality code, and bring a ‘teach a team to fish’ mentality to your project. You will:</p>\n<ul>\n<li>Embed with tech teams in some of NYC’s most exciting startup, mid-market and enterprise companies to help them up their game and get stuff done.</li>\n<li>Mentor and manage both Strider and client teams on the value of software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement</li>\n<li>Be the reason your client teams are higher performing on your last day with them than they were on your first day.</li>\n<li>Lead and be part of a cross functional team of Striders and client employees.</li>\n<li>Work with, learn and teach others a variety of tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.</li>\n</ul>\n<p><strong>You’re a fit if you have:</strong></p>\n<ul>\n<li>6+ years of software development experience, including 1 year as a lead developer or manager</li>\n<li>Proficiency in multiple programming languages and ability to quickly gain proficiency in unfamiliar languages and frameworks</li>\n<li>Desire to guide team strategy</li>\n<li>Passion for seeing projects through from inception to deployment</li>\n<li>Experience teaching TDD, story estimation, test writing, and effective pair programming</li>\n</ul>\n<p><strong>What you can expect from us:</strong></p>\n<ul>\n<li>Continuous learning on things that you are passionate about</li>\n<li>Competitive Pay and Benefits (including Profit Sharing!)</li>\n<li>Empowerment to work at a self-defined sustainable pace</li>\n<li>Awesome culture</li>\n<li>No travel</li>\n<li>$2,000 and up to two weeks of your time for self-directed professional development</li>\n</ul>\n<p><strong>About Stride Consulting</strong></p>\n<p>Stride Consulting is NYC’s go-to Agile software development consultancy.</p>\n<p>Our mission: Teach the World to Stride! We believe that high functioning development teams give an organization a true competitive advantage. We help tech teams up their game, and become the highest functioning version of themselves in perpetuity.</p>\n<p>We do this by co-locating and literally coding side-by-side with our clients. We come to you. The love for technical mentorship weaves a thread through all that we do. We not only advocate for best practices in software development, we model the way. Our non-dogmatic Agile developers and product managers teach through doing, because we know that every tech team is unique in their challenges and opportunities.</p>\n<p>We are employee owned &amp; run, and profitable. This means we don’t have a board of directors to answer to or investors who need to make a return. We are in control of our growth and can do so at a pace that sustains our culture and  prioritizes the happiness of our employees.</p>\n",
        "how_to_apply": "<p>If interested, please visit the link below to apply: <a href=\"https://boards.greenhouse.io/stride/jobs/1342703\">https://boards.greenhouse.io/stride/jobs/1342703</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b05dfdb553ecacd9b3565dff9e5dbcefb66b4126/Stride%20Consulting%20Logo%20Below%202018.png"
    },
    {
        "id": "6cc20231-5834-4766-98c7-7a5daac8e50d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6cc20231-5834-4766-98c7-7a5daac8e50d",
        "created_at": "Thu Aug 29 21:44:11 UTC 2019",
        "company": "Kettle",
        "company_url": "https://wearekettle.com/",
        "location": "New York, NY",
        "title": "Senior Back-End Web Developer",
        "description": "<p>Your task.</p>\n<p>We're looking for a full-time Back-end Web Developer (Ruby, Python, or PHP). At Kettle, you'll be building  web applications—everything from interactive experiences to complete websites—for clients ranging from Fortune 100 companies to budding start-ups. We're looking for a versatile developer comfortable with the model-view-controller pattern and flexible enough to work with a variety of modern Web frameworks. You'll be working hand-in-hand with our front-end developers to construct the site's functionality.</p>\n<p>We’d like to know that you can:</p>\n<p>Build complex, dynamic web applications from prototyping to deployment using modern MVC frameworks and design patterns\n4+ years experience in PHP, Python, or Ruby\nEfficiently integrate and debug third-party APIs\nBasic Linux system skills and AWS console experience\nWorking knowledge of Docker containers, virtual machines, and automated provisioning\nHTML, CSS, and JavaScript fundamentals</p>\n<p>The right candidate should also have:</p>\n<p>An insatiable curiosity for new techniques and a razor-sharp eye for detail\nA love for programming and eagerness to tackle unique, challenging problems\nYou’re serious about your work, but don’t take yourself too seriously\nA passion for collaborating with a creative team to build great products</p>\n<p>Why it’s an awesome gig:</p>\n<p>Direct new web projects from scratch. As the lead back-end developer, you will be entrusted with a wide range of responsibilities and be able to rapidly iterate, collaborate, and learn from a large, multidisciplinary team.\nChoose and use the best tools. Build projects using modern packages, services, and frameworks. You will be given wide autonomy to choose the right tools for the problem.\nTouch many different clients across industries and needs. Our projects aren’t “one size fits all.” This will let you experiment with new ways of thinking and working to build amazing products.</p>\n<p>A little about us:</p>\n<p>An independent digital agency with offices in New York City and San Francisco. We’re a team of makers, doers, and passionate problem-solvers with a simple mission: to make tomorrow better. We spend countless hours tinkering and asking questions until we unequivocally know the product is in its purest, most elegant form. Our strengths are creating user-centric products, keeping it simple, and telling great stories. Our weaknesses are baked goods, french fries, and karaoke.</p>\n<p>More info:</p>\n<p>Candidate must be a US citizen or have a work permit.\nCompetitive compensation based on experience.\nAll candidates should submit code samples or links to demonstrate your abilities</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:lauren.marusich@wearekettle.com\">lauren.marusich@wearekettle.com</a> and <a href=\"mailto:kacey.aumack@wearekettle.com\">kacey.aumack@wearekettle.com</a> along with code samples or links to demonstrate your abilities in this role</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGx3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d88bebe6435d2410432801a554467c5092ed1d11/Kettle%20Logo.png"
    },
    {
        "id": "b825e6d6-59fa-4122-8e10-b252f79a35f0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b825e6d6-59fa-4122-8e10-b252f79a35f0",
        "created_at": "Fri Aug 23 13:45:42 UTC 2019",
        "company": "BITMARCK Service GmbH",
        "company_url": "http://www.bitmarck.de/karriere",
        "location": "Essen",
        "title": "Softwareentwickler (m/w/d) Business Intelligence und Data Warehouse",
        "description": "<p>Du suchst eine neue Herausforderung? Du brennst für Innovation und Digitalisierung? IT liegt dir im Blut? Dann bist du bei uns richtig! Wir suchen dich als</p>\n<h2><strong>Softwareentwickler (m/w/d) BI DWH</strong></h2>\n<p><strong>bei der BITMARCK Service GmbH am Standort Essen</strong></p>\n<h2><strong>Das machst du bei uns:</strong></h2>\n<ul>\n<li>Du übernimmst die Entwicklung und den Test von Software-Bausteinen zum Datenmanagement des DWH, die Dokumentation von Anwendungen sowie die Erstellung von Reports.</li>\n<li>Du modellierst, realisierst und implementierst Software-Bausteine und -Funktionen in Business Intelligence (BI) und im zentralen DWH u. a. mittels SQL, Teradata-Tools, Linux-Shell, C, Python und IBM Cognos.</li>\n<li>Du übersetzt fachliche Anforderungen in ein technisches Design-Modell als Grundlage für die Realisierung sowie Abschätzung von Aufwänden und der Realisierbarkeit von Softwareanforderungen.</li>\n<li>Du unterstützt und wirkst mit im Betrieb des zentralen DWH bzw. in agilen Projekten.</li>\n</ul>\n<h2><strong>Das bringst du mit:</strong></h2>\n<ul>\n<li>Eine Ausbildung zum Fachinformatiker (m/w/d) Anwendungsentwicklung oder ein Studium der (Wirtschafts-)Informatik</li>\n<li>Fundierte Berufserfahrung in der Umsetzung von Softwarekomponenten im BI-Umfeld, z. B. bei ETL-Strecken</li>\n<li>Erfahrung in Design und Umsetzung von BI-Anwendungen</li>\n<li>Idealerweise Kenntnisse im Umfeld der Teradata-Technologie</li>\n<li>Optionale Kenntnisse im Umfeld von IBM Cognos</li>\n<li>Kooperations- und Teamfähigkeit, Kommunikationsstärke sowie Flexibilität</li>\n<li>Lösungs- und Prozessorientierung, Eigeninitiative sowie eine selbstständige Arbeitsweise</li>\n</ul>\n<h2><strong>Das bieten wir dir:</strong></h2>\n<ul>\n<li>Eine interessante und abwechslungsreiche Tätigkeit an einem attraktiven Standort</li>\n<li>Ein kollegiales Miteinander und ein Betriebsklima, in dem wir gerne – auch standortübergreifend – zusammenarbeiten</li>\n<li>Work-Life-Balance durch flexible Arbeitszeiten</li>\n<li>Eine tarifliche Vergütung sowie attraktive Altersvorsorgemodelle</li>\n<li>Fachliche und persönliche Weiterbildung, u. a. durch. die Teilnahme an Schulungen und Tech-Konferenzen</li>\n<li>Arbeit in agilen Teams sowie mit aktuellen Technologien von namhaften Herstellern</li>\n<li>JobRad-Leasing und Corporate Benefits</li>\n<li>Angebote im Rahmen des betrieblichen Gesundheitsmanagements, z. B. Teilnahme am Gesundheits-Camp und Firmenlauf</li>\n<li>30 Tage Urlaub sowie drei weitere betriebsfreie Tage</li>\n</ul>\n<h2><strong>Gemeinsam mit dir digitalisieren wir den Markt der gesetzlichen Krankenversicherung und schaffen mit smarten Produkten Mehrwerte für Versicherte. Das sind wir:</strong></h2>\n<ul>\n<li>Von der Softwareentwicklung über den Datenaustausch und den Betrieb von Rechenzentren und Netzen bis hin zur Fachberatung: Als Managed Service Provider im IT-Markt der gesetzlichen Krankenversicherung treibt BITMARCK die Digitalisierung in der Branche und bei seinen Kunden mit innovativen Produkten, Lösungen und Services voran.</li>\n<li>Unser Kernprodukt ist mittlerweile eine der größten Java-Applikationen Europas.</li>\n<li>Wir unterhalten für unsere Kunden zwei große Rechenzentrums-Standorte mit über 3.600 Servern.</li>\n<li>1.400 Mitarbeiter schaffen deutschlandweit digitale Lösungen für Krankenkassen.</li>\n<li>30.000 Mitarbeitern in der GKV erleichtern wir ihre tägliche Arbeit – 85 % der Krankenkassen sind Kunden unserer Unternehmensgruppe.</li>\n<li>Mehr als 20 Mio. Versicherte profitieren somit von den Mehrwerten unserer Arbeit.</li>\n</ul>\n<p><strong>Haben wir dein Interesse geweckt? Dann zögere nicht und schick uns deine Online-Bewerbung über das Bewerbungsformular!</strong></p>\n<p><a href=\"https://bitmarck.redirect.your-jobresponse.com/softwareentwickler_m_w_d_business_intelligence_und_data_warehouse_essen/254023/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n<p><strong>Du hast Fragen? Dann ruf uns an – wir freuen uns auf dich!</strong>\nKontakt: BITMARCK Holding GmbH, Michaela Maschberger Tel. 0201 1766-2663</p>\n",
        "how_to_apply": "<p><a href=\"https://bitmarck.redirect.your-jobresponse.com/softwareentwickler_m_w_d_business_intelligence_und_data_warehouse_essen/254023/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZ3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50a528dec7b12ad387172fa5ed554f2352cfc621/BITMARCK_Logo.jpg"
    },
    {
        "id": "998de61a-26a2-49d3-a0c0-4f94633f8f36",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/998de61a-26a2-49d3-a0c0-4f94633f8f36",
        "created_at": "Tue Aug 13 17:35:25 UTC 2019",
        "company": "Knotch",
        "company_url": "https://www.knotch.it",
        "location": "New York City",
        "title": "Data Platform Engineer",
        "description": "<p>Knotch makes brands smarter through data, and empower consumers’ voices online. Our content intelligence platform measures and optimizes content marketing ROI. We're looking for a Senior Full Stack Engineer to join the team that helping the world's largest brands become better storytellers.</p>\n<p>Check out what it's like to work at Knotch:\n<a href=\"https://www.trinet.com/insights/people-matter-nyt-knotch\">https://www.trinet.com/insights/people-matter-nyt-knotch</a></p>\n<p>The Data Platform Engineer:\nAt Knotch, our data platform is vital to providing key intelligence and insights to our clients. As a result, our data platform is the most important element when it comes to successfully scaling our products and technologies. As our platform evolves, agility with stability are critical to avoid bottlenecks in our products and to ultimately increase our value. We’re looking for an experienced data engineer who deeply values clever platform architecture and who emphasizes speed and stability to join our growing team.</p>\n<p>What You'll Do at Knotch:\n*Design and implement resilient backend architectures that process gigabytes and beyond\n*Write software for backend services using Python, Javascript, and other languages\n*Work directly with our Data Science team facilitate new understandings and insights from our data\n*Work directly with our full-stack engineering team to expose value from our data</p>\n<p>You Can Be Successful If you Bring:\n*3+ years of data platform engineering experience\n*Working experience with AWS services including Kinesis, Lambda, S3, and RedShift\n*Experience with various AWS offerings such as EC2, ECS, RDS, ElastiCache, and others\n*Experience with Python, JavaScript, Ruby, Postgres, and Redis\n*Experience working with Data Science teams and productizing Data Science models and applications</p>\n<p>Engineering at Knotch:\nEngineering is the cornerstone of our organization and we work hard everyday to build the most impactful products as possible. We love to experiment, find a deep joy in product iteration, achieve stability with thoughtful architecture and testing all while monitoring our performance and progress at every step.</p>\n<p>Knotch’s founding mission has always been to improve the advertising and marketing industries in a lasting and meaningful way. Transparency through data is our ethos and something every member of our company takes seriously. We are looking for highly motivated engineers who are passionate about data and who are eager to transform an industry to join us on our journey.</p>\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p>If you love to build web apps in Ruby, and this opportunity sounds enticing, get in touch!</p>\n<p>Apply directly here: <a href=\"https://grnh.se/e8b47d951\">https://grnh.se/e8b47d951</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnR2IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ea94de96202a46e899863f387adc06fefc378760/KnotchAvatar.png"
    },
    {
        "id": "97a82007-cdde-4e27-b061-c4adba143c03",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/97a82007-cdde-4e27-b061-c4adba143c03",
        "created_at": "Tue Aug 13 17:22:36 UTC 2019",
        "company": "Knotch",
        "company_url": "https://www.knotch.it",
        "location": "New York City",
        "title": "Senior Full Stack Software Engineer",
        "description": "<p>Knotch makes brands smarter through data, and empower consumers’ voices online. Our content intelligence platform measures and optimizes content marketing ROI. We're looking for a Senior Full Stack Engineer to join the team that helping the world's largest brands become better storytellers.</p>\n<p>The Senior Full Stack Software Engineer:\nData is at the heart of what we do. We receive millions of web requests a day, process insights in real-time, and store gigabytes worth of information. Well designed architectures, simple yet effective software implementations, and smart execution have been the keys to our success thus far. We’re looking for engineers who embrace these aspects and who are eager to contribute on all levels of our products.</p>\n<p>What You'll Do at Knotch:\n*Write elegant and expressive Ruby and Javascript for our various backend services and frontend applications\n*Work with our Front-end Engineers to design APIs and deliver data\n*Work with our Client team to understand bottlenecks and improve our overall value\n*Work with our Product team to iterate on features and innovate with new product concepts</p>\n<p>What We Want From You:\n*4 years+ of Web Application engineering and architecture experience\n*Strong experience with Ruby, Rails, Python, Postgres, and Docker\n*Strong experience with various AWS offerings such as EC2, ECS, RDS, S3, ElastiCache, Lambda and others\n*Strong Experience with modern ES6+ JavaScript and using React\n*An eagerness to experiment, a determination to contribute, and a drive to recognize problems and swiftly remedy them</p>\n<p>Some of the benefits you'd get:\n*Unlimited PTO and flexible work-from-home\n*Comprehensive health insurance\n*Free lunch while in-office\n*Unlimited monthly Metrocard\n*Mental Health and Learning &amp; Development Programs</p>\n<p>Engineering at Knotch:\nEngineering is the cornerstone of our organization and we work hard everyday to build the most impactful products as possible. We love to experiment, find a deep joy in product iteration, achieve stability with thoughtful architecture and testing all while monitoring our performance and progress at every step.</p>\n<p>Knotch’s founding mission has always been to improve the advertising and marketing industries in a lasting and meaningful way. Transparency through data is our ethos and something every member of our company takes seriously. We are looking for highly motivated engineers who are passionate about data and who are eager to transform an industry to join us on our journey.</p>\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p>If you love to build web apps in Ruby, and this opportunity sounds enticing, get in touch!</p>\n<p>Apply directly here: <a href=\"https://grnh.se/378559c61\">https://grnh.se/378559c61</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmR2IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--71b0f3959b710498ae4fbae96808607377d232e2/KnotchAvatar.png"
    },
    {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
    },
    {
        "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
        "created_at": "Sat Nov 10 02:02:55 UTC 2018",
        "company": "Sesame",
        "company_url": "http://sesamecare.com",
        "location": "New York; Berlin",
        "title": "Software engineer (back end)",
        "description": "<p>We’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.</p>\n<p>Our all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.</p>\n<p>We believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.</p>\n<p>We’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.</p>\n<p>We must be on to something, since we’re proud to say:</p>\n<ul>\n<li>We have engineering teams in New York and Berlin</li>\n<li>We've raised millions in funding to grow U.S. operations.</li>\n</ul>\n<p>Want to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.</p>\n<p><strong>About you:</strong></p>\n<ul>\n<li>Comfortable with Java and microservices.</li>\n<li>You seek and prefer simple solutions to complex problems.</li>\n<li>You strive to write clean, quality code and enjoy doing it.</li>\n<li>You maintain a healthy balance between perfectionism and actually getting stuff done.</li>\n<li>You either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.</li>\n<li>You love developing software. You have 2+ years of industry experience.</li>\n<li>You are a strong team player, have strong writing skills, and enjoy collaborating with others.</li>\n<li>You are attuned to the fundamentals of user design and user experience.</li>\n</ul>\n<p><strong>Our technology stack includes:</strong></p>\n<ul>\n<li>Java 10</li>\n<li>Spring Boot</li>\n<li>Kubernetes</li>\n<li>Docker</li>\n<li>GraphQL</li>\n<li>Pub/Sub</li>\n<li>Postgres</li>\n<li>Python</li>\n<li>NodeJs</li>\n</ul>\n<p><strong>Our Offer:</strong>\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.</p>\n<p><strong>Perks:</strong>\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.</p>\n<p>Sesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
    },
    {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
    }
]