[{
        "id": "b34a66d2-8917-46ec-a7ed-3fa8c3b3d4be",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b34a66d2-8917-46ec-a7ed-3fa8c3b3d4be",
        "created_at": "Tue Sep 10 23:10:10 UTC 2019",
        "company": "QSC, LLC",
        "company_url": "https://www.qsc.com/",
        "location": "Boulder, Colorado",
        "title": "DevOps/Build Engineer",
        "description": "<p>The DevOps Engineer will work with an experienced team of software and firmware engineers to develop and support our Q-SYS platform.  Q-SYS is a fast growing, award winning, software and hardware platform built on cutting-edge audio, video and control products.  In this position you will design and engineer a build, test, and release toolchain that supports the software components of the Q-SYS ecosystem.  These components range from embedded Linux software deployed on microprocessors, to Windows desktop applications, to a cloud based web application deployed in Google Cloud.  You will work closely with other software developers and DevOps engineers to improve and streamline the developer workflow, scale our automated build and test infrastructure for a continuously growing team, and implement the principles of continuous integration and continuous deployment into our team processes and culture.</p>\n<p>This position is based in Boulder, Colorado.</p>\n<p>Responsibilities</p>\n<p>•Lead the development of our automated build and test infrastructure, with a strong focus on scalability, performance, and reliability.</p>\n<p>•Improve and streamline the development and deployment workflow for our software dev and SQA teams.</p>\n<p>•Work with others to maintain the continuous deployment pipeline for the Q-SYS Reflect cloud application in Google Cloud.</p>\n<p>•Research and inform the organization about DevOps technology and process trends and innovations.</p>\n<p>•Perform other duties as assigned</p>\n<p>Qualifications</p>\n<p>•B.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent.</p>\n<p>•Minimum of 5 years of work experience in a software development environment, in a DevOps, Build and Release Engineering, or Site Reliability Engineering role.</p>\n<p>•Experience developing and scaling an automated build and test environment.</p>\n<p>•Excellent scripting skills in Python, javascript, Ruby, or Linux shell scripts.</p>\n<p>•Understanding of Linux software development workflow and tools.  Have compiled Linux applications and kernel source.</p>\n<p>•Automation-focused perspective.  When you hear of a task or problem on the development team, your first instinct is to consider solving it with automation.</p>\n<p>•Preferred experience with one or more of the following:</p>\n<pre><code> ◦Docker/Kubernetes\n\n ◦Jenkins or other CI tools\n\n ◦Virtualization technologies such as VMWare, KVM, libvirt\n\n ◦Familiarity with cloud applications and microservice architectures\n</code></pre>\n<p>•Passionate, persistent, creative - you find solutions to difficult problems and clever ways to work around them when necessary</p>\n<p>•Must be self-motivated in order to achieve assigned objectives with minimal supervision</p>\n",
        "how_to_apply": "<p>Please apply via our careers site: <a href=\"https://qsccareers-qsc.icims.com/jobs/1799/devops-build-engineer/job\">https://qsccareers-qsc.icims.com/jobs/1799/devops-build-engineer/job</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0Z4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--da21bd3f53a3aafa626755318e045cc70dc40f0d/QSC_LOGO_BLUE.jpg"
    },
    {
        "id": "afbd99e0-561a-4add-a147-6f96d820b244",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/afbd99e0-561a-4add-a147-6f96d820b244",
        "created_at": "Wed Sep 11 17:11:46 UTC 2019",
        "company": "Edmentum Inc.",
        "company_url": "https://www.edmentum.com/about/careers",
        "location": "Bloomington, Minnesota",
        "title": "Software Engineer - Machine Learning/Artificial Intelligence",
        "description": "<p>Edmentum is committed to making it easier for educators to individualize learning for every student through simple technology, high-quality content, actionable data, and customer success. Founded in innovation, Edmentum’s powerful learning solutions blend technology with individual teaching approaches. We are dedicated to being educators' most trusted partner in creating successful student outcomes everywhere learning occurs. Our commitment is built off the emphasis we place on our core values: passion, people, respect, collaboration, and performance.</p>\n<p>The <strong>Software Engineer of Machine Learning/Artificial Intelligence</strong> will lead development efforts that will bring high impact AI applications to Edmentum products and internal operations. The engineer will play a critical role of bridging the gap between our Software Developers and Data Scientists.</p>\n<p><strong>Here's what you'll do:</strong></p>\n<ul>\n<li>Develop software products that help us build and run machine learning applications.</li>\n<li>Own architecting, designing, developing, and deploying a highly efficient, scalable, high performance AI Conversational Chatbot to integrate with existing product portfolio.</li>\n<li>Implement application frameworks, APIs, libraries and services that perform at scale using existing and emerging technology platforms and standards like Kubernetes, Docker.</li>\n<li>Develop automation workflows, conduct reviews to make sure the software is rigorously designed, elegantly coded, and effectively tuned for platform performance, and assess the overall quality of delivered components.</li>\n<li>Develop and maintain data lake and big data pipelines.</li>\n<li>Besides being a member of the Data Science team, directly work with product owners and development teams.</li>\n<li>Research and develop cutting edge machine learning algorithms to solve problems within products and to improve internal operations.</li>\n<li>Ability to operate within a startup-like environment where projects and responsibilities can pivot quickly. </li>\n</ul>\n<p><strong>Here's what you'll need:</strong></p>\n<ul>\n<li>3+ years of Node.js and JavaScript.</li>\n<li>3+ years of Python.</li>\n<li>2+ years integrating and/or customizing open source tools.</li>\n<li>2+ years of SQL programming and SQL Server development.</li>\n<li>1+ years AWS or other public cloud development.</li>\n<li>Working knowledge of Git and Docker.</li>\n<li>1+ years of streaming analytics (i.e. Kafka, AWS Kinesis).</li>\n<li>1+ years of big data pipeline development (i.e. Spark).</li>\n<li>Data Science experience (1+ years): exploratory data analysis (summary statistics, data visualizations, statistical modeling for EDA, etc.), machine learning (feature engineering &amp; selection, supervised and unsupervised learning (tree based, linear/non-linear models, neural networks).</li>\n<li>Strong project management skills with a proven ability to deliver products on time and on budget.</li>\n<li>Lifelong learner.</li>\n<li>Familiarity and research interest in bleeding-edge data science, machine learning, artificial intelligence, and data architecture.</li>\n</ul>\n<p><strong>Preferred Knowledge, Skills, and Abilities</strong></p>\n<ul>\n<li>.Net experience.</li>\n<li>Conversational AI development with Rasa, MS BOT Framework or other.</li>\n<li>BOT UI or similar front-end tool.</li>\n<li>Creating and maintaining web services in AWS or other public cloud.</li>\n<li>REST APIs</li>\n<li>AWS ECS or other public cloud</li>\n<li>Hadoop, AWS EMR </li>\n</ul>\n<p>Edmentum is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law. </p>\n",
        "how_to_apply": "<p>Apply <a href=\"https://recruiting.ultipro.com/PLA1009PLATO/JobBoard/04e3a767-9600-42c4-86c9-5912bbf18813/OpportunityDetail?opportunityId=7d5ed618-4088-46d6-8ca9-1a9ee009126a\">here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGx4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8a6dd572c2cbe45392e51bcce39fba4ece44048a/Edmentum%20logo_CMYK.png"
    },
    {
        "id": "6715d1d8-9518-4991-858b-aaf5bb3b34fc",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6715d1d8-9518-4991-858b-aaf5bb3b34fc",
        "created_at": "Wed Sep 11 12:51:36 UTC 2019",
        "company": "Comtravo GmbH",
        "company_url": "https://comtravo.com",
        "location": "Berlin",
        "title": "Backend Engineer (f/m/x) - Node.js",
        "description": "<p><strong>Comtravo - Business travel made simple</strong></p>\n<p>We are a team of travel experts, tech enthusiasts and customer support heroes – with the shared purpose to simplify business travel. Comtravo provides small and medium sized companies a truly unique solution. Travellers or travel managers can book and manage their business trips with one simple text message. Using state-of-the-art technologies, such as NLP and machine learning techniques, we are automating our fulfilment pipeline. This enables our in-house travel experts to focus on complex requests and individual needs of our clients.</p>\n<p>Our backend team needs you to build up and implement a well designed product with clear advantages for our customers.</p>\n<p><strong>So, are you ready to turn the B2B travel industry upside down?</strong></p>\n<p><strong>YOUR TASKS</strong></p>\n<ul>\n<li>You support our engineering team to develop and optimize our booking platform and creating a smooth and pleasant end user experience for our customers and internal stakeholders</li>\n<li>You maintain and optimize existing features and services for performance and stability</li>\n<li>You are responsible for design and implementation of complex, scalable data processing</li>\n<li>You troubleshoot and working out solutions for complex and challenging problems</li>\n<li>You collaborate with our developer team on optimization of the infrastructure</li>\n<li>You work in close cooperation with other developers, our product team and the data scientist to develop kick-ass features</li>\n</ul>\n<p><strong>YOUR PROFILE</strong></p>\n<ul>\n<li>You have the ability to write production ready codes in Node.js</li>\n<li>You have a degree in Software Engineering or a related field with a solid background in Computer Science (Data Structures, Algorithms, Design Patterns, Scaling)</li>\n<li>Ideally you already got your feet wet in interesting side projects or internships</li>\n</ul>\n<p><strong>NICE TO HAVE</strong></p>\n<ul>\n<li>You have a good sense for code quality, robustness, automation, testing and monitoring</li>\n<li>You have basic knowledge in Linux, ELK-Stack, Docker</li>\n<li>You have knowledge in typical database systems (MySQL, Redis, Mongo)</li>\n<li>You have experience with Amazon Web Service (AWS)</li>\n</ul>\n<p><strong>WHAT WE OFFER?</strong></p>\n<ul>\n<li>Competitive salary &amp; flexible working hours</li>\n<li>Attractive benefits for flights and hotels for your personal travels\n-An exciting job in a High-Tech startup in Berlin, the Silicon Valley of Europe</li>\n<li>Access to a great network of entrepreneurs in Berlin and some of the best travel &amp; B2B investors in Europe</li>\n<li>Influence the development of the company</li>\n<li>Cooperation with an extremely strong and competent team in Research &amp; Development</li>\n<li>Transparency with flat hierarchies where every person is highly valued</li>\n<li>Company parties, weekly team lunches and a lot more events</li>\n<li>A loft office in the heart of Berlin with everything you need</li>\n</ul>\n<p><strong>Interested? Then go ahead and apply now!</strong></p>\n",
        "how_to_apply": "<p><a href=\"https://comtravo.join.com/jobs/358227-backend-engineer-f-m-x-node-js?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=backend%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bnode%2Bjs\">https://comtravo.join.com/jobs/358227-backend-engineer-f-m-x-node-js?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=backend%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bnode%2Bjs</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEp4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2561795f49fa6da0a12d15a60ff70a1ad6ca1c0/comtravo_owler_20181206_152639_original.png"
    },
    {
        "id": "076b3ec5-434b-45da-87d1-d3f10f777259",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/076b3ec5-434b-45da-87d1-d3f10f777259",
        "created_at": "Wed Sep 11 07:01:43 UTC 2019",
        "company": "Crate.io Inc.",
        "company_url": "https://crate.io/",
        "location": "Dornbirn, Berlin, remote",
        "title": "Technical Sales Specialist",
        "description": "<p><strong>Technical Sales Specialist</strong></p>\n<p><em>Location: ideally Dornbirn, Berlin, remote\nPostion: Fulltime (valid work permit for European Union required)</em></p>\n<p><strong>About Crate.io</strong></p>\n<p>Crate.io is a world class technology company working at the cutting edge of the IIoT industry. We provide products that unlock the power of data within multiple industries that was inaccessible before our technology. We are looking for a passionate Technical Sales Specialist to join our team. The person must be able to match our speed, creativity and energy level to be successful. Our investors are world class, our company has been recognized by both Forbes and Gartner as leading edge and we are gearing up for hyper growth.</p>\n<p><strong>About the Role</strong></p>\n<p>At Crate.io the TSS is a hybrid role merging sales and technical solutions expertise. We offer the opportunity to not only focus on winning the technical decision of customers to purchase and use our technology but also the chance to own opportunities outright as part of broader sales team. You will work together with the sales team to technically advise on the sales of products, enabling the customers through digital transformation by leveraging the power of industrial scale data analysis with Crate.io technology.</p>\n<p>The Technical Sales Specialist explains, demonstrates &amp; proves the capabilities of our solutions and works with customers directly. Crate.io creates, markets and sells a technical product making your role essential in the success of the company. This is a position for someone with both technical knowledge and sales skills. The ideal candidate is customer obsessed, energetic, understands enterprise selling and likes both fun and success.</p>\n<p><strong>Responsibilities</strong></p>\n<p>These are some of the expectations for this Technical Sales Specialist (TSS) Role:</p>\n<p><strong>You will help customers make technical decisions to build tomorrow’s IIoT solutions based on Crate.io.</strong></p>\n<ul>\n<li>Engaging with customers making inquiries into Crate.io’s solutions at the beginning of the sale cycle.</li>\n<li>Assessing and determining which customers can be the best fit for Crate.io and which Crate.io can help the most.</li>\n<li>Solution Design Interview prospects to determine business and technical requirements and determine a technical fit.</li>\n<li>You will lead technical presentations, demonstrations, workshops, architecture design sessions as well as proof of concepts, and pilots.</li>\n<li>Actively participating in all phases of planning and execution for your territory, from initial discovery to the technical win.</li>\n<li>You will help solve technical, competitive and security blockers to accelerate Crate.io sales and customer usage.</li>\n<li>You will work with our key partners and others at Crate.io, as well as use our social connection tools to extend your reach and the reach of your team, focusing on satisfying important customer needs.</li>\n<li>Directly interact with engineering as the voice of the customer and community to communicate needs, gaps, and enhancements.</li>\n<li>An obsession with learning is required. We are constantly discovering how we can help customers in different ways. Creative troubleshooting of issues that require solutions or innovative workarounds</li>\n</ul>\n<p><strong>You will also be an evangelist and orchestration point for a variety of resources, by:</strong></p>\n<ul>\n<li>Presenting at conferences and seminars</li>\n<li>Responding to technical sections in RFIs/RFPs.</li>\n<li>Orchestrating complex solutions with partners.</li>\n<li>Helping identify and diagnose technical, architectural, and competitive blockers and respective solutions for sales opportunities and usage decision blockers, and helping ensure that these solutions are implemented.</li>\n<li>Sharing practical knowledge with partners to drive the sale, deployment, and adoption of Crate.io solutions.</li>\n<li>Shaping current and future products, marketing strategies, and customer centricity ideas through your feedback to sales, marketing, and engineering.</li>\n</ul>\n<p><strong>Qualifications and Experience required:</strong></p>\n<ul>\n<li>A track record of success in a technical presales role-- enough experience selling and implementing technology to earn your customer’s trust.</li>\n<li>Experience selling IT solutions and cloud preferred.</li>\n<li>A demonstrable ability to articulate and sell the benefits of modern platforms, software and technologies.</li>\n<li>Advanced big data architecture experience as well as understanding of IoT architectures (MQTT/Kafka/Streaming).</li>\n<li>Hands-on BigData &amp; NoSQL experience (Elasticsearch/Hadoop/Cassandra or similar).</li>\n<li>Relational databases (e.g. Oracle, MySQL, PostgreSQL, generic SQL, JDBC).</li>\n<li>Ability to code in one or more of these languages (Python, Java, C#, JavaScript, C++, etc.).</li>\n<li>Operating systems (e.g. Linux, Windows, shell scripting).</li>\n<li>Fluent knowledge of English.</li>\n<li>Bachelor’s level degree in Computer Science or relevant experience.</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Competitive compensation</li>\n<li>Flexible working hours</li>\n<li>A variety of perks (e.g. financial allowances for public transportation, fitness and education)</li>\n<li>Participation in our Employee Stock Options Plan</li>\n<li>The opportunity to become part of one of the most exciting startups in the IT scene (Top 25 IOT start-ups by Forbes Magazine.</li>\n</ul>\n<p>At Crate.io, we don't just accept difference - we celebrate it and support it. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.</p>\n<p><strong>Are you up for the challenge?</strong></p>\n<p>Apply now via the <a href=\"https://ltpx.nl/Z1qKjYs\"><strong>application form</strong></a>.</p>\n<p><em>Agency calls are not appreciated.</em></p>\n",
        "how_to_apply": "<p><a href=\"https://ltpx.nl/OokKy6U\">Click here to apply</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczV4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c4261eedbaeebe14f6d66f699826dafe3b0c166/crate-logo.png"
    },
    {
        "id": "cceb5378-6ce8-47f9-93b0-b6cc0df19d5f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cceb5378-6ce8-47f9-93b0-b6cc0df19d5f",
        "created_at": "Tue Sep 10 23:56:54 UTC 2019",
        "company": "UC San Diego Health",
        "company_url": null,
        "location": "San Diego",
        "title": "Mobile Applications Developer",
        "description": "<p>UC San Diego Health\nMobile Applications Developer\nFiling Deadline: Thu 9/19/2019, thereafter Open Until Filled\nSalary Range: Commensurate with Experience</p>\n<p>Under the general supervision of the Web Services Manager, the incumbent will be responsible for the design, development and maintenance of the MyUCSDHealth mobile app, for UC San Diego Health. Incumbent will have strong mobile app development experience, either iOS or Android, as well as a background in web development. Incumbent will ensure the performance, quality, and responsiveness of applications, design and build advanced applications for the iOS and/or Android platforms and support integration with ancillary systems as required. The programmer will support applications that can integrate with web sites and/or link to external data sources via XML or UCSD data warehouse feeds as needed.</p>\n<p>With minimal direction from the Web Services Manager, incumbent will take requests that come in to the Internet Services department, and be able to see them from conception through completion. Incumbent will also assist in maintaining current systems, managing upgrades/releases, monitoring system availability and performance and help perform upgrades when needed. Incumbent will be part of our on-call rotation, which provides 7/24 problem management and resolution for all supported web applications.</p>\n<p>MINIMUM QUALIFICATIONS</p>\n<ul>\n<li>A Bachelor's Degree in related area; and/or equivalent experience/training.</li>\n<li>A minimum three (3+) or more years of relevant experience i.e. mobile application development – using Xamarin or native iOS and/or Android.</li>\n<li>Professional experience, and proven success, providing applications programming support and management in a large scale organization.\n• Experience planning, designing, developing, modifying, debugging, deploying and evaluating complex software for functional areas.\n• Experience analyzing existing software or works to formulate logic for new complex systems and devise complex algorithms.\n• Demonstrated experience performing complex data analysis and test/debug complex software.\n• Demonstrated experience analyzing design and use of complex data sources.\n• Demonstrated understanding of moderately complex programming security practices.\n• Proficient in C# and VB.Net with a good knowledge of their ecosystems.\n• Strong development knowledge and understanding of Microsoft SQL Server 2012 and above.\n• Familiarity with Software Change, Configuration Management, and Build Processes in a complex environment.\n• Demonstrated familiarity with the ASP.Net Model-View-Controller (MVC) framework.\n• Strong programming background using Transact-SQL.\n• Strong understanding of Object Oriented Programming.\n• Understanding of Active Directory security concepts as it applies to IIS and other application development principles.\n• Demonstrated understanding of fundamental design principles for building a scalable application.</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS\n• Web application development experience.\n• Advanced Degree in a related technical discipline.\n• Experience in a large, complex healthcare environment.\n• Project Management Professional (PMP) Certification.\n• Information Technology Infrastructure Library (ITIL) Certification.\n• Demonstrated programming background for Mac and iOS.\n• Strong development experience for iOS or Android devices.\n• Strong programming background using PHP and MySQL.\n• Experience developing applications for SharePoint 2010, 2013, and/or 2016.\n• Experience developing data marts and data warehouses.</p>\n<p>SPECIAL CONDITIONS\n• Must be able to work various hours and locations based on business needs.\n• Employment is subject to a criminal background check and pre-employment physical.</p>\n<p>APPLY ONLINE:\n<a href=\"http://50.73.55.13/counter.php?id=168680\">http://50.73.55.13/counter.php?id=168680</a></p>\n<p>UC San Diego Health is the only academic health system in the San Diego region, providing leading-edge care in patient care, biomedical research, education, and community service. Our facilities include two university hospitals, a National Cancer Institute-designated Comprehensive Cancer Center, Shiley Eye Institute, Sulpizio Cardiovascular Center, and several outpatient clinics. UC San Diego Medical Center in Hillcrest is a designated Level I Trauma Center and has the only Burn Center in the county. We invite you to join our dynamic team!</p>\n<p>Applications/Resumes are accepted for current job openings only. For full consideration on any job, applications must be received prior to the initial closing date. If a job has an extended deadline, applications/resumes will be considered during the extension period; however, a job may be filled before the extended date is reached.</p>\n<p>UC San Diego Health is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: <a href=\"http://www-hr.ucsd.edu/saa/nondiscr.html\">http://www-hr.ucsd.edu/saa/nondiscr.html</a></p>\n",
        "how_to_apply": "<p><a href=\"http://50.73.55.13/counter.php?id=168680\">http://50.73.55.13/counter.php?id=168680</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1J4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--749ed05b89919d08349ebec87a275a6486d9cf12/UC_San_Diego_Health.jpg"
    },
    {
        "id": "1e7355ba-b3be-40b8-8be4-5c22a24ce798",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1e7355ba-b3be-40b8-8be4-5c22a24ce798",
        "created_at": "Tue Sep 10 16:43:44 UTC 2019",
        "company": "CyberArk",
        "company_url": "http://CyberArk",
        "location": "Newton",
        "title": "Software Engineer- Devops Community",
        "description": "<p>Job Title: Software Engineer / Senior Software Engineer – Conjur Team\nAbout CyberArk:\nCyberArk is the global leader in privileged access security, a critical layer of IT security to protect data, infrastructure and assets across the enterprise, in the cloud and throughout the DevOps pipeline. CyberArk delivers the industry’s most complete solution to reduce risk created by privileged credentials and secrets. The company is trusted by the world’s leading organizations, including more than 50 percent of the Fortune 100, to protect against external attackers and malicious insiders.\nJob Description:\nCyberArk’s Conjur team is looking for experienced software engineers to join their team.\nConjur Engineers work on a wide variety of projects, from integrations with bleeding-edge DevOps tools to moonshot projects that seek to revolutionize the world of DevOps security. Our primary product is a secrets vault and privilege engine, built upon our open source core.\nPosition Requirements\nWe know that if you're a professional engineer, experience with specific tools or languages can usually be picked up quickly.</p>\n<ul>\n<li>Must be able to write high- quality software</li>\n<li>3- 5 years Software Development experience required</li>\n<li>Knowledge of how to manage technical debt</li>\n<li>You get end-to-end with solutions early in order to de-risk them</li>\n<li>Feedback loops – especially with real customers – are a highly valued asset</li>\n<li>The quality of product experience you create matters deeply to you</li>\n<li>Attend industry conferences to learn (or even present at them!)</li>\n<li>Hold your colleagues to the same high standard as you do yourself</li>\n<li>Contribute to open source software and communities</li>\n</ul>\n<p>However, if you have a very non-typical engineering background and you think we should still consider you, we’d love to hear why. Diversity of perspectives and experiences are very important to us.</p>\n<p>Technologies we use</p>\n<ul>\n<li>Ruby, Rails, Golang, Postgres, and JS</li>\n<li>Docker, GitHub, and Jenkins</li>\n<li>Kubernetes, OpenShift, Cloud Foundry</li>\n<li>AWS, Azure, GCP</li>\n<li>Ansible, Puppet, Chef</li>\n</ul>\n<p>For More Information</p>\n<p>For more information to try out our DevOps puzzle, please see:\n<a href=\"https://www.conjur.org/careers/\">https://www.conjur.org/careers/</a>\nIf you enjoy solving our puzzle, you’ll almost certainly enjoy working on our team!</p>\n",
        "how_to_apply": "<p><a href=\"https://careers.cyberark.com/job/Software-Engineer-DevOps-Community-Mass/543909601/\">https://careers.cyberark.com/job/Software-Engineer-DevOps-Community-Mass/543909601/</a></p>\n",
        "company_logo": null
    },
    {
        "id": "4dbb4a2d-caea-4f6c-8147-91b14524b129",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4dbb4a2d-caea-4f6c-8147-91b14524b129",
        "created_at": "Tue Sep 10 16:31:01 UTC 2019",
        "company": "Chatterbug",
        "company_url": "http://www.chatterbug.com",
        "location": "Berlin",
        "title": "Senior DevOps Engineer",
        "description": "<p>Chatterbug is building the internet’s best way to learn a language by empowering those who speak them: Humans! Humans build our curriculum, teach our students how to speak in one-on-one lessons, and now we are looking for a few more humans to join us in making Chatterbug the best it can be.</p>\n<h2>About the job</h2>\n<p>Speed and accountability are two values our engineering team cares about deeply. Chatterbug is growing and looking for an engineer who prides themselves in taking ownership of the infrastructure that helps us scale not only with our user base but our team as well. Given that we ingest, transform and serve a large amount of video, our infrastructure comes with a unique set of challenges which are difficult and rare, yet rewarding to solve.</p>\n<p>As we introduce new languages, enterprise offerings, mobile applications and explore strategic integrations and partnerships, we anticipate the complexity and scale of our systems to increase over the next year. As the first devops engineer on the team, you’ll join as an early employee at one of the most exciting times in our company's history.</p>\n<p>The heart of our service is a Rails 5.2 application \"monolith\", and not a disjointed series of services. On the backend side, we use many tools, including:</p>\n<ul>\n<li>PostgreSQL 10 via Heroku</li>\n<li>Fastly and Netlify for static content serving and caching</li>\n<li>TokBox, Twilio and OpenVidu for video/WebRTC services</li>\n<li>Travis CI for running our Ruby and JS test suites</li>\n<li>Sauce Labs combined with Rails' system testing for real browser tests</li>\n<li>AWS services including: S3, Polly, AWS ML</li>\n<li>Cluvio and Mode to help analyze and present data to our business and marketing teams</li>\n</ul>\n<p>As a Senior DevOps Engineer, you’ll architect and manage the infrastructure behind Chatterbug to help make our services run smoothly. On a given day you could be tracing a Live Lesson's logs and graphs to determine why a tutor's connection suddenly went haywire, building a new piece of infrastructure to allow us to support more students in the future, and more.</p>\n<h2>About you</h2>\n<p>You’re a multi-talented, experienced engineer who wants to join our team building our language-learning product and infrastructure. You’ll be part of a small development team and will have the opportunity to own major components of our systems. You’re an active learner whose passions may include learning languages. (If you know a language other than English please tell us!)</p>\n<h2>About us</h2>\n<p>Although we are a small company, we have a big product. We are an experienced team with backgrounds at GitHub and other major tech companies with funding from top investors in Silicon Valley and Europe. Our team works extremely reasonable hours and we have a strong commitment to work-life balance.</p>\n<p>Beyond language learning, we’re on a bigger mission to help make lots of jobs for people who only need one skill: how to speak their native language. We currently teach German and Spanish and French to English speakers, as well as English to Spanish speakers. We have an international team and an international product, and we’re proud of it.</p>\n<h2>Benefits at Chatterbug</h2>\n<ul>\n<li>A key role owning central components of a rapidly evolving product</li>\n<li>We’ll pay for you to learn a language - either with us or take a class, on us. You can also elect a friend or family member to learn with us for free, too</li>\n<li>26 days paid holiday</li>\n<li>Regular fun events, team dinners and an annual company summit abroad</li>\n<li>A lovely, apartment style office in the heart of Berlin (with free fruit!)</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>You have at least 4 years of professional DevOps experience</li>\n<li>You're based in Berlin or willing to move here</li>\n<li>You have expertise with Rails, PostgreSQL, the AWS ecosystem</li>\n<li>You’ve implemented and managed complex micro-service architectures</li>\n<li>Experience with video based infrastructures / WebRTC is a major plus</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://jobs.chatterbug.com/o/senior-devops-engineer\">https://jobs.chatterbug.com/o/senior-devops-engineer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d703484b493558a63cae613ca500001680cd7d76/logo.png"
    },
    {
        "id": "5bb9fcce-9c57-4fe8-8560-19832f494f57",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5bb9fcce-9c57-4fe8-8560-19832f494f57",
        "created_at": "Tue Sep 10 16:19:02 UTC 2019",
        "company": "Chatterbug",
        "company_url": "http://www.chatterbug.com",
        "location": "Berlin",
        "title": "Senior React Developer",
        "description": "<p>Chatterbug is building the internet’s best way to learn a language by empowering those who speak them: Humans! Humans build our curriculum, teach our students how to speak in one-on-one lessons, and now we are looking for a few more humans to join us in making Chatterbug the best it can be.</p>\n<h2>About the job</h2>\n<p>We believe that design and usability are the foundation of an excellent product experience. Our small Product/Design and Engineering teams work together very closely all the way from concept to final implementation. We use an iterative process, release often, and stay open to feedback.</p>\n<p>As we are starting on some major product improvements, we are looking to add an experienced React developer to join our team in order to expand the scope of what's possible with Chatterbug. Our web and mobile app are written in React and React-Native respectively and we work on both.</p>\n<h2>About you</h2>\n<p>You’re a multi-talented engineer who wants to join our team building our language-learning product and infrastructure. You will be part of a small development team and have the opportunity to own major components of our systems.</p>\n<p>You’ll ship new features to our students and tutors, you’ll help be in service of our growing curriculum development team building our language learning content, and you’ll assist in digging into technical issues in our stack.</p>\n<p>You’re an active learner whose passions may include learning languages. (If you know a language other than English please tell us!)</p>\n<h2>About us</h2>\n<p>Although we are a small company, we have a big product. We are an experienced team with backgrounds at GitHub and other major tech companies with funding from top investors in Silicon Valley and Europe. Our team works extremely reasonable hours and we have a strong commitment to work-life balance.</p>\n<p>Beyond language learning, we’re on a bigger mission to help make lots of jobs for people who only need one skill: how to speak their native language. We currently teach German and Spanish and French to English speakers, as well as English to Spanish speakers. We have an international team and an international product, and we’re proud of it.</p>\n<h2>Benefits at Chatterbug</h2>\n<ul>\n<li>A leading role shaping a cutting edge product at a pivotal point in its development</li>\n<li>We’ll pay for you to learn a language - either with us or take a class, on us. You can also elect a friend or family member to learn with us for free, too</li>\n<li>26 days paid holiday</li>\n<li>Regular fun events, team dinners and an annual company summit abroad</li>\n<li>A lovely, apartment style office in the heart of Berlin (with free fruit!)</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>Proficiency in JavaScript, CSS and React</li>\n<li>Experience with React Native or excited to learn</li>\n<li>At least 3 years experience as a front-end engineer</li>\n<li>Have worked on a small team or desire to do so</li>\n<li>The necessary communication skills and initiative to lead your own projects</li>\n<li>You live in Berlin or are willing to move here</li>\n</ul>\n<p>Ideally you will also have:</p>\n<ul>\n<li>Experience with GraphQL, styled-components, webpack and Babel</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://jobs.chatterbug.com/o/senior-react-developer\">https://jobs.chatterbug.com/o/senior-react-developer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclp4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f1b11d7f6edb337f45c07816c6e3bccdc2a688e/logo.png"
    },
    {
        "id": "be0b9834-5996-4c17-bdf4-cadb45a3a398",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/be0b9834-5996-4c17-bdf4-cadb45a3a398",
        "created_at": "Tue Sep 10 16:14:01 UTC 2019",
        "company": "Clear Capital ",
        "company_url": "http://www.clearcapital.com",
        "location": "Reno-Tahoe, NV",
        "title": "Sr. Front End Engineer (React/Redux)",
        "description": "<p>We’re looking for thoughtful engineers with an eye and passion for quality to join our team and help Clear Capital grow. At Clear Capital, we foster a culture of innovation and are creating a world-class technology group that is poised for sustainable growth and success. As new and exciting opportunities reveal themselves in the world of Real Estate Valuation, we are primed to deliver the mission critical data that will change the mortgage finance sector for the better.</p>\n<p>We are an agile-minded Real Estate Tech company, nimble enough to move quickly and innovate faster than our larger competitors, and mature enough to outperform start-ups. We are building massively scalable solutions at an enterprise level for some of the largest financial companies on the planet. We’re deeply committed to meaningful collaboration and building applications that are beautiful, fast, and delightful. We believe in not just practicing Agile, but truly being agile; there is a difference. We value great thinkers, problem solvers, respectful communication, hard work, collaboration, and the sharing of ideas. We are on a mission of going from good to great and need the best minds to help us get there. Simply put, we need Amplifiers that go well beyond the average engineer’s production.</p>\n<p>What does this mean?\nWe seek to hire those that amplify the work we do by sharing their knowledge and experience with others. There are unprecedented opportunities for disruption in our industry by a technology and data-driven leader like Clear Capital. The industry is literally starving to leap forward into the future and we are at the forefront  of modern mobile, web, and machine learning solutions. We are the company that is seizing the moment and doing things others wish they could. By building a world-class engineering organization we are the ones creating new ideas and ways of doing things.</p>\n<p>Our stack and tool set\nJavaScript (ES6+)\nReact\nReact Native\nRedux\nNode\nD3\nGit\nGreensock\nWebpack\nBitBucket\nSemantic HTML\nJira and Confluence\nCSS, SASS, and Styled Components</p>\n<ul>\n<li>Our primary responsibility is simple: create the best possible user experience in our web and mobile applications</li>\n<li>We are product and user driven. The problems we’re solving are difficult and we need thinkers that are excited about this challenge and not afraid to ask questions</li>\n<li>We are always collaborating with product owners, product managers, designers and our backend Java developers</li>\n<li>We work together to explore possible solutions, iterate on our ideas, and then ultimately translate them into production applications</li>\n<li>We support our products from ideation to execution with cross-functional teams</li>\n<li>We continuously evolve our products and push to advance the industry</li>\n<li>We research new technology and design patterns in collaboration with fellow engineers to determine what will benefit us now and into the foreseeable future</li>\n</ul>\n<p>Who we are looking for</p>\n<ul>\n<li>Seasoned experience. 5+ years of web-based and mobile enterprise software development.</li>\n<li>Research and communication. We solve problems. Before that can happen we need to understand the problem and the proposed solution.</li>\n<li>Iterate and validate ideas. There are many different ways to solve a problem. There is a huge difference between \"It's working\" and \"It's the right solution\". We want the right answer, not just any answer. To achieve this, we research solutions and iterate on them with key members of our team for validation of our ideas.</li>\n<li>Quality standards and scalability. We have to be able to deliver on what we come up with. We need to be able to code our solutions following best practices and company standards.</li>\n<li>Collaborate and growth mindset. Iterating and being able to come up with a solution makes half of a developer. We need to be able to work through other people's solutions. We need to provide constructive feedback that makes not only our products better, but ultimately our developers better too.</li>\n</ul>\n<p>Characteristics we are looking for</p>\n<ul>\n<li>You are smart</li>\n<li>You also get it wrong but know its ok and don't blame others</li>\n<li>You understand the cycles of developer life</li>\n<li>You are flexible and open to others' ideas and solutions, not just your own</li>\n<li>You are nice, respectful, and awesome to work with</li>\n<li>You learn new things at a rapid pace and you enjoy it</li>\n<li>You love to collaborate and are open to feedback</li>\n<li>Your passion for tech is contagious</li>\n<li>You're an amplifier. Others grow when they work with and beside you</li>\n<li>We want engineers who think systematically, implement quickly, and innovate eagerly</li>\n</ul>\n<p>About Us</p>\n<p>Clear Capital is the premier provider of real estate valuation, analytics, and technology solutions. Powered by its more than 45 years worth of information on nearly every U.S. metro, neighborhood, and property, Clear Capital’s solutions are trusted by community credit unions and billion-dollar financial institutions alike. Clear Capital is headquartered in Reno-Tahoe with a team of more than 500 nationwide, dedicated to going wherever it leads, and doing whatever it takes.</p>\n<p>To all recruitment agencies: Clear Capital does not accept agency resumes. Please do not forward resumes to our jobs alias, Clear Capital employees or any other company location. Clear Capital is not responsible for any fees related to unsolicited resumes.</p>\n<p>Compensation\nSalary commensurate with experience</p>\n<p>Clear Capital is an equal opportunity employer</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/clearcapital/6acdc9ba-1038-4615-8588-ea03dd4f4ae3\">https://jobs.lever.co/clearcapital/6acdc9ba-1038-4615-8588-ea03dd4f4ae3</a></p>\n",
        "company_logo": null
    },
    {
        "id": "b79e84e6-bbb7-47d8-8b65-034ccea6f5cd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b79e84e6-bbb7-47d8-8b65-034ccea6f5cd",
        "created_at": "Tue Sep 10 12:28:47 UTC 2019",
        "company": "Cobiro ApS",
        "company_url": "http://www.cobiro.com",
        "location": "Copenhagen",
        "title": "Senior PHP Developer",
        "description": "<p><strong>Be a part of an exciting journey</strong></p>\n<p>At Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing easy-to-use, accessible and high-performing for everyone, by creating an online marketing hub.</p>\n<p>Working at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Flexible working hours</li>\n<li>An agile work environment</li>\n<li>Focus on quality solutions</li>\n<li>Options to attend relevant courses and conferences</li>\n<li>A team of passionate, skilled and experienced colleagues</li>\n<li>All the gear and food you need: breakfast on Fridays, lunch every day, sodas, sparkling water, fruit, vegetables, sweets...</li>\n<li>Frequent social company activities, Friday bar included</li>\n<li>Good working equipment</li>\n<li>A great working location at Esplanaden, Central Copenhagen</li>\n</ul>\n<p><strong>PHP Backend Developer (Laravel)</strong></p>\n<p>You will join a company where quality is valued: We know it sometimes takes time creating something great, and even if we do have deadlines we prefer a good product to quick launching. This means, you will work independently and take responsibilities of your own projects, and you can use your knowledge and curiosity to build something great.</p>\n<p>You will be joining a skilled tech team consisting of backend developers working within the Laravel framework. We practice daily stand-ups, 14 day sprints, and work within smaller teams. We can offer an agile working environment: we collaborate across departments as well, for example AI, QA, Frontend, or Product Management.</p>\n<p><strong>For this position, you will need:</strong></p>\n<ul>\n<li>Excellent PHP coding skills and solid experience in Laravel</li>\n<li>Substantial PostgreSQL/MySQL experience</li>\n<li>Experience with data integration, web services &amp; APIs</li>\n<li>Proficient in GIT, and knowledgeable of CI principles</li>\n<li>Sharp analytical mind with the ability to break down requirements and problems into smaller pieces</li>\n</ul>\n",
        "how_to_apply": "<p>We are looking forward to receiving your application through our application system - simply click on the link:</p>\n<p><a href=\"https://cobiro.bamboohr.com/jobs/view.php?id=29\">https://cobiro.bamboohr.com/jobs/view.php?id=29</a></p>\n<p>and attach your CV and/or Linkedin account.</p>\n<p>You will always get a reply when applying through our system.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWR4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4b7507e61374373455dc37d9e9f9318a5fcca983/cobiro-logo.jpg"
    },
    {
        "id": "ed4a2159-5315-468f-8e21-aaf47c55fae1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ed4a2159-5315-468f-8e21-aaf47c55fae1",
        "created_at": "Tue Sep 10 12:15:30 UTC 2019",
        "company": "Cobiro ApS",
        "company_url": "http://www.cobiro.com",
        "location": "Copenhagen",
        "title": "Senior PHP Developer (Research and Development)",
        "description": "<p><strong>Be a part of an exciting journey</strong></p>\n<p>At Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing easy-to-use, accessible and high-performing for everyone, by creating an online marketing hub.</p>\n<p>Working at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>\n<p>Flexible working hours</p>\n</li>\n<li>\n<p>Modern open plan office and a great working location at Esplanaden, Central Copenhagen</p>\n</li>\n<li>\n<p>Options to attend relevant courses and conferences</p>\n</li>\n<li>\n<p>A team of passionate, skilled and experienced colleagues</p>\n</li>\n<li>\n<p>All the gear and food you need: breakfast on Fridays, lunch every day, sodas, fruit, vegetables and sweets</p>\n</li>\n<li>\n<p>On-site massage and haircut</p>\n</li>\n<li>\n<p>Frequent fun and social company activities, Friday bar included</p>\n</li>\n<li>\n<p>Good working equipment</p>\n</li>\n</ul>\n<p><strong>PHP Developer (Research and Development)</strong></p>\n<p><strong>The opportunity</strong></p>\n<p>In this role you will be working both independently and alongside the Head of Research and Development, researching new and innovative technology for Cobiro’s products before creating prototypes and the associated documentation to be able to pass over to the development teams for implementation.</p>\n<p>A curious and detail-oriented mindset is vital as you will need  to keep up to speed with current and future technologies and best practices. In addition to this, the ability to work quickly and effectively in frequently fast-changing situations is crucial.</p>\n<p>The ideal candidate for this role has experience working as a PHP Developer with modern PHP frameworks (e.g. Laravel, Symfony or Lumen) and databases (e.g. MySQL), as well as with API’s, who is looking to take  an interesting new step in their career.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>\n<p>Undertaking continuous research and analysis of new trends and techniques to ensure that Cobiro is able to use the latest developments in order to continue to grow</p>\n</li>\n<li>\n<p>Developing small-scale prototypes and proofs of concept, which may later be scaled-up to full-scale solutions</p>\n</li>\n<li>\n<p>Creating documentation for these prototypes to provide a seamless handover to the development teams</p>\n</li>\n</ul>\n",
        "how_to_apply": "<p>We are looking forward to receiving your application through our application system - simply click on the link:</p>\n<p><a href=\"https://cobiro.bamboohr.com/jobs/view.php?id=54\">https://cobiro.bamboohr.com/jobs/view.php?id=54</a></p>\n<p>and attach your CV and/or Linkedin account.</p>\n<p>You will always get a reply when applying through our system.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--90cf8b134785edbf97e8a8c7dac9a7324c07d6db/cobiro-logo.jpg"
    },
    {
        "id": "cd3b2ca6-f3ef-4f5d-8a86-641eb025e6eb",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd3b2ca6-f3ef-4f5d-8a86-641eb025e6eb",
        "created_at": "Tue Sep 10 12:10:24 UTC 2019",
        "company": "Verimi GmbH",
        "company_url": "https://verimi.de/de",
        "location": "Berlin",
        "title": "(Senior) Backend Developer (m/f/d)",
        "description": "<p><strong>We are Verimi - The identity platform for Europe.</strong></p>\n<p>We develop solutions for digital identity management. We are a joint venture of many international shareholders, including Allianz, Axel Springer, Bundesdruckerei, Daimler, Deutsche Bahn, Deutsche Bank, Deutsche Telekom, Giesecke &amp; Devrient, Lufthansa, Samsung and Volkswagen. At our headquarters in Berlin-Kreuzberg we work with approximately 70 highly motivated employees. We want to offer a digitalized world without hurdles for users – where they can store their data once at Verimi and then use it again and again to log in and identify themselves online with just one click. Our focus is on the user: that's why only the user decides when to share data with companies.</p>\n<p>We are looking for team players to support us and who are passionate about making the Internet more convenient, secure and fair.</p>\n<p><strong>Your mission</strong></p>\n<ul>\n<li>You will focus on the backend of the Verimi system as part of an agile development team, making sure the software gets better with every commit.</li>\n<li>Your goal is to build high quality software by applying unit and integration tests and by code reviews.</li>\n<li>You contribute ideas and knowledge when architectural changes are discussed.</li>\n<li>You will support the product management in transferring ideas into great user stories. Building spikes and prototypes is your idea of fun.</li>\n</ul>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>You have an university degree in computer science or a related field.</li>\n<li>You have several years of experience as software developer.</li>\n<li>You are an expert in Java, Spring Boot, a RDBMS like PostgreSQL.</li>\n<li>You know a lot about designing and developing microservices.</li>\n<li>Your favorite working style is Scrum or Kanaban.</li>\n<li>Knowledge in Kubernetes, Swagger, OAuth2.0, Kafka, Javascript and React would be a plus.</li>\n<li>You are fluent  in English, German knowledge would be a plus.</li>\n</ul>\n<p><strong>Why Verimi?</strong></p>\n<ul>\n<li>We have the unique opportunity to shape the future of digital identity management in Europe.</li>\n<li>We are a dynamic start-up company that is built on a solid foundation with 13 well-known shareholders.</li>\n<li>We live flat hierarchies and short communication channels in a highly motivated and diverse team.</li>\n<li>We offer every colleague contribute their own ideas and thus shape our growth together.</li>\n<li>We work in a modern and central office in Berlin-Kreuzberg. Free drinks and fruit are just as much a part of it as flexible working hours, working from home, and 30 days vacation.</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/f9b476032697a32037e376a3e1c22b3b02298eac/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f65323134343063616533623331333432613163313932323166623032623039326662383231613630396532396534393362643161386239633632383735303634\"></p>\n",
        "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/5cd26fd8cbe2d7c2209bf6d426ff358e4c895fb6d45432163131f730cd325c44\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcU54IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dc366ecf3b91acc1c3f9726d7d92c50828b0c4ec/Verimi%20GmbH.jpg"
    },
    {
        "id": "1b6a930d-14b9-4987-b810-2ca3d930d1e8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1b6a930d-14b9-4987-b810-2ca3d930d1e8",
        "created_at": "Tue Sep 10 09:45:28 UTC 2019",
        "company": "Siemens",
        "company_url": "http://Siemens.com/careers",
        "location": "Munchen, Germany",
        "title": "Cloud Security Specialist (f/m/d)",
        "description": "<p><strong>Securing the Future Enterprise Today</strong></p>\n<p>Whether in the field of Industry, Smart Infrastructure or Energy: Digitalization is simplifying many facets of life. Therefore, we need to manage the associated risks caused through Cybercriminals.</p>\n<p>“Making an impact that matters!”, that’s the motto we live by. We at Siemens are continuously pushing the boundaries of sectors such as the Internet of Things (IoT), big data analytics, artificial intelligence (AI) and cloud technologies. However, with such digital innovations come unpredictable security challenges and vulnerabilities, thus increasing the risk of cyberattacks.</p>\n<p>We’re looking for brilliant, ambitious game changers like you to join our team of experts. Together let’s create cutting-edge security solutions and infrastructures that protect our data and the digital assets of our customers. Help us tackle tomorrow’s challenges today!</p>\n<p>Join us! Together we can make our digital world more secure.</p>\n<p><strong>We make real what matters. This is your role.</strong></p>\n<ul>\n<li>Within the global Siemens Cyber Security Team you are responsible for developing and driving the implementation of enterprise-wide Cloud Security Standards</li>\n<li>You are also responsible for reviewing new business cloud architectures in regard to the Siemens Cloud Security Standards and Security Controls</li>\n<li>You are assessing cloud services of providers like AWS, Microsoft Azure, etc. based on cloud security requirements and finding new ways of protection</li>\n<li>With your guidance you contribute to strategic IT investment planning, institutionalize shared services, foster reuse, and help project teams to plan, design, and deliver standardized solutions</li>\n<li>You have experience with Infrastructure as Code such as Terraform and Configuration Automation tools such as Ansible Tower</li>\n<li>You are technically supporting and consulting our CISO’s / ISO’s, Business and IT with the creation/review of protection assessment and concepts</li>\n<li>You enable our business to select the right cloud solutions and to integrate security requirements efficiently to comply with standards and internal governance / policy requirements within the Divisions and Regions</li>\n<li>Influencing behavior to reduce risk and raising risk awareness in the company is also a part of your responsibility</li>\n</ul>\n<p><strong>Use your skills to move the world forward.</strong></p>\n<ul>\n<li>You have a strong academic background - Master Degree of Information Technology / Management or • Business Informatics or similar (best with Information Security or Cloud Security focus) - and certified CISSP, CISM, CISA, CCSP, GIAC or similar</li>\n<li>You have longterm experience in Cloud Security Standards and Services</li>\n<li>You have advisory, consulting and hands-on implementation capabilities on cloud security</li>\n<li>In-depths audit and assessment skills are mandatory</li>\n<li>You have a profound knowledge in (cloud) security standards skills</li>\n<li>Know-How in certification schemes like 27001, IEC62443, C5 or others</li>\n<li>Your technical understanding of cloud infrastructures is at an excellent level</li>\n<li>Your English and German is business fluent combined with strong communication and analytical skills</li>\n</ul>\n<p><strong>We’ve got quite a lot to offer. How about you?</strong></p>\n<p>Do you want to know more about Cybersecurity at Siemens? <a href=\"http://www.siemens.com/cybersecurity\">www.siemens.com/cybersecurity</a></p>\n<p><strong><a href=\"http://www.siemens.com\">www.siemens.com</a></strong>\nif you wish to find out more about Siemens before applying.</p>\n<p><strong>+49 (9131) 17-1717</strong>\nif you wish to discuss any initial questions with our recruitment team.</p>\n<p><strong><a href=\"http://www.siemens.com/careers\">www.siemens.com/careers</a></strong>\nif you would like to find out more about jobs &amp; careers at Siemens.</p>\n<p>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.</p>\n<p>Job ID: 99287</p>\n<p>Organization: Corporate Technology</p>\n<p>Company: Siemens AG</p>\n<p>Experience Level: Experienced Professional</p>\n<p>Job Type: Full-time</p>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://jobs.siemens-info.com/jobs/99287?lang=en-gb&amp;stc=dehr100025\">https://jobs.siemens-info.com/jobs/99287?lang=en-gb&amp;stc=dehr100025</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUZ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3391885891f371d23bfd264a5e78d6a66fd6bd6/siemens_logo_png_1241263.png"
    },
    {
        "id": "0e423fa2-ea6f-4184-868c-76d44558a703",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e423fa2-ea6f-4184-868c-76d44558a703",
        "created_at": "Mon Sep 09 20:37:39 UTC 2019",
        "company": "Close",
        "company_url": "https://close.com/",
        "location": "European Time Zone",
        "title": "Site Reliability Engineer (100% Remote)",
        "description": "<p><strong>About Us</strong></p>\n<p>At <a href=\"https://close.com/\">Close</a>, we're building the sales communication platform of the future. With our roots as the very first sales CRM to include built-in calling, we're leading the industry toward eliminating manual processes and helping companies to close more deals (faster). Since our founding in 2013, we've grown to become a profitable, 100% globally distributed team of 39 high-performing, happy people that are dedicated to building a product our customers love. In order to continually meet our hiring goals, we need a full time dedicated recruiter to join the team.</p>\n<p>Our backend <a href=\"https://stackshare.io/close-crm/close\">tech stack</a> currently consists of Python Flask/Gunicorn web apps with our <a href=\"https://github.com/closeio/tasktiger\">TaskTiger</a> scheduler handling many of the backend asynchronous processing tasks.  Our data stores include MongoDB, Elasticsearch, PostgreSQL, MySQL, and Redis.  Our infrastructure runs on AWS using a combination of managed services like RDS and ElastiCache as well as EC2 instances managed by Puppet, Ansible, and Terraform.  Today we manage hundreds of EC2 instances and thousands of Docker containers on our Kubernetes clusters.</p>\n<p><strong>About You</strong></p>\n<p>We're looking for a full-time Site Reliability Engineer to join our core team who has significant experience building, managing, and monitoring infrastructure and backend services at scale.</p>\n<ul>\n<li>Come help us with projects like...</li>\n<li>Building out our Kubernetes infrastructure to include additional services, increased redundancy/scalability, and harnessing new k8s features</li>\n<li>Scale our Elasticsearch and MongoDB clusters to support our data growth</li>\n<li>Tune our MySQL and PostgreSQL databases</li>\n<li>Improve our public <a href=\"https://developer.close.com/\">API</a>’s performance and resiliency</li>\n<li>Tighten security across our infrastructure</li>\n<li>Implement autoscaling techniques that balance performance, workload demands and costs</li>\n<li>Improve our CI/CD process making builds/deployments faster and safer</li>\n<li>Further develop our Prometheus/Grafana monitoring infrastructure</li>\n<li>Enhance our Elasticsearch/Logstash/Kibana(ELK) logging stack</li>\n</ul>\n<p><strong>Bonus</strong>: Are you a MongoDB expert? Please let us know! 🌟</p>\n<p><strong>You should...</strong></p>\n<ul>\n<li>Be able to work in a continental European timezone (strongly preferred)</li>\n<li>Have real world experience building scalable systems, working with large data sets, and troubleshooting various back-end challenges under pressure</li>\n<li>Have significant experience with *nix, Python, bash, Terraform, Ansible, or similar backend systems and frameworks</li>\n<li>Experience working with large databases running on MySQL, PostgreSQL, and/or MongoDB</li>\n<li>Have experience configuring monitoring, logging, and other tools to provide visibility and actionable alerts</li>\n<li>Enjoy automating processes using Python, bash, Terraform, Ansible, or other scripting languages</li>\n<li>Have experience with Docker containers and microservices</li>\n<li>Understand the full web stack, networking, and low level Unix computing</li>\n<li>Always be thinking of ways to improve reliability, performance, and scalability of the infrastructure</li>\n<li>Be self-motivated and comfortable with responsibility</li>\n<li>Have participated in and be comfortable with being part of an on-call rotation. (1 out of every 6 weeks)</li>\n</ul>\n<p><strong>Why Close?</strong></p>\n<ul>\n<li>100% remote (we believe in trust and autonomy)</li>\n<li>2 x annual team retreats ✈️ <a href=\"https://www.youtube.com/watch?v=gKjyXMz-q-Q&amp;feature=youtu.be\">(Lisbon Retreat Video)</a>\n</li>\n<li>Competitive salary</li>\n<li>7 weeks PTO (includes company-wide winter holiday break)</li>\n<li>1 month paid sabbatical after 5 years</li>\n<li>$200/month co-working stipend</li>\n<li>Paid parental leave (10 wks primary caregiver / 4 wks secondary caregiver)</li>\n<li>\n<a href=\"https://close.io/about/\">Our story and team</a> 🚀</li>\n<li>Checkout our <a href=\"https://www.glassdoor.co.uk/Reviews/Close-io-Reviews-E1155591.htm\">Glassdoor Reviews</a>\n</li>\n</ul>\n<p>At Close, everyone has a voice. We encourage transparency and practicing a mature approach to the work-place. In general, we don’t have strict policies, we have guidelines. Work/Life harmony is an important part of our organization - we believe you bring your best to work when you practice self-care (whatever that looks like for you).</p>\n<p>We come from 13 countries and 16 states; a collection of talented humans rich in diverse backgrounds, lifestyles, and cultures. Twice a year we meet up somewhere around the world to spend time with one another. We see these retreats as an opportunity to strengthen the social fiber of our community.</p>\n<p>This team is growing in more ways than one - we’ve recently launched 10 babies (and counting!). Unanimously, our favorite and most impactful value is “Build a house you want to live in.” We strive to make decisions that are authentic for our organization. At Close, we have a high care factor for one another, in making an awesome product and championing the success of our customers.</p>\n<p>Interested in <a href=\"https://close.com/\">Close</a> but don't think this role is the best fit for you? View our <a href=\"http://jobs.close.com/\">other positions</a>.</p>\n",
        "how_to_apply": "<p>Apply on <a href=\"https://jobs.lever.co/close.io/38d0c4ac-c3eb-47e9-a49e-4611f96eef8d?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">our site</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFZ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5c415b3aba3f053fa1a270d4d543d0aa8443bfd8/mark.png"
    },
    {
        "id": "e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "created_at": "Mon Sep 09 15:29:25 UTC 2019",
        "company": "Noe & Associates",
        "company_url": "http://http",
        "location": "New York, NY",
        "title": "Web Developer",
        "description": "<p>A leading international branding and design consultancy is seeking a seasoned Web Developer who will be responsible for coding innovative websites for world renowned premium brand, real estate, hospitality, architecture and design clients.</p>\n<p>The Web Developer will be proficient in building and maintaining small to medium size websites in a fast paced environment. Experienced in working with a team of designers and shipping code as an individual contributor within the team. Individual will care about writing elegant code and look for opportunities to build user-friendly websites that fulfill the goals of an identity system.</p>\n<p>Ideal candidate will have a strong interest in design, or a desire to work closely with designers during the design phase of the project. You’ll learn about the details that make the brand identity work well on multiple levels, and eventually help guide the website design along interesting pathways based on technical opportunities and limitations.</p>\n<p>Responsibilities will include:</p>\n<p>▪\tWebsite and software application designing, building and maintenance, including integration    with third party API.</p>\n<p>▪\tUsing scripting or authoring languages, management tools, content creation tools, applications and digital media.</p>\n<p>▪\tConferring with clients and teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions.</p>\n<p>▪\tPerforming Website updates as required.</p>\n<p>▪\tDeveloping or validating test routines and schedules to ensure that test cases mimic external interfaces and address all browser and device types.</p>\n<p>▪\tMaintaining an understanding of the latest Web applications and programming practices.</p>\n<p>▪\tIdentifying problems uncovered by client feedback and testing, and correcting problems.</p>\n<p>▪\tEvaluating code to ensure it meets industry standards, is valid, is properly structured, and is compatible with browsers, devices and operating systems.</p>\n<p>Candidate should possess following skills:</p>\n<p>▪\tBachelor degree in Computer Science or related field, or relevant experience.</p>\n<p>▪\tSolid knowledge and experience in programming applications.</p>\n<p>▪\tProficient in JavaScript, HTML, HTML5, CSS3.</p>\n<p>▪\tDeep knowledge of Ruby on Rails and comfortable with Postgres and Sass.</p>\n<p>▪\tFamiliarity with version control, ideally Git and a GitHub-based workflow.</p>\n<p>▪\tProficient in back-end development and maintenance on Heroku, AWS &amp; Linode services. Also, familiarity with virtual private servers (VPS) and Linux environment.</p>\n<p>▪\tSelf-starter with strong communication and interpersonal skills.  Organized, reliable, with the ability to multi-task and manage multiple deliverables/projects.</p>\n<p>▪\tFamiliarity with PHP based frameworks, such as WordPress or Drupal or prior experience in e-commerce platforms such as Magento are a plus.</p>\n",
        "how_to_apply": "<p>If interested, please email resume, portfolio and cover note to <a href=\"mailto:careers@noeassociates.com\">careers@noeassociates.com</a></p>\n",
        "company_logo": null
    },
    {
        "id": "1512c62c-c43e-45fe-9351-fb7922a577f7",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1512c62c-c43e-45fe-9351-fb7922a577f7",
        "created_at": "Mon Sep 09 13:12:09 UTC 2019",
        "company": "Cancer Research UK Manchester Institute, University of Manchester",
        "company_url": "https://www.cruk.manchester.ac.uk",
        "location": "Manchester",
        "title": "Principal Computational Biologist",
        "description": "<p>Starting Salary: in the range of £31,334 – £43,000 per annum (dependent upon experience)\nClosing Date: 19/09/2019\nDuration of Post: Fixed term until 19 January 2022</p>\n<p>About the role:</p>\n<p>A post for a Principal Computational Biologist is currently available within the Manchester Centre for Cancer Biomarker Sciences (MCCBS) led by Prof Caroline Dive CBE at the CRUK Manchester Institute (CRUK MI) linking with colleagues at the University's Single Cell Centre. The MCCBS has an international reputation for liquid biopsies and the post holder will focus on the analysis of genomics data derived from individual cancer cells, including Circulating Tumour Cells (CTCs, see Carter et al. (2017) Nature Medicine). Within the MCCBS, you will join the Bioinformatics and Biostatistics (BBS) Team led by Dr Alastair Kerr and work closely with Prof Ged Brady the MCCBS deputy and leading expert in nucleic acids biomarkers.</p>\n<p>You will be (or become) an expert in and champion single cell analysis, developing grant applications within the team and providing guidance to enable best practice for experimental design. Working with the CRUK MI High Performance Computing [HPC] Team, you will enable programs and pipelines for analysis, establish approaches for the integration of the analysis with multiple genome-wide ‘-omics datasets including DNA and RNA sequencing and turn these into robust analytical pipelines that will be used to explore the clinical consequences of inter-cell heterogeneity on tumour evolution and therapy responses.</p>\n<p>Longer-term ambitions include the analysis of single cell methylomics and ChIP sequencing data. You will have access to the dedicated HPC genomics core facility at the CRUK MI, and will write computationally intensive code to analyse high volumes of cancer genomics data.</p>\n<p>Meet our bioinformaticians and statisticians within our service and research groups: <a href=\"https://www.cruk.manchester.ac.uk/recruitment/candidate/meetourteam\">https://www.cruk.manchester.ac.uk/recruitment/candidate/meetourteam</a></p>\n<p>About you:</p>\n<p>You will have a PhD in Computational Biology, Statistics, or a related discipline or a relevant postgraduate degree plus significant relevant experience. You will have strong communication skills and a desire to apply your talents collaboratively with scientists across disciplines with an ethos of team science.</p>\n<p>In addition, you will have significant relevant experience developing R/Bioconductor, be conversant with software engineering techniques and have an excellent grasp of the statistical approaches used to analyse genome-wide datasets.  The post will suit a highly enthusiastic scientist with a desire to see single cell genomics help unravel tumour heterogeneity and evolution to optimise precision medicine for cancer patients.</p>\n<p>Why choose Cancer Research UK Manchester Institute?</p>\n<p>The Cancer Research UK Manchester Institute (<a href=\"http://www.cruk.manchester.ac.uk\">www.cruk.manchester.ac.uk</a>), an Institute of The University of Manchester (<a href=\"http://www.manchester.ac.uk\">www.manchester.ac.uk</a>), is a world-leading centre for excellence in cancer research.  The Institute is core funded by Cancer Research UK (<a href=\"http://www.cancerresearchuk.org\">www.cancerresearchuk.org</a>), the largest independent cancer research organisation in the world. We are currently situated at the internationally-renowned life sciences campus at Alderley Park in Cheshire England, 15 miles from Manchester, a vibrant and dynamic city surrounded by beautiful countryside.</p>\n<p>We are partnered with The Christie NHS Foundation Trust (adjacent to the CRUK MI Paterson Building) in South Manchester (<a href=\"http://www.christie.nhs.uk\">www.christie.nhs.uk</a>), one of the largest cancer treatment centres in Europe.  These factors combine to provide an exceptional environment in which to pursue basic, translational and clinical research programmes</p>\n<p>How to apply?</p>\n<p>To apply for this position please visit our website: <a href=\"https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies\">https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies</a></p>\n<p>For any informal enquiries about this post, please contact Dr Alastair Kerr, BBS Team Lead, email: <a href=\"mailto:alastair.kerr@manchester.ac.uk\">alastair.kerr@manchester.ac.uk</a>.</p>\n",
        "how_to_apply": "<p>Apply via our website:</p>\n<p><a href=\"https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies\">https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEp4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9a0c04350a7fe23efbc5b08244e314d08bc668e6/CRUK%20MI%20Logo%20(Small).jpg"
    },
    {
        "id": "17a8d28b-c9c0-4b5a-a0bb-4c75e4a41982",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/17a8d28b-c9c0-4b5a-a0bb-4c75e4a41982",
        "created_at": "Mon Sep 09 13:08:28 UTC 2019",
        "company": "Cancer Research UK Manchester Institute, University of Manchester",
        "company_url": "https://www.cruk.manchester.ac.uk",
        "location": "Manchester, England",
        "title": "Principal Software Architect",
        "description": "<p>Starting Salary: within the range of £33,000 – £51,000 per annum (dependent upon experience)\nClosing Date: 03/10/2019\nDuration of Post: Fixed term for 2 years (in the first instance)</p>\n<p>About the role:</p>\n<p>The Cancer Research UK Manchester Institute (CRUK MI) has access to state of the art genomics, proteomics and imaging technology, which are together being used to advance our understanding of cancer. Our aim is to gain a greater understanding of the fundamental basis of how cancer develops and apply that knowledge to develop new diagnostic tests, potential treatments and better ways to predict the outcomes. Genomics technologies are central to this work, and analysis of the data generated by these technologies is reliant on substantial amounts of computing. Among others this is achieved on site through the use of a dedicated HPC facility housed in a machine room on site.</p>\n<p>We are seeking an experienced Principal Software Architect to join our dynamic Scientific Computing Team. You will develop and implement bioinformatics analysis pipelines for personalised medicine based on the Snakemake workflow management system to support the analysis of large volumes of deep sequencing and other types of data. Pipelines will run on a 1’500 core HPC Linux cluster that resides in a dedicated data centre. The Scientific Computing Team provides a stimulating and motivating work environment, you will be encouraged and supported to keep track in this field.</p>\n<p>About you:</p>\n<p>You will have a PhD in Computer Science or Bioinformatics (or related discipline) or a relevant postgraduate degree in a related field plus significant relevant experience. You will also have a considerable depth of specialist programming knowledge, experience and skills, a familiarity with workflow development and data management and strong communication skills. You will also have experience with working in HPC environments and batch systems in particular. This role is an exciting opportunity to join a highly interdisciplinary team that combines biology with computer science, mathematics and software engineering, whose goal is to help understanding the cancer genome.</p>\n<p>Although an understanding of cancer genomics and cell biology would be advantageous, it is not a prerequisite.</p>\n<p>Why choose Cancer Research UK Manchester Institute?</p>\n<p>The Cancer Research UK Manchester Institute (<a href=\"http://www.cruk.manchester.ac.uk\">www.cruk.manchester.ac.uk</a>), an Institute of The University of Manchester (<a href=\"http://www.manchester.ac.uk\">www.manchester.ac.uk</a>), is a world-leading centre for excellence in cancer research.  The Institute is core funded by Cancer Research UK (<a href=\"http://www.cancerresearchuk.org\">www.cancerresearchuk.org</a>), the largest independent cancer research organisation in the world. We are currently situated at the internationally-renowned life sciences campus at Alderley Park in Cheshire England, 15 miles from Manchester, a vibrant and dynamic city surrounded by beautiful countryside.</p>\n<p>We are partnered with The Christie NHS Foundation Trust (adjacent to the CRUK MI Paterson Building) in South Manchester (<a href=\"http://www.christie.nhs.uk\">www.christie.nhs.uk</a>), one of the largest cancer treatment centres in Europe.  These factors combine to provide an exceptional environment in which to pursue basic, translational and clinical research programmes.</p>\n<p>How to apply?</p>\n<p>To apply for this position please visit our website:</p>\n<p><a href=\"https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies\">https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies</a></p>\n<p>For informal enquiries please contact Dr Marek Dynowski, Head of Scientific Computing via email: <a href=\"mailto:marek.dynowski@cruk.manchester.ac.uk\">marek.dynowski@cruk.manchester.ac.uk</a></p>\n",
        "how_to_apply": "<p>Apply via our website:</p>\n<p><a href=\"https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies\">https://www.cruk.manchester.ac.uk/recruitment/candidate/searchvacancies</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzF4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0d1d928f7ad5f3430690f2f26e27045af00509c3/CRUK%20MI%20Logo%20(Small).jpg"
    },
    {
        "id": "09719a5b-600d-4517-950e-4e1e00248577",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/09719a5b-600d-4517-950e-4e1e00248577",
        "created_at": "Mon Sep 09 10:16:17 UTC 2019",
        "company": "VodafoneZiggo",
        "company_url": "https://careers.vodafoneziggo.com",
        "location": "Utrecht",
        "title": "Tibco - API Gateway Developer",
        "description": "<p><strong>Is het schrijven van code jouw passie en ontwikkel jij graag applicaties die naadloos aansluiten op ons IT landschap? Misschien ben jij dan wel onze nieuwe Developer!</strong></p>\n<p><strong>Dit doe je voor onze klant</strong></p>\n<p>Je hebt het vast wel gehoord. De markt voor telefonie, datacommunicatie en televisiediensten is behoorlijk turbulent. Wij, maar ook onze klanten stellen steeds hogere eisen aan kwaliteit en service. Bij VodafoneZiggo spelen we hier elke dag op in omdat we écht het beste voor onze klanten willen. Dit zie je ook 1-op-1 terug in onze IT-processen en in onze applicaties. Daar werken we continu aan vernieuwing en verbetering.</p>\n<p>In ons team is er ruimte voor een <strong>Tibco - API Gateway Developer.</strong></p>\n<p>Voor deze functie zijn we op zoek naar een kandidaat die enerzijds kennis en ervaring heeft van Enterprise Service Bus applicaties, API Gateways en anderzijds van applicatie ontwikkeling met talen als b.v. Oracle PL-SQL of complexe datastructuren.\nOns team functioneert in een Dev-Ops omgeving en is dé bindende factor in het IT landschap van Vodafoneziggo.</p>\n<p><strong>Zó doe je dit</strong></p>\n<p>Wij gaan je niet vertellen hoe jij je werk moet doen, daar ben jij de professional voor. Maar dat je verantwoordelijk bent voor kwalitatief hoogstaande code met hoge snelheid en onder grote druk af te leveren, zal voor jou geen verrassing zijn.\nWe geven je de middelen en omgeving om te kunnen excelleren en continu te verbeteren in je werk.</p>\n<p><strong>Jij versterkt</strong></p>\n<p>Onze afdeling Development binnen IT is verantwoordelijk voor het definiëren, ontwikkelen en ondersteunen van alle lokale VodafoneZiggo IT applicaties en systemen. Dit team is met name actief met architectuur integratie, SOA-services, koppelingen van Enterprise Service Bus applicaties, API Gateway security policies en BPM-processen.</p>\n<p>Naast dat er voornamelijk in projectverband wordt gewerkt aan grote en complexe applicaties, worden er ook kleinere applicaties ontwikkeld. De applicaties worden voornamelijk ontwikkeld conform gedefinieerde processen en standaarden binnen VodafoneZiggo, zodat kwaliteit en beheersbaarheid gewaarborgd zijn. Wij zijn vaak ‘enablers’ en bieden dus de technische mogelijkheden zodat de technische projecten succesvol opgeleverd kunnen worden. Hierdoor is nauwe samenwerking met alle andere (sub)afdelingen van Technology noodzakelijk.</p>\n<p><strong>Wij</strong></p>\n<p>VodafoneZiggo is een krachtenbundeling van twee sterke Nederlandse bedrijven. Samen vormen we sinds januari 2017 een ijzersterke combinatie in Nederland. Als communicatie-provider bieden we onze klanten het beste aan entertainment, mobiele telefonie, vaste telefonie en internet. Met onze producten en diensten inspireren we mensen, bedrijven en de samenleving om contact te maken. Of dat nu onderweg, thuis of op het werk is.</p>\n<p>Met meer dan 8.000 medewerkers zijn we vol energie, ambitieus en maatschappelijk betrokken. Trots op wat wij presteren en met wie we dit doen. Met voor ieder veel ruimte om zich te kunnen ontwikkelen en kansen te benutten.</p>\n<p><strong>Jij hebt hét</strong></p>\n<p>De ideale persoon is een Developer in hart en nieren waarbij het schrijven van code een passie is en met de volgende bagage;</p>\n<ul>\n<li>HBO werk- en denkniveau</li>\n<li>Minimaal drie jaar ervaring als applicatie Developer</li>\n<li>Ruime ervaring met de Tibco Suite (BW, BPM, etc.)</li>\n<li>Kennis van systeemarchitecturen, IT-standaardwerkwijzen en concepten</li>\n<li>Kennis van webservices (HTML, XML, XSLT of XPath)</li>\n<li>Kennis van de Agile aanpak</li>\n<li>de flexibiliteit om ook op onregelmatige tijden te werken</li>\n<li>Uitstekende kennis van <strong>Nederlands vereist</strong> (mondeling/schriftelijk)</li>\n</ul>\n<p>Heb jij de juiste mix van kennis, dynamiek én kwaliteit op zak? Ontwikkel jij graag geweldige applicaties die naadloos aansluiten op het IT-landschap? Dan zijn we op zoek naar jou en dan is Ziggo dé plek om je technische skills in te zetten.</p>\n<p><strong>Jij doet het</strong></p>\n<p>Are you in? Ben jij dé Tibco/API Gateway Developer die wij zoeken? <a href=\"https://ziggo.redirect.your-jobresponse.com/tibco_api_gateway_developer_utrecht/254735/V819/solliciteren\">Klik nu op deze link</a> en reageer!</p>\n<p>Heb je nog vragen? Stuur ons een bericht <a href=\"mailto:recruitment@vodafoneziggo.com\">recruitment@vodafoneziggo.com</a> en onze recruiter neemt zsm contact met je op!</p>\n<p><em>Deze vacature staat voor onze open zoektocht naar een nieuwe VodafoneZiggo collega.\nDit is dan ook géén oproep voor acquisitie.</em></p>\n",
        "how_to_apply": "<p><a href=\"https://ziggo.redirect.your-jobresponse.com/tibco_api_gateway_developer_utrecht/254735/V819/solliciteren\">Klik hier om te solliciteren</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2R4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04e7bf10588d23fa358818db08e4805da93305ef/Vodafone%20Ziggo.jpg"
    },
    {
        "id": "926ed0e9-8569-481b-8be4-d0313e32f50d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/926ed0e9-8569-481b-8be4-d0313e32f50d",
        "created_at": "Sat Sep 07 00:15:54 UTC 2019",
        "company": "DISQO",
        "company_url": "https://www.disqo.com/",
        "location": "Glendale, CA ",
        "title": "Lead PHP Engineer ",
        "description": "<p>The Company:</p>\n<p>DISQO is a next-generation consumer insights platform. We provide the highest quality consumer data to the world's largest market research agencies, analytics companies, and brands. We operate one of the world's largest true consumer insights panels. This data helps our clients understand user behavior, build better experiences, and make better decisions. We utilize cutting-edge technology and innovative, out-of-the-box strategies to collect and analyze insights which help shape the products and services of tomorrow.\nWe believe the best software is written and managed by small teams that know how to make the impossible possible. We use agile software development techniques and modern tools to focus our efforts on solving our business goals. We use OKRs to track everything we do. We deliver early and often. We obsess over our code, architecture, and infrastructure. And we believe that these practices lead to higher quality products.</p>\n<p>The role:</p>\n<p>DISQO is hiring a Lead PHP Engineer to manage a team of Engineers on implementing state of the art technologies; laying the foundation for all future development and scalability. This role reports into the Director of Engineering and will be responsible for DISQO’s main application, Survey Junkie.</p>\n<p>Through Survey Junkie, DISQO gathers attitudinal and behavioral data, conducting 1.5 MM+ surveys each month. With hundreds of thousands of users, every update has an immediate impact on our users. Survey Junkie users are based in the U.S., Australia, and Canada.</p>\n<p>Working closely with Product, this role will be responsible for applying best practices to ensure our users have an amazing in-app experience, introduce improved features, reduce cycle time and enable the marketing and sales teams to be more effective.</p>\n<p>What you will do:</p>\n<ul>\n<li>Be a part of a highly functional autonomous Agile Team</li>\n<li>Lead technical discussions and guide the team to implement best practices</li>\n<li>Define and measure code quality over time to track improvement</li>\n<li>Ensure not just development, but testing and documentation is also part of the definition of done\nuser stories to enable sprint success</li>\n<li>Build CI tools to enable rapid feedback and deployment and test automation</li>\n<li>Lead design and code reviews</li>\n</ul>\n<p>What you bring to the table:</p>\n<ul>\n<li>6+ years of modern PHP programming on a large custom codebase</li>\n<li>Subject matter expertise in PHP development</li>\n<li>Experience with Laravel or Lumen</li>\n<li>Solid knowledge of the Design Patterns</li>\n<li>Experience scaling web apps</li>\n<li>Experience with Linux</li>\n<li>Fluent in English reading/writing/speaking</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Experience with building RESTful APIs</li>\n<li>Amazon Web Services (AWS)</li>\n<li>Experience with Containerization, Docker, Kubernetes &amp; Service Mesh</li>\n<li>Experience with CI/CD</li>\n<li>Experience building Analytics/Data-Driven applications</li>\n<li>GitLab or similar environment</li>\n</ul>\n<p>DISQO is an equal opportunity employer</p>\n",
        "how_to_apply": "<p><a href=\"https://www.disqo.com/careers/career/?id=4338919002?gh_jid=4338919002\">https://www.disqo.com/careers/career/?id=4338919002?gh_jid=4338919002</a></p>\n",
        "company_logo": null
    },
    {
        "id": "e67a5e0c-feb0-4bf2-a279-13699606574b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e67a5e0c-feb0-4bf2-a279-13699606574b",
        "created_at": "Mon Feb 18 08:48:50 UTC 2019",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": "https://www.otto.de/",
        "location": "Hamburg, Deutschland",
        "title": "Full Stack Developer (w/m/divers) Fokus Frontend | Inhouse Startup OTTO NOW",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p><strong>Wir sind OTTO NOW</strong> – das neue Geschäftsmodell von OTTO: Wir vermieten Produkte, statt sie zu verkaufen. Gemeinsam entwickeln wir mit viel Engagement und hoher Gestaltungsfreiheit einen neuen Markt. Dabei verantworten wir alle Teile des Geschäftsmodells und der zugehörigen Prozesse, die auf unserer Microservice-Plattform aufbauen.</p>\n<p>In unserem aktuell <a href=\"https://www.ottonow.de/team\">16-köpfigen Team</a> vereinen wir zu gleichen Teilen die fachlichen und technischen Kompetenzen zur Weiterentwicklung von OTTO NOW. Von der Roadmap über die Epics bis zur einzelnen Story arbeiten bei uns Entwickler, Fachexperten und Product Owner eng zusammen.</p>\n<p>Als Inhouse Startup mit eigener Plattform erzielen wir schnelle Fortschritte. Um dabei den Überblick zu behalten, kombinieren wir die Vorzüge von Scrum und Kanban und passen diese fortlaufend an unser wachsendes Team an.</p>\n<p>﷟HYPERLINK \"<a href=\"https://stackshare.io/otto-now/otto-now\">https://stackshare.io/otto-now/otto-now</a>\" Unseren <strong>Tech Stack</strong> (u.a. Kotlin, React und Typescript) findest du <a href=\"https://stackshare.io/otto-now/otto-now\">HIER</a>!</p>\n<p><strong>Das bringt der Job</strong>:\n-Dein Schwerpunkt liegt auf der Weiterentwicklung unserer Frontends für unsere Kunden, unsere Kundenberatung und unser Team.\n-Gleichzeitig unterstützt du bei der Weiterentwicklung im Backend und dem Betrieb unserer Systeme mit verteilter Architektur (Microservices).\n-In unserem Daily berichtest du, was du am Tag zuvor durch unsere vollautomatisierte Deployment Pipeline in die Cloud gepusht hast.\n-Zusätzlich zu Konzeption, Umsetzung, Testing, QA bis zum Betrieb deiner entwickelten Software gestaltest du unsere Teamkultur und Zusammenarbeit in unseren Retros (und bei spontanen Playstation-Sessions) mit.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Soeren.Nilsson@otto.de\">Soeren.Nilsson@otto.de</a>  aus dem OTTO NOW-Team oder triff uns und unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</p>\n<p><strong>Das brauchen wir</strong>:\n<strong>Must-have</strong>: Javascript-SPA-Frameworks (z.B. React, Angular, Vue); Typescript; Webpack; SASS.</p>\n<p><strong>Nice-to-have</strong>: Erfahrung in verteilter Architektur (z.B. Microservices); Erfahrung in crossfunktionaler Teamzusammenarbeit und agilen Entwicklungsmethoden (Scrum, Kanban); Bootstrap; Amazon AWS; Erfahrung mit JVM-Sprachen (bspw. Kotlin, Java, Groovy); Docker; PostgreSQL; Betrieb von ECS oder Kubernetes; Kafka; Spring-Boot; Terraform; ElasticSearch.</p>\n<p><strong>Das bieten wir</strong>:</p>\n<p>-Entwicklungsumgebung, OS und gelegentlich Home-Office statt Büro – du hast die Wahl!\n-Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche -Entwicklung betrifft – wir unterstützen dich dabei!\n-Komm mit uns auf (internationale) Fachkonferenzen wie code.talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop\n-<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a> , flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice- und Sabbatical-Möglichkeiten\n-Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>!</p>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2fabb17231a3c973e33a2bbc59afb79aae1c1abb/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "3299b71e-0c21-4bec-9c04-0d74c9db6331",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3299b71e-0c21-4bec-9c04-0d74c9db6331",
        "created_at": "Mon Feb 18 08:58:54 UTC 2019",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": "https://www.otto.de/",
        "location": "Hamburg, Deutschland",
        "title": "Full Stack Developer (w/m/divers) Fokus Frontend | Inhouse Startup OTTO NOW ",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p><strong>Wir sind OTTO NOW</strong> – das neue Geschäftsmodell von OTTO: Wir vermieten Produkte, statt sie zu verkaufen. Gemeinsam entwickeln wir mit viel Engagement und hoher Gestaltungsfreiheit einen neuen Markt. Dabei verantworten wir alle Teile des Geschäftsmodells und der zugehörigen Prozesse, die auf unserer Microservice-Plattform aufbauen.</p>\n<p>In unserem aktuell <a href=\"https://www.ottonow.de/team\">16-köpfigen Team</a> vereinen wir zu gleichen Teilen die fachlichen und technischen Kompetenzen zur Weiterentwicklung von OTTO NOW. Von der Roadmap über die Epics bis zur einzelnen Story arbeiten bei uns Entwickler, Fachexperten und Product Owner eng zusammen.</p>\n<p>Als Inhouse Startup mit eigener Plattform erzielen wir schnelle Fortschritte. Um dabei den Überblick zu behalten, kombinieren wir die Vorzüge von Scrum und Kanban und passen diese fortlaufend an unser wachsendes Team an.</p>\n<p>﷟HYPERLINK \"<a href=\"https://stackshare.io/otto-now/otto-now\">https://stackshare.io/otto-now/otto-now</a>\" Unseren <strong>Tech Stack</strong> (u.a. Kotlin, React und Typescript) findest du <a href=\"https://stackshare.io/otto-now/otto-now\">HIER</a>!</p>\n<p><strong>Das bringt der Job</strong>:\n-Dein Schwerpunkt liegt auf der Weiterentwicklung unserer Frontends für unsere Kunden, unsere Kundenberatung und unser Team.\n-Gleichzeitig unterstützt du bei der Weiterentwicklung im Backend und dem Betrieb unserer Systeme mit verteilter Architektur (Microservices).\n-In unserem Daily berichtest du, was du am Tag zuvor durch unsere vollautomatisierte Deployment Pipeline in die Cloud gepusht hast.\n-Zusätzlich zu Konzeption, Umsetzung, Testing, QA bis zum Betrieb deiner entwickelten Software gestaltest du unsere Teamkultur und Zusammenarbeit in unseren Retros (und bei spontanen Playstation-Sessions) mit.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Soeren.Nilsson@otto.de\">Soeren.Nilsson@otto.de</a>  aus dem OTTO NOW-Team oder triff uns und unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</p>\n<p><strong>Das brauchen wir</strong>:</p>\n<p><strong>Must-have</strong>: Javascript-SPA-Frameworks (z.B. React, Angular, Vue); Typescript; Webpack; SASS.</p>\n<p><strong>Nice-to-have</strong>: Erfahrung in verteilter Architektur (z.B. Microservices); Erfahrung in crossfunktionaler Teamzusammenarbeit und agilen Entwicklungsmethoden (Scrum, Kanban); Bootstrap; Amazon AWS; Erfahrung mit JVM-Sprachen (bspw. Kotlin, Java, Groovy); Docker; PostgreSQL; Betrieb von ECS oder Kubernetes; Kafka; Spring-Boot; Terraform; ElasticSearch.</p>\n<p><strong>Das bieten wir</strong>:</p>\n<p>-Entwicklungsumgebung, OS und gelegentlich Home-Office statt Büro – du hast die Wahl!\n-Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche -Entwicklung betrifft – wir unterstützen dich dabei!\n-Komm mit uns auf (internationale) Fachkonferenzen wie code.talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop\n-<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a> , flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice- und Sabbatical-Möglichkeiten\n-Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>!</p>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjFlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--88e15377a539ffd609fc55f485d18cf0386710ed/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "98c094f6-3d19-4fa6-8b1e-53e2fb7f1ac8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/98c094f6-3d19-4fa6-8b1e-53e2fb7f1ac8",
        "created_at": "Tue Jan 29 11:03:39 UTC 2019",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": "https://www.otto.de/unternehmen/jobs/",
        "location": "Deutschland, Hamburg",
        "title": "Developer (w/m/divers) | Team System Integration",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p>Wir sind das Team System Integration, ca. zehn Teammitglieder. Unser Aufgabengebiet: Wir managen und betreiben Services in unterschiedlichen Cloud-Umgebungen und kreieren innovative Lösungen für die Entwicklungsteams von otto.de. Unsere aktuellen Themen: Authentifizierung im Cloud Umfeld und Full Stack Logging Cluster on demand. Was uns verbindet sind Teamgeist, Gestaltungsfreiheit, Eigenverantwortung, Flexibilität, Qualitätsanspruch und die Passion, einen stabilen, hochverfügbaren, sicheren und performanten Webshop bereitzustellen. Wir arbeiten agil und nach Scrum, entwickeln auch mit anderen Entwicklerteams im Pair und arbeiten gemeinsam an der Optimierung unserer Website. Was wir sonst machen? – Deiner Bewerbung entgegenfiebern!</p>\n<p>Diesen Tech Stack haben wir im Angebot: Java, Ruby, OAuth 2.0, Python, AWS, Linux etc. und das Arbeiten mit Open Source Technologien…</p>\n<p><strong>Das bringt der Job</strong>:\n-Du entwickelst unsere Software mit Hilfe von Continuous Integration und Test Automation.\n-Du gestaltest und entwickelst Tools, die die Robustheit, die Automatisierung von Prozessen, Skalierbarkeit, Logging u.v.m. verbessern: You build it, you run it!\n-Du erfasst und überwachst Services mittels Leistungsindikatoren.\n-Du designst und implementierst unsere Cloud-Infrastrukturen kontinuierlich weiter und unterstützt die Fachbereiche bei der Umsetzung ihrer Anforderungen.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Erwin.Sprenger@otto.de\">Erwin.Sprenger@otto.de</a> aus dem Entwickler-Team oder triff unsere OTTO-Kollegen hier! Du möchtest dein künftiges Team und deinen Arbeitsplatz live erleben? – Im Rahmen deines Bewerbungsprozesses hast du die Möglichkeit dazu!</p>\n<p><strong>Das bringt der Job</strong>:\n-Du entwickelst unsere Software mit Hilfe von Continuous Integration und Test Automation.\n-Du gestaltest und entwickelst Tools, die die Robustheit, die Automatisierung von Prozessen, Skalierbarkeit, Logging u.v.m. verbessern: You build it, you run it!\n-Du erfasst und überwachst Services mittels Leistungsindikatoren.\n-Du designst und implementierst unsere Cloud-Infrastrukturen kontinuierlich weiter und unterstützt die Fachbereiche bei der Umsetzung ihrer Anforderungen.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Erwin.Sprenger@otto.de\">Erwin.Sprenger@otto.de</a> aus dem Entwickler-Team oder triff unsere OTTO-Kollegen hier! Du möchtest dein künftiges Team und deinen Arbeitsplatz live erleben? – Im Rahmen deines Bewerbungsprozesses hast du die Möglichkeit dazu!</p>\n<p><strong>Das brauchen wir</strong>:\n<strong>Must-have</strong>: ob versierter Absolvent oder Experte: Erfahrung mit Java, Ruby, Python etc.; agiles Mindset; Erfahrung mit Design und Implementierung von Cloud-Infrastrukturen, Deutschniveau C1!\n<strong>Nice-to-have</strong>: Interesse an Open Source Technologien und Lust auf E-Commerce!</p>\n<p>Das bieten wir:\n-Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft – wir unterstützen dich dabei!\n-Komm mit uns auf (internationale) Fachkonferenzen wie Elastic{ON}, code.talks, DevOpsCon (Berlin) oder auf interne Fachevents (Innovation Days)\n-Innovative Arbeitswelten, flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice-Möglichkeiten</p>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXhjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92c575b82efba1b6017f725ead664b26a73e3a35/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "f1b4a76d-5e00-4ddd-8015-d435612256fa",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f1b4a76d-5e00-4ddd-8015-d435612256fa",
        "created_at": "Wed Jan 16 10:58:29 UTC 2019",
        "company": "OTTO (GmbH & Co KG) ",
        "company_url": null,
        "location": "Hamburg, Deutschland",
        "title": "Agile Android Developer (w/m/divers) Android & Kotlin | Team Apps",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p>Wir, das Apps-Team (ca. 10 Teammitglieder), sind verantwortlich für die iOS und Android Apps von OTTO. Mit über 2 Millionen aktiven Installationen und durchschnittlich 4,8 von 5 Sternen machen unsere Apps mittlerweile rund 20 % des Umsatzes von otto.de aus. Unsere hybride Android App (ab Android 5) wurde komplett in Java entwickelt, soll nach und nach in Kotlin übersetzt und durch dich noch nativer werden. Als internationales Team sprechen wir englisch, besuchen zusammen MeetUps und leben offenes Feedback. Wir treffen Technologie- und Architekturentscheidungen eigenverantwortlich und sind von der Konzeption bis zum Betrieb der Features überall dabei.</p>\n<p><strong>Und das ist unser Tech Stack</strong>: Kotlin, Android, AWS, MongoDB, Java, Dagger, REST, Retrofit, Reactive Extensions.</p>\n<p><strong>Das bringt der Job</strong>:</p>\n<ul>\n<li>Du entwickelst Features in der hybriden App, nativ sowie im WebView unter Anbindung diverser APIs.</li>\n<li>Als Developer unterstützt du den gesamten Software-Lifecycle: Du entwirfst, programmierst, sorgst für gute Software-Qualität und übernimmst eigenständig Verantwortung für den Betrieb der App.</li>\n<li>Du bringst eigene Ideen ein, nutzt den Freiraum in deren Umsetzung und lieferst täglich Mehrwert für unsere Kunden.</li>\n<li>In deinem crossfunktionalen Team arbeitest du mit den Methoden der agilen Softwareentwicklung und bringst dich ein, um dein Team kontinuierlich weiter zu entwickeln.</li>\n<li>Im Austausch mit den anderen Teams und den Stakeholdern erarbeitest du fachliche und technische Anforderungen und konzipierst Lösungen dafür.</li>\n</ul>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Lars.Lentfer@otto.de\">Lars.Lentfer@otto.de</a> aus dem Team oder triff unsere OTTO-Kollegen hier! Du möchtest dein künftiges Team und deinen Arbeitsplatz live erleben? – Im Rahmen deines Bewerbungsprozesses hast du die Möglichkeit dazu!</p>\n<p><strong>Das brauchen wir</strong>:</p>\n<ul>\n<li>\n<strong>Must-have</strong>: sehr gute Kenntnisse in der Entwicklung von Java, Kotlin, Hybrid Apps; agiles Mindset; Lust auf agile Methoden (zum Beispiel TDD, Collective Code Ownership); Interesse an Pair Programming.</li>\n<li>\n<strong>Nice-to-have</strong>: Kenntnisse und Erfahrungen mit Dependency Injection (idealerweise  Dagger), REST, Retrofit, Architekturmuster (MVVM, MVP, MVC), Reactive Extensions, CI / CD (Jenkins), E-Commerce, Cloud-Umgebungen (idealerweise AWS), NoSQL-Datenbanken (bspw. MongoDB), DevOps.</li>\n</ul>\n<p><strong>Das bieten wir</strong>:</p>\n<ul>\n<li>Freie Wahl des Betriebssystems (leistungsstarkes MacBook Pro aktueller Generation oder Lenovo ThinkPad) und der Entwicklungsumgebung</li>\n<li>Viel Freiraum, um neue, innovative Technologien auszuprobieren und einzuführen</li>\n<li>Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft – wird unterstützen dich dabei!</li>\n<li>\n<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a> und flexible Arbeitszeiten (Gleitzeit, 37,5-Stunden-Woche)</li>\n<li>Besuch (internationaler) Fachkonferenzen wie der WWDC</li>\n<li>Und wir bieten noch <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">mehr</a>!</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDViIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c1d97453d2f3f16a5c468ab9c5750b787f0c5733/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "eab55c8a-cc75-4a66-9153-eb6f5ed2c273",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/eab55c8a-cc75-4a66-9153-eb6f5ed2c273",
        "created_at": "Wed Dec 19 10:15:57 UTC 2018",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": null,
        "location": "Hamburg ",
        "title": "(Senior) Data Scientist (w/m/divers) Deep Learning Spezialist",
        "description": "<p>Im Headquarter der Otto Group in Hamburg die Zukunft des E-Commerce vorantreiben, und die Innovationskraft unseres Konzerns erleben. In den Teams der Otto Group Funktionsbereiche steuern wir erfolgreich 123 nationale und internationale Einzelgesellschaften und entwickeln die Strategie der Otto Group täglich weiter. Das klingt spannend? Dann starten wir gemeinsam durch.</p>\n<p>Der Bereich Group BI ist auf Holdingebene dafür verantwortlich, die Otto Group zu einem Vorreiter digitaler Kundeninspiration zu entwickeln. Der Bereich agiert als Innovationslabor und Inkubator für datengetriebene Anwendungen und Geschäftsmodelle für die Gruppe und ihre Gesellschaften. Das Team \"Retail Media\" der Otto Group BI nutzt einen der besten Retail User Datenpools im deutschsprachigen Raum zur personalisierten Ansprache von monatlich über 25 Millionen Kunden in den Online-Shops der Gruppe und im Cross Channel Marketing. Mit cutting edge Big Data-Technologien und Machine Learning-Methoden berechnet das Team Kundenprofile und arbeitet gemeinsam mit den Fachbereichen in den Einzelgesellschaften an datengetriebenen Lösungen zur Optimierung und Personalisierung der gesamten Customer Journey.</p>\n<p><strong>Das bringt der Job</strong>:</p>\n<ul>\n<li>Als Data Scientist im agil arbeitenden Team Retail Media übernimmst du die Verantwortung für die Entwicklung von Machine Learning Modellen für neue Kundenprofile und das Look-alike-Modeling</li>\n<li>Du entwickelst neue Ansätze zum Transfer Learning auf unterschiedlichen Feature Spaces</li>\n<li>Zusammen mit dem Team sorgst du dafür, dass die Machine Learning Modell production-ready sind und überwachst den Betrieb zusammen mit deinen Kollegen</li>\n<li>Durch explorative Datenanalysen unterstützt du die Bewertung neuer Ideen und sorgst für datengetriebene Entscheidungen</li>\n<li>Du arbeitest bei der Umsetzung der User Storys zusammen mit dem Team und unterstützt durch dein Fachwissen bei der Konkretisierung von User Stories</li>\n</ul>\n<p><strong>Das brauchen wir</strong>:</p>\n<ul>\n<li>Erfahrung im Bereich Deep Learning insbesondere Transfer Learning z.B. durch eine einschlägige Promotion oder mehrjährige Berufserfahrung</li>\n<li>Du besitzt hervorragende Kenntnisse im Python Stack (numpy, scipy, Pandas) und Software-Engineering</li>\n<li>Du beherrschst den Machine Learning Stack im Python-Universum: scikit-learn, Pytorch, theano, Tensorflow</li>\n</ul>\n<p>Wenn Erfolg für Dich bedeutet, die Zukunft der Otto Group aktiv mitzugestalten, sich ständig weiterzuentwickeln und in einem inspirierenden Umfeld zu arbeiten - dann suchen wir Dich!</p>\n<p><strong>Das bieten wir</strong>:</p>\n<ul>\n<li>Du triffst bei uns auf ein dynamisches und hoch motiviertes Team aus Strategen, Produktmanagern, Data Scientists, Data Architects und Softwareentwicklern</li>\n<li>Zusammen mit den anderen Data Scientist und Entwicklern im Bereich kannst du an spannenden Open Source Projekten wie z.B. unserer DS-Toolbox, Palladium oder Skorch mitarbeiten</li>\n<li>Du findest bei uns ein innovatives BI-Umfeld, die Anwendung führender Big Data und AI-Technologie, ein stimulierendes Umfeld mit starken Kolleginnen und Kollegen und hervorragende Möglichkeiten zur Weiterbildung - z.B. in Form von Konferenzbesuchen Tech-Talks, Coachings, Schulungen und Sessions mit bekannten Größen</li>\n<li>Du arbeitest mit uns gemeinsam an der Entwicklung neuer Geschäftsmodelle - ganz weit vorne am Pulsschlag der Innovation</li>\n<li>Du hast die Wahl zwischen einem MacBook Pro oder Lenovo P50 in Vollausstattung</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0phIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--27833080c66d54d62bf906077859aaba91035aec/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "20bbb9b0-62e4-4a27-958d-960d02d7eb89",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/20bbb9b0-62e4-4a27-958d-960d02d7eb89",
        "created_at": "Wed Dec 19 10:04:51 UTC 2018",
        "company": "OTTO (GmbH&Co KG)",
        "company_url": null,
        "location": "Hamburg",
        "title": "SAP Developer (w/m/divers) ABAP & UI5 | SAP-Team Otto Group IT",
        "description": "<p>Im Headquarter der Otto Group in Hamburg die Zukunft des E-Commerce vorantreiben, und die Innovationskraft unseres Konzerns erleben. In den Teams der Otto Group Funktionsbereiche steuern wir erfolgreich 123 nationale und internationale Einzelgesellschaften und entwickeln die Strategie der Otto Group täglich weiter. Das klingt spannend? Dann starten wir gemeinsam durch.</p>\n<p>Wir, das SAP-Team der Otto Group IT, sind die zentrale Entwicklungsabteilung für die SAP-Systeme der Otto Group IT: Wir betreuen standardnahe SAP-Systeme und selbstentwickelte Applikationen, die auf Servern und der Google Cloud Plattform laufen. Um unsere Kunden aus der gesamten Otto Group in ihrem Prozess zur Digitalisierung zu unterstützen, setzt unser siebenköpfiges Team ABAP und SAP UI5 sowie Java als Programmiersprachen ein. Was uns zu unserem Glück noch fehlt? – Du!</p>\n<p><strong>Das bringt der Job</strong>:</p>\n<ul>\n<li>Entwicklung ist genau dein Ding? Du baust zusammen mit uns  moderne Softwarelösungen für unsere Kunden</li>\n<li>Gemeinsam mit unseren Kunden entwickeln wir neue Lösungen und stellen den Betrieb sicher – wie wir die Aufgaben aufteilen, legen wir gemeinsam fest</li>\n<li>Dein Fokus liegt auf der Weiterentwicklung und Modernisierung unserer SAP-Module MM/SD, HCM und FI/CO</li>\n<li>Ein Spezialthema könnte die Weiterentwicklung und Betreuung des Produktes zur Bestellung von Print-Medien sein – du hast die Möglichkeit die Hauptverantwortung für diesen Entwicklungsprozess zu übernehmen</li>\n<li>Du arbeitest mit SAP HANA, ABAP, Fiori und dem Solution Manager</li>\n</ul>\n<p>Hast du weitere Fragen? – Dann wende dich an Sebastian aus dem Entwickler-Team (<a href=\"mailto:Sebastian.Koch@ottogroup.com\">Sebastian.Koch@ottogroup.com</a>) und komme z. B. zu einem unverbindlichen Mittagessen vorbei!</p>\n<p><strong>Das brauchen wir</strong>:</p>\n<ul>\n<li>\n<strong>Must-have</strong>: fundierte Kenntnisse in der Programmierung mit ABAP und ABAP Objects; Modul-Kenntnisse MM/SD; Erfahrung mit der Durchführung komplexer SAP Programmierungen in ABAP Objects</li>\n<li>\n<strong>Nice-to-have</strong>: Kenntnisse über SAP HCM oder SAP SuccessFactors; FI/CO-Kenntnisse</li>\n</ul>\n<p><strong>Das bieten wir</strong>:</p>\n<ul>\n<li>Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft – wir unterstützen dich dabei!</li>\n<li>Komm mit uns auf (internationale) Fachkonferenzen wie DSAG, Code Talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop\nState-of-the Art Technologie und Themen (HANA, Fiori, S4 HANA, ADS)</li>\n<li>\n<a href=\"https://www.ottogroup.com/de/karriere/Arbeitswelt.php\">Innovative Arbeitswelten</a> und Homeoffice-Möglichkeiten</li>\n<li>Und wir bieten <a href=\"https://www.ottogroup.com/de/karriere/Unternehmenskultur.php\">noch mehr</a>\n</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0JhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--776be47a2b60f57556d0c767d79e311fb284c3af/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "b127f06d-7c7b-4dba-bfbb-8689ace3de68",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b127f06d-7c7b-4dba-bfbb-8689ace3de68",
        "created_at": "Wed Dec 12 12:58:35 UTC 2018",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": null,
        "location": "Hamburg, Deutschland",
        "title": "Frontend-Entwickler (w/m/divers) Javascript | Lascana.de - Entwicklerteam",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p>Wir sind das Entwicklerteam hinter <a href=\"https://www.lascana.de/\">LASCANA.de</a>: Vier Kollegen auf der Suche nach einem neuen Teammitglied – nach dir! Unser Team steht für Einkaufserlebnis und die Frontend-Entwicklung unseres Shops: Dafür arbeiten wir eng mit den Kollegen aus dem Marketing, E-Commerce und dem Online Shop Management zusammen. Wir arbeiten agil, zum Teil mit Scrum und programmieren auch mal im Pair. Und steht das nächste Fachevent an, sind wir ziemlich sicher dabei!</p>\n<p><strong>DAS BRINGT DER JOB</strong>:</p>\n<ul>\n<li>Du entwickelst unseren OXID-Shop (<a href=\"https://www.lascana.de/\">LASCANA.de</a>) weiter</li>\n<li>Du bist für die Entwicklung von Konzepten zuständig und begleitest deren technische Umsetzung</li>\n<li>Du optimierst Patterns und entwickelst sie weiter</li>\n<li>Du bist verantwortlich für Refaktorierung von Legacy Code</li>\n</ul>\n<p><strong>DAS BRAUCHEN WIR</strong>:</p>\n<ul>\n<li>\n<strong>Must-have</strong>: erste fundierte Erfahrungen in CSS3, JavaScript, GIT und semantisch und valides HTML5; Erfahrung mit agilen Vorgehensweisen, MobileFirst, User Centered Design (UCD), Test Driven Development (TDD) sowie Responsive Webdesign; JavaScript ECMAScript 2015/2016</li>\n<li>\n<strong>Nice-to-have</strong>: Erfahrungen mit NPM, PHP und Vagrant[PU1], Gespür für Design; erste Erfahrungen im Umgang mit Template-Engines (Smarty, Twig, Handlebars), CSS-Präprozessoren – idealerweise LESS sowie HTML5-APIs\nHast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Stefan.Meiners@lascana.de\">Stefan.Meiners@lascana.de</a> aus dem Entwickler-Team oder triff unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</li>\n</ul>\n<p><strong>DAS BIETEN WIR</strong>:</p>\n<ul>\n<li>Unser Tech Stack: PHP, MySQL, noSQL, elasticSearch, CSS, HTML, JavaScript, LESS, Grunt, Webpack</li>\n<li>Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft – wir unterstützen dich dabei!</li>\n<li>Komm mit uns auf (internationale) Fachkonferenzen wie Code Talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups</li>\n<li>Innovative Arbeitswelten, flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit) und Homeoffice-Möglichkeiten</li>\n<li>Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>\n</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.phpe\">https://www.otto.de/unternehmen/de/datenschutz.phpe</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHhaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9090362fa88c21a1c53a51d9d12d4c087409eb2c/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "2c967b75-c9df-49fe-9221-3aa8288c6d8b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2c967b75-c9df-49fe-9221-3aa8288c6d8b",
        "created_at": "Wed Dec 12 10:57:48 UTC 2018",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": null,
        "location": "Hamburg, Deutschland",
        "title": "Agile iOS Developer Otto.de (w/m/divers) | Team Apps",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform <a href=\"https://www.otto.de/\">otto.de</a>. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!\nWir, das Apps-Team (ca. 8-10 Kollegen), sind verantwortlich für die iOS und Android Apps von OTTO. Mit über 2 Millionen aktiven Installationen und durchschnittlich 4,8 von 5 Sternen machen unsere Apps mittlerweile rund 20 % des Umsatzes von otto.de aus. Unsere hybride iOS App wurde komplett in Swift entwickelt (derzeit Swift 4.2) und soll durch dich noch nativer werden. Als Team treffen wir Technologie- und Architekturentscheidungen eigenverantwortlich und sind von der Konzeption bis zum Betrieb der Features überall dabei.</p>\n<p><strong>DAS BRINGT DER JOB</strong>:</p>\n<ul>\n<li>Du entwickelst Features in der hybriden App, nativ sowie im WebView unter Anbindung diverser APIs</li>\n<li>Als Developer unterstützt du den gesamten Software-Lifecycle: Du entwirfst, programmierst, sorgst für gute Software-Qualität und übernimmst eigenständig Verantwortung für den Betrieb der App</li>\n<li>Du bringst eigene Ideen ein, nutzt den Freiraum in deren Umsetzung und lieferst täglich Mehrwert für unsere Kunden</li>\n<li>In deinem crossfunktionalen Team arbeitest du mit den Methoden der agilen Softwareentwicklung und bringst dich ein, dein Team kontinuierlich weiter zu entwickeln</li>\n<li>Im Austausch mit den anderen Teams und den Stakeholdern erarbeitest du fachliche und technische Anforderungen und konzipierst Lösungen dafür</li>\n</ul>\n<p>Hast du weitere Fragen? – Wende dich an <a href=\"mailto:Lars.Lentfer@otto.de\">Lars.Lentfer@otto.de</a> oder triff uns auf einem der <a href=\"https://www.meetup.com/de-DE/CocoaHeads-Hamburg/\">CocoaHeads-Meetups</a>!</p>\n<p><strong>DAS BRAUCHEN WIR</strong>:</p>\n<ul>\n<li>\n<strong>Must-have</strong>: sehr gute Kenntnisse in der Entwicklung von Swift, Hybrid Apps; ein agiles Mindset; Lust auf agile Methoden (zum Beispiel TDD, Collective Code Ownership); Interesse an Pair Programming</li>\n<li>\n<strong>Nice-to-have</strong>: Kenntnisse und Erfahrungen mit Objective-C, REST, MVVM, Reactive(Swift|Cocoa), Testflight, Fastlane, eCommerce, Cloud-Umgebungen (idealerweise AWS), NoSQL-Datenbanken (bspw. MongoDB), Java, DevOps</li>\n</ul>\n<p><strong>DAS BIETEN WIR</strong>:</p>\n<ul>\n<li>Viel Freiraum, um neue, innovative Technologien auszuprobieren und einzuführen</li>\n<li>Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft</li>\n<li>Besuch (internationaler) Fachkonferenzen wie der WWDC</li>\n<li>Innovative Arbeitswelten und flexible Arbeitszeiten (Gleitzeit, 37,5-Stunden-Woche)</li>\n<li>Leistungsstarkes MacBook Pro aktueller Generation</li>\n<li>Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>\n</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHRaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--264383d8fc559da0154c3c019f9e3dda5509f32f/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "2ec9ba4e-5a11-4266-b761-7f6ddb4f28c1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2ec9ba4e-5a11-4266-b761-7f6ddb4f28c1",
        "created_at": "Wed Dec 05 08:31:33 UTC 2018",
        "company": "OTTO (GmbH & Co KG)",
        "company_url": null,
        "location": "Hamburg, Germany ",
        "title": "Lead Developer (w/m) Java | Team Retouren",
        "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p>Wir sind ein zehnköpfiges, crossfunktionales, agiles Team – auf der Suche nach dir, unserem Leading Developer. Dabei kannst du uns auch in Teilzeit (75-80 %) unterstützen! Was wir machen? –Wir entwickeln unsere Softwarelösungen zur Retouren-Abwicklung weiter, kümmern uns um Analyse, Entwicklung, Test, Produktion und Betrieb. Pair Programming kommt dabei nicht zu kurz. Wir setzten auf verhaltensorientierte Softwareentwicklung (BDD/TDD) und enge Zusammenarbeit mit unseren Kollegen von Hermes Fulfilment, der Bestandsführung und dem Crediting. Gehe zusammen mit uns Richtung hochskalierbarer Microservice-Architektur und AWS! Und, wenn du Lust hast: Gehe Freitagmittag zusammen mit uns Currywurst essen (beste Curry Wurst? – Unsere Kantine!)!</p>\n<p><strong>Das bringt der Job</strong>:</p>\n<ul>\n<li>Du übernimmst die fachliche Führung unseres motivierten Entwicklungsteams</li>\n<li>Du entwickelst Funktionalitäten für Retouren-Abwicklung für unsere Kunden</li>\n<li>Du hilfst uns beim Neubau unserer Services zur Bearbeitung und Steuerung von Retouren\n-Zudem gestaltest und entwickelst du verschiedene Module in einem modernen, agilen Umfeld –     und das in einem stetig wachsendem Themengebiet</li>\n</ul>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Hans-Werner.Witt@otto.de\">Hans-Werner.Witt@otto.de</a> aus unserem Team oder triff unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</p>\n<p><strong>Das brauchen wir</strong>:</p>\n<ul>\n<li>\n<p><strong>Must-have</strong>: fundierte Kenntnisse in Java oder einer vergleichbaren Programmiersprache; Erfahrungen mit mindestens einer der nachfolgenden Technologiekomponenten: Docker, Spring Boot, Apache Mesos, Mesosphere oder Marathon mit DC/OS; Kenntnisse in Datenbanken, speziell Mongo DB, Apache Cassandra oder Oracle</p>\n</li>\n<li>\n<p><strong>Nice-to-have</strong>: Integrations-Technologien wie Messaging oder ein Event-Bus, Continuous Integration und Continuous Delivery; Erfahrung mit agilen Vorgehensmodellen</p>\n</li>\n</ul>\n<p><strong>Das bieten wir</strong>:</p>\n<ul>\n<li>Unser Tech Stack:  Java, Microservices, Spring Boot, Mongo DB, Docker, Jenkins, Git, AWS, Cucumber, Linux</li>\n<li>Komm mit uns auf (internationale) Fachkonferenzen wie Code Talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop</li>\n<li>\n<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a>, flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice- und Sabbatical-Möglichkeiten</li>\n<li>Werde Teil eines Teams, das ein hohes Maß an Gestaltungsspielraum und Eigenverantwortung genießt. Hier lernt jeder von jedem und Teamwork wird groß geschrieben.\n-Und wir bieten noch <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">mehr</a>\n</li>\n</ul>\n",
        "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE5aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--38ed4f2e9057a6fabf57d60fe54a3867da988f2e/Otto_Logo_300dpi_jpg.jpg"
    },
    {
        "id": "bbcc9527-8603-4f2c-88da-8cd6a822d5db",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/bbcc9527-8603-4f2c-88da-8cd6a822d5db",
        "created_at": "Fri Sep 06 18:38:25 UTC 2019",
        "company": "Favor Delivery",
        "company_url": "http://www.favordelivery.com",
        "location": "Austin",
        "title": "Android Engineer",
        "description": "<p>Favor’s mission is ‘Anything Delivered’. Our engineers make high-touch logistics happen. The Favor technology platform is the engine behind the business enabling millions of Favors. Our technology efficiently manages the real-time assignment of Runners to Favors, facilitates communication between customers, Runners, and support, keeps thousands of customer and Runner mobile applications in sync, and more.</p>\n<p>Do you get a thrill when you make an impact on hundreds of thousands of users? Do you want to work for a purpose and value driven company in a high growth environment? Our engineers create the tools and applications necessary to connect our customers, Runners, merchants, and support teams. We are a mobile-first on demand delivery marketplace that prioritizes making our customers happy. As an Android Engineer you will be responsible for all phases of development, testing, and release of our Android Consumer and Runner apps. You will work closely with our product and operations teams to understand customer needs, build simple solutions to complex problems, and deliver delightful experiences to all our users.</p>\n<p>At Favor, we are committed to building a world class team that shares a passion for modern, clean code and products that make a difference. We need engineers like you to help us achieve our mission of ‘Anything Delivered’.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Write clean, performant, and tested application code</li>\n<li>Design, implement, test, and maintain new and existing features</li>\n<li>Explore new technologies and contribute to the refinement of engineering related tools, standards and training</li>\n<li>Participate in design and code reviews</li>\n<li>Mentor less experienced engineers</li>\n<li>Engage and collaborate with other teams to ensure timely solution delivery with high quality while balancing new feature work and tech debt management</li>\n<li>Partner with cross-functional technology teams to integrate solutions</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Degree in Computer Science or 2-4 years of similar experience with a strong understanding of software development concepts such as OO design, SOLID principles, refactoring, automated testing, and continuous delivery</li>\n<li>Self starter who can design and build technical solutions without direct oversight</li>\n<li>Strong understanding of Java/Kotlin and the Android SDK</li>\n<li>Released and supported at least one app in the Google Play Store</li>\n<li>Knowledge of coding patterns, best practices, and tools to write performant, maintainable, and testable code</li>\n<li>Understanding of debugging tools to trace and diagnose performance and functional issues</li>\n</ul>\n<p>Ideal Candidates Will:</p>\n<ul>\n<li>Appreciate simple design</li>\n<li>Love to write clean, well tested code - test first or TDD approaches a plus</li>\n<li>Like working with other engineers in a collaborative and iterative environment</li>\n<li>Have experience in a high-growth startup</li>\n<li>Love to learn and teach equally while and possessing a growth mindset</li>\n<li>Communicate well with technical and non-technical stakeholders</li>\n<li>Participate actively in the local development and/or open source communities</li>\n<li>Have worked with public cloud providers and cloud native application development</li>\n<li>Have experience or familiarity with one or more of the following technologies: PHP, Scala, Python, Java, Node.js, React, MySQL, Kafka, Docker, Kubernetes, Terraform, AWS, Elasticsearch, XCUITest, Selenium, JUnit, NUnit, Espresso</li>\n</ul>\n",
        "how_to_apply": "<p>Apply directly though our careers page at <a href=\"https://favordelivery.com/job/android-engineer\">https://favordelivery.com/job/android-engineer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUJ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--308656c2208254c8bed944c701ea57fc293a8883/Favor_Logo_Tagline_Blue.png"
    },
    {
        "id": "8165fb13-ed76-4ffc-a24f-77ff520154a6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8165fb13-ed76-4ffc-a24f-77ff520154a6",
        "created_at": "Fri Sep 06 18:35:15 UTC 2019",
        "company": "Rebilly",
        "company_url": "https://www.rebilly.com/careers/",
        "location": "Remote",
        "title": "Senior Front-End Developer",
        "description": "<p>You’re the kind of person for whom architecture and design makes you tick. It’s in your blood; you love great design, and you strive to architect it every single day. You know what makes functional design great, and also know when pragmatism is called for. You know all the rules, and yet you’re willing to break them from time to time.</p>\n<p>As a Senior Front-End Developer with Rebilly, you’ll be responsible for guiding the architecture and design of our front-end applications. You’ll lead a team of developers to produce the highest quality software possible, and you’ll be responsible for mentoring them along the way.</p>\n<p>Our problems are hard, requiring dedication, expertise and the ability to look at solutions from many different angles. It will be your job to make the hard choices and deliver on time, bug-free code that delights our clients and maximizes their value.</p>\n<p>You’ll need to have passion, vision, and courage in order to take Rebilly to the next level and to make us the leading subscription billing service by 2025.</p>\n<p>Here’s what a typical day will look like at Rebilly:</p>\n<ul>\n<li>Split your time between coding and leading, including weekly 1-on-1 meetings with other team members</li>\n<li>Review developer code, providing suggestions on how, where and when to make improvements.</li>\n<li>Ensure adherence to programming and documentation policies, code standards, testing, and release.</li>\n<li>Mentor others with an emphasis on our core values, and above all maximizing customer success.</li>\n<li>Help identify new initiatives, design new products and services, and improving our processes.</li>\n<li>Work closely with developers on your team, and with the leads of other teams.</li>\n<li>Assist with the mentorship and leadership of developers.</li>\n</ul>\n<p><strong>A Picture of Success</strong>\n<strong>OBJECTIVE #1 Customer billing portal</strong></p>\n<ul>\n<li>Potential Obstacles: Creating a customer billing portal that is secure, customizable and performant is not an easy task.</li>\n<li>Actions:  Determine the requirements of the billing portal and breakdown the task for you and other team members to implement. Research best practices in portals security and apply them to the project.</li>\n<li>Results:  # of active customer billing portals.</li>\n</ul>\n<p><strong>OBJECTIVE #2 Third-party integrations</strong></p>\n<ul>\n<li>Potential Obstacles: Translating an API into a third-party integration.</li>\n<li>Actions: Using our existing integrations as a reference implement new connections to third-party applications in the UI.</li>\n<li>Results:  # merchants using integrations or similar.</li>\n</ul>\n<p><strong>OBJECTIVE #3 Improving App UX</strong></p>\n<ul>\n<li>Potential Obstacles: Managing high levels of complexity in proposed interfaces while taking user experience into account.</li>\n<li>Actions: Use your critical mind to interpret mockups and architect interfaces with existing features and reusable components.</li>\n<li>Results: % Users who activate their trial account.</li>\n</ul>\n<p><strong>Apply!</strong>\nPlease send your resume through Apply By API: <a href=\"https://app.applybyapi.com/posting/9/\">https://app.applybyapi.com/posting/9/</a></p>\n<p><strong>HIRING PROCESS</strong></p>\n<ul>\n<li>Apply By API* - <a href=\"https://app.applybyapi.com/posting/9/\">https://app.applybyapi.com/posting/9/</a>\n</li>\n<li>Small code challenge (unless you have extensive open source contributions)</li>\n<li>Interview with the Product Team</li>\n<li>Interview with the Product Team Lead</li>\n<li>Offer and Hiring\nThe total process should take less than 2 weeks.\n*We are only accepting applications through ApplyByAPI at this time.</li>\n</ul>\n<p><strong>WORKING AT REBILLY</strong></p>\n<p>Check us out at <a href=\"https://www.rebilly.com/careers/\">https://www.rebilly.com/careers/</a></p>\n<p>Rebilly offers a competitive salary, training and development, birthday lunches, and provides the computer of your choosing. You are welcome to work out of our Montreal office, remotely out of Austin (occasionally meeting with our team here for lunch or happy hour, otherwise set up as a 100% remote/work from home environment), or anywhere on the globe that you choose as a fully remote employee. Further perks and benefits are dependent on your work location of choice.</p>\n<p>Rebilly is a Teal Organization, meaning our organizational structure may differ than what you’re used to, but we think you’ll be pleasantly surprised. In a very tiny nutshell, this means that as an organization we value self-management, self-organization, as well as the wholeness of the individuals that make up our team (meaning you should be yourself at work, and do the work that inspires you.)</p>\n<p><strong>ABOUT REBILLY</strong></p>\n<p>Rebilly is subscription billing software that helps businesses who need to handle recurring invoices and payments. Rebilly’s comprehensive feature set is built to help our merchants get more of their customers from the order form to the thank you page, and more renewals paid. We took lessons learned from years of experience in the subscription business and millions of subscribers and applied them to make our payment system clever, flexible, and easy to use for our clients.</p>\n",
        "how_to_apply": "<p>Please send your resume through Apply By API: <a href=\"https://app.applybyapi.com/posting/9/\">https://app.applybyapi.com/posting/9/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDV4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ff5b6d65894f308296672f5473f4b3af8482c254/rb_LogoColor_Small.jpg"
    },
    {
        "id": "a3d1e5f9-23e0-4833-9e9b-0c485d3f2672",
        "type": "Part Time",
        "url": "https://jobs.github.com/positions/a3d1e5f9-23e0-4833-9e9b-0c485d3f2672",
        "created_at": "Fri Sep 06 16:24:10 UTC 2019",
        "company": "Caxis",
        "company_url": "http://Caxis.com",
        "location": "Remote",
        "title": "Talented Scala Developer",
        "description": "<p>Thank you for checking our post!</p>\n<p><a href=\"Caxis.com\">Caxis</a> is an online company secretarial tool. We help entrepreneurs set up their businesses and make sure their company records are up to date.</p>\n<p>Our MVP was developed by an agency based in Europe. It is ready and we are revenue positive. As the MVP is currently stable, we are looking for a talented Scala developer to help us with the following objectives on a Part-Time basis:</p>\n<ul>\n<li>Ongoing bug fixing</li>\n<li>New feature development mostly focused on the process automation and back-end updates for UX improvements</li>\n<li>Server management (AWS)</li>\n</ul>\n<p>It will be a remote position but we have preference for developers based in London, Tokyo, Singapore, or Hong Kong for timezone reasons.</p>\n<p>I'm so excited to discuss this opportunity with you!</p>\n",
        "how_to_apply": "<p>Email <a href=\"mailto:info@caxis.com\">info@caxis.com</a> to begin the conversation.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ac2e393097ec766acc543476293353ad72dc2a0/Caxis_square.png"
    },
    {
        "id": "5c1e7811-25c1-4674-a7fb-ec277fcad643",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5c1e7811-25c1-4674-a7fb-ec277fcad643",
        "created_at": "Wed Mar 06 15:56:53 UTC 2019",
        "company": "Bene Studio Ltd.",
        "company_url": "http://www.benestudio.co",
        "location": "Budapest",
        "title": "Senior Full-stack React and Node Engineer - Full Relocation to Budapest",
        "description": "<p>Join bene : studio</p>\n<p>TO BUILD PRODUCTS</p>\n<ul>\n<li>which are diverse, from healthcare to real estate</li>\n<li>making better the lives of the people globally</li>\n<li>with the latest JavaScript technologies</li>\n<li>using your creativity, empowerment and team player attitude</li>\n</ul>\n<p>TO GAIN EXPERIENCE</p>\n<ul>\n<li>from the varied, 1-6 months long projects</li>\n<li>within the English-speaking, international, growing team of highly skilled engineers,</li>\n<li>who passed the famously challenging bene : studio assessment</li>\n<li>during the journey of your Professional Development Plan</li>\n<li>with the help of your dedicated Mentor</li>\n</ul>\n<p>TO REFRESH YOURSELF</p>\n<ul>\n<li>by enjoying the flexible schedule</li>\n<li>relying on the stable, calculable job and salary</li>\n<li>in the team which won the Loveable Workplace Prize</li>\n<li>at the bike, dog and family friendly Office of the Year 2016, where you can have a massage, play ping- pong or drink a coffee/fröccs at the in-house café</li>\n</ul>\n<p>TO SHARE YOUR KNOWLEDGE</p>\n<ul>\n<li>at our blog or one of the leading meetups, conferences</li>\n<li>at bene : studio Workshops!, the most popular cutting-edge tech workshops in Hungary</li>\n</ul>\n<p>TO RELOCATE</p>\n<ul>\n<li>into the heart of Europe, to the beautiful, safe and cheap Budapest</li>\n<li>with the adaptation guidance, flight ticket, temporary housing and visa services provided by us</li>\n</ul>\n<p>TO RECEIVE FROM US</p>\n<ul>\n<li>a MacBook Pro</li>\n<li>competitive salary</li>\n<li>with paid leaves and sick-leaves</li>\n<li>promotion reflecting the improvement of your skills, experiences and your contribution to the company</li>\n</ul>\n<p>IF YOU MET THE REQUIREMENTS OF</p>\n<ul>\n<li>2.5+ years experience in software engineering</li>\n<li>JavaScript ES6</li>\n<li>HTML5, CSS3</li>\n<li>React.js</li>\n<li>Redux</li>\n<li>Node.js</li>\n<li>SQL &amp; noSQL</li>\n<li>Algorithms, data structures</li>\n<li>AWS &amp;/or Azure</li>\n<li>Systems design skills</li>\n</ul>\n<p>OR EVEN GET ADVANTAGES HAVING</p>\n<ul>\n<li>Mobile development experience</li>\n<li>Knowledge of infrastructure as code software tools</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://benestudio.co/joinus/#fullstackengineer\">https://benestudio.co/joinus/#fullstackengineer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkZ0IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cd53f169455894631c06e5a849b58b76ae79559/uxuibrand_creative.jpg"
    },
    {
        "id": "2e0f668d-b2be-406a-b517-66249478f397",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2e0f668d-b2be-406a-b517-66249478f397",
        "created_at": "Fri Sep 06 08:45:35 UTC 2019",
        "company": "Onedot",
        "company_url": "https://www.onedot.com/",
        "location": "Schlieren, Switzerland",
        "title": "Senior Front-End Web Developer",
        "description": "<p><strong>Most wanted: Fast-learning Web developers with a flair for beautiful visuals and great user experiences.</strong></p>\n<p>Onedot was founded in 2014 to make unstructured and messy product data easy consumable by applying self-developed artificial intelligence.</p>\n<p>We are a rapidly growing Swiss SaaS startup offering commerce and industry the first intelligent platform to source, onboard and distribute product data. Public companies with global presence and rich history as well as some of the fastest growing e-commerce startups are part of our expanding international customer base.</p>\n<p>At Onedot, you will embed yourself into a demanding but exceptionally inspiring environment with lots of room for personal growth. We are looking for colleagues who want to have a meaningful impact and shape our trendsetting product and company. High-quality work is rewarded with a steep learning curve, lots of autonomy, responsibility and swift decision-making. Become part of a multi-cultural and multi-faceted team led by the founders. Talented, curious and committed human beings from all over the globe are looking forward to your ideas and taking you on board.</p>\n<p>You will take ownership and drive the development of the Onedot platform, in particular the Web application. Working on beautiful and intuitive user interfaces is your thing. You have a flair for excellent user experience and are able to capture complex use-cases and translate them into features which are built to last. Good attention to detail and constantly improving your knowledge about industry trends, new technologies, and best practices in front-end development is your strength. You have the necessary experience to build novel products and love to share your technology knowhow with your team. A modern technology stack and a lean development process that does not get in your way helps you to focus on what your are good at: building great Web applications with the potential to transform entire industries.</p>\n<p>Onedot designs and engineers proprietary machine learning algorithms, probabilistic/statistical methods and advanced text undertanding because existing approaches do not go far enough. Our technology achieves human-like performance and has already been trained with over 100 million different products.</p>\n<p>Onedot is a startup backed by well-known international venture capital firms and world class entrepreneurs.</p>\n<p><strong>Your responsibilities:</strong></p>\n<ul>\n<li>Design, implement and test new user-facing functionality for our SPA</li>\n<li>Connect to backend services interfacing with the core engine</li>\n<li>Build reusable code and open-source libraries for future use</li>\n<li>Optimize components for maximum performance across browsers and devices</li>\n<li>Draft, test and implement intuitive interaction patterns for sophisticated data transformations</li>\n<li>Work with product management and core engine team</li>\n</ul>\n<p><strong>Your qualifications:</strong></p>\n<ul>\n<li>Minimum of 4 years of relevant project and product expertise</li>\n<li>Strong proficiency in JavaScript/ES6 or Typescript, including DOM manipulation and the Javascript object model</li>\n<li>Practical expertise with popular React workflows such as Flux or Redux</li>\n<li>Experience with data structure libraries such as Immutable.js</li>\n<li>Familiarity with RESTful APIs and modern authorisation mechanisms such as JSON Web Token</li>\n<li>Know-how of modern front-end build pipelines and tools such as Webpack</li>\n<li>Motivation and passion for intuitive and beautiful user interfaces</li>\n<li>Ability to write expressive, high-quality, reusable code</li>\n<li>Experience and flair for visual design, UX and interface design for complex interaction patterns</li>\n<li>Full-stack engineering experience of reactive software architectures</li>\n<li>Knowledge of Scala and functional programming paradigms</li>\n</ul>\n<p><strong>Our benefits:</strong></p>\n<ul>\n<li>Performance-oriented compensation with the option to become shareholder, because we reward high-impact work</li>\n<li>Generous education &amp; training budget to continuously broaden your skills</li>\n<li>Flexible work hours, because impact, not face-time counts</li>\n<li>Occasional work from home, so that you can focus and get things done</li>\n<li>Strong culture promoting open feedback and personal development, to learn from each other and push forward as one team</li>\n<li>Cool office space close to the city center, because we like it cosy and comfortable</li>\n<li>Free snacks, drinks, coffee and other perks to keep you going</li>\n<li>Regular team events to foster new ideas and better get to know each other</li>\n</ul>\n<p>As part of our dedication to the diversity of our teams, Onedot is committed to equal employment opportunity without regard for race, colour, national origin, ethnicity, gender, disability, sexual orientation, gender identity, or religion.</p>\n<p>This is a permanent full-time position based in our office in Zurich/Schlieren, Switzerland.</p>\n<p>Sounds interesting? Apply today and we will get in touch with you shortly!</p>\n",
        "how_to_apply": "<p>Apply here:</p>\n<p><a href=\"https://onedot.join.com/jobs/350792-senior-front-end-web-developer?pid=c45bd41b196694a294e4&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfront-end%2Bweb%2Bdeveloper\">https://onedot.join.com/jobs/350792-senior-front-end-web-developer?pid=c45bd41b196694a294e4&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfront-end%2Bweb%2Bdeveloper</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGR4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--85f4543d39d980dffc62c0e1d73ade0e61b0e6f8/partner1763_5afac53f0d098_Onedot_Logo%20240x175.png"
    },
    {
        "id": "5cbcc007-fdcc-45ee-83b6-ddd4d4d6b3fd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5cbcc007-fdcc-45ee-83b6-ddd4d4d6b3fd",
        "created_at": "Fri Sep 06 08:04:29 UTC 2019",
        "company": "Channable ",
        "company_url": "http://www.channable.com/jobs",
        "location": "Netherlands, Utrecht",
        "title": "Python Software Engineer",
        "description": "<p><strong>Who are we?</strong>\nWe are a young and fast-growing start-up from Utrecht focusing on the e-commerce and online marketing sectors. Channable was founded 5 years ago and developed into a company with an international team of over 80 young professionals. While you can still benefit from the start-up vibe, working at Channable also means being part of a professional company with a highly skilled Development team.</p>\n<p><strong>What will your role be?</strong>\nIn this position you will be part of the product team, that works on our main web application. You will mainly be working on our Python3 backend, which powers our API and serves as the main entry point for our services. You will also be working on our API integrations, ads services, our export channels, new user-facing features, and our background jobs through which we process hundreds of millions of products per day. You will also be closely working together with our Infrastructure and DevOps teams, which are working on many other services that power Channable under the hood.</p>\n<p><strong>Your tasks will include the following:</strong></p>\n<ul>\n<li>Contributing to our Python components and support new API’s</li>\n<li>Design, development and testing of new product features</li>\n<li>Collaborate with and review PRs of other team members</li>\n<li>Improve the reliability and robustness of our application</li>\n<li>Work on scalability and performance improvements</li>\n<li>Work together with the sales and support teams on requirements and issues</li>\n</ul>\n<p><strong>We are using the following technologies and tools:</strong></p>\n<ul>\n<li>Languages: Python, SQL</li>\n<li>Libraries: Flask, SQLAlchemy, Click, requests, async, logging</li>\n<li>Tools: Postgres, Redis, GCS, Alembic, mypy, pip, Sentry, Icepeak</li>\n</ul>\n<p>If you want to read more about our development adventures, check out our tech blog: <a href=\"https://tech.channable.com/\">https://tech.channable.com/</a></p>\n<p>You can also take a look at some of our open-source work at <a href=\"https://github.com/channable\">https://github.com/channable</a> to get a feeling of how we work together and what our code looks like.</p>\n<p><strong>Who are we looking for?</strong></p>\n<ul>\n<li>At least 1 year experience in developing web applications in Python</li>\n<li>Experience with web development, web technologies and APIs</li>\n<li>Good understanding of HTTP, TLS/SSL and TCP/IP</li>\n<li>Familiarity with SQL and relational databases, preferably Postgres</li>\n<li>Good working knowledge of Linux, git and the command-line</li>\n<li>Committed to high engineering standards</li>\n</ul>\n<p><strong>And then there are some things that are ‘nice to have’:</strong></p>\n<ul>\n<li>Experience in tuning and scaling a big application</li>\n<li>Familiar with functional programming and its concepts</li>\n<li>Having worked with distributed systems before</li>\n<li>DevOps mentality</li>\n</ul>\n<p><strong>Practical requirements</strong></p>\n<ul>\n<li>EU citizenship or a work permit, preferably already living in The Netherlands</li>\n<li>Available for at least 4 days a week, preferably full-time</li>\n</ul>\n<p><strong>What do we offer?</strong></p>\n<ul>\n<li>Challenging full-time function with space for personal initiative</li>\n<li>An interesting job within a talented development team, with different levels of experience</li>\n<li>Competitive salary</li>\n<li>Career opportunities within Channable</li>\n<li>Working for a fast growing company with a young and ambitious team</li>\n<li>Awesome office in the city center of Utrecht and activities like hackatons and sports groups</li>\n</ul>\n",
        "how_to_apply": "<p>Please fill in our application form: <a href=\"https://jobs.channable.com/o/python-software-engineer-utrecht/c/new\">https://jobs.channable.com/o/python-software-engineer-utrecht/c/new</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFJ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5e9544d03862a246cd06362c8f754fd5931329c7/Channable%20logo.png"
    },
    {
        "id": "34f1b9fa-29bf-4ad2-bde7-351c8286610b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/34f1b9fa-29bf-4ad2-bde7-351c8286610b",
        "created_at": "Fri Sep 06 07:46:38 UTC 2019",
        "company": "Samskip",
        "company_url": "https://tinyurl.com/y5prrb42",
        "location": "Rotterdam",
        "title": "Developer robotic process automation",
        "description": "<p><strong>Developer robotic process automation</strong></p>\n<h2><strong>Functieomschrijving</strong></h2>\n<p><strong>Binnen Samskip ga jij op zoek naar automatiseringsoplossingen. Zo zorg jij ervoor dat we handmatig werk besparen en onze processen geoptimaliseerd worden. Met jouw ondernemerschap en expertise op het gebied van RPA, ben jij de fulltime developer robotic process automation die ons hierin verder helpt.</strong></p>\n<h2><strong>Een standaardbaan? Daar doen we niet aan bij Samskip.</strong></h2>\n<p>Jij evalueert onze processen en bekijkt of deze door middel van procesautomatisering uitgevoerd kunnen worden. In overeenstemming ontwerp en ontwikkel je end-to-end RPA-oplossingen die aan de business-eisen voldoen. Zo bied je slimme oplossingen voor onze gestructureerde, repetitieve taken, zodat we enerzijds besparen op handmatig werk en anderzijds de kwaliteit, snelheid en continuïteit verbeteren. Dat is onze uitdaging op dit moment. Als developer robotic process automation:</p>\n<ul>\n<li>overtuig je stakeholders op alle business-lagen van de voordelen van RPA.</li>\n<li>maximaliseer je de bedrijfswaarde door Agile-werkwijzen en -principes toe te passen.</li>\n<li>stuur je aan op RPA-oplossingen door test- en verandermanagement en production readiness cycles.</li>\n<li>biedt je verandermanagement- en operationele ondersteuning voor alle RPA-ontwikkelingen.</li>\n<li>manage je het digitale personeelsbestand, wijs je softwarerobots toe en onderhoud je geïmplementeerde RPA-oplossingen.</li>\n<li>behandel je uitzonderingen. Je biedt een strategische benadering voor de analyse van de hoofdoorzaak.</li>\n</ul>\n<h2><strong>Een internationale functie vanuit de haven in Rotterdam.</strong></h2>\n<p>Vanuit het hoofdkantoor van Samskip heb je een internationale impact op onze bedrijfsvoering en vaar je mee op de koers van een van de grootste transportbedrijven van Europa. Over land, zee en via het spoor. Jouw expertise heeft een internationale impact binnen Samskip.</p>\n<p>Internationaal? Jazeker. Wij sturen goederen de hele wereld over en om dat te realiseren, zijn er veel mensen nodig. Jouw werk reikt dus veel verder dan alleen onze havenstad en je ziet je werk letterlijk voorbijkomen en ‑gaan vanuit onze kantoorramen. Zoals we zelf graag zeggen: ‘We hebben het mooiste uitzicht van de stad.’ Als bedrijf hebben we duurzaam en milieuvriendelijk vervoer hoog in het vaandel staan en daar pluk jij regelmatig de vruchten van. Wij brengen namelijk veel van die producten naar jouw supermarkt met zo min mogelijk klimaatimpact.</p>\n<h2><strong>Jouw team in Rotterdam.</strong></h2>\n<p>Work hard, play hard. Die Rotterdamse mentaliteit is zeker op ons van toepassing. En dat we doen wat we zeggen en we zeggen wat we doen. Jij versterkt als developer robotic process automation het team Digital. Het team ontwerpt oplossingen die de business verder digitaliseert of verbetert hetgeen wat al gedigitaliseerd is. Daarbij zorgen jullie ervoor dat bestaande winstgevende activiteiten en assets intact blijven. Naast business intelligence (BI) focust jouw team zich momenteel op machine learning-projecten en robotica-automatisering.</p>\n<h2><strong>Op ons kan je rekenen.</strong></h2>\n<p>Buiten een niet-standaardbaan, het allermooiste uitzicht van Rotterdam en een internationale werkomgeving bieden we op basis van 38.75 uur per week:</p>\n<ul>\n<li>een salaris dat past bij jouw ervaring en achtergrond.</li>\n<li>28 vrije dagen op jaarbasis.</li>\n<li>reiskostenvergoeding.</li>\n<li>pensioenregeling</li>\n<li>een dertiende maand.</li>\n<li>eindeloze mogelijkheden om jezelf te ontwikkelen.</li>\n<li>bedrijfsfitness.</li>\n</ul>\n<h2><strong>Geen woorden maar daden.</strong></h2>\n<p>Jij hebt de drive om actief met de business samen te werken in het robotiseren van taken. We doen daarvoor een beroep op jouw analytische skills. Met jouw kritisch denkvermogen en oplossingsgerichtheid ben je ijzersterk in het interpreteren van data. Je bent een ondernemende expert, gefocust op resultaat, die daarvoor graag een stap extra zet. Ook lukt het jou met werkdruk en strakke deadlines om te gaan. Je kunt goed samenwerken en hebt uitstekende communicatieve vaardigheden. Door te beïnvloeden, onderhandelen en informatie te presenteren, motiveer je anderen om de klus te klaren. So far so good? Als je ook het eind van deze checklist haalt, komen we graag met je in contact:</p>\n<ul>\n<li>een bachelor-diploma. Je beschikt over algemene basisvaardigheden op het gebied van programmeren en softwareapplicaties, al ligt de focus op RPA en GUI.</li>\n<li>vaardigheden op het gebied van geavanceerde statistische methoden.</li>\n<li>beheersing van het Nederlands en het Engels.</li>\n<li>het liefst ervaring met een RPA-tool, in het bijzonder Kryon Systems.</li>\n</ul>\n<h2><strong>We hebben je nodig.</strong></h2>\n<p>We kunnen niet wachten tot je begint en warmen je bureaustoel vast voor je op. Wat jij moet doen? Zorgen dat je voor het eind van de maand reageert op deze fulltime baan via deze <a href=\"https://tinyurl.com/y5prrb42\">link</a></p>\n<p>Heb je nog vragen over de vacature? Je kunt ons bellen via 088 – 400 13 93 of stuur een e-mail naar: <a href=\"mailto:career.management@samskip.com\">career.management@samskip.com</a>.</p>\n",
        "how_to_apply": "<p>Reageer via via deze <a href=\"https://tinyurl.com/y5prrb42\">link</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEp4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d6abb0a493e0a20fb33621a8525b615ecec09b24/Samskip.jpg"
    },
    {
        "id": "73ea837a-fafe-4cd3-b8bb-a5612f59afce",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/73ea837a-fafe-4cd3-b8bb-a5612f59afce",
        "created_at": "Fri Sep 06 07:44:55 UTC 2019",
        "company": "BWI GmbH",
        "company_url": "http://www.bwi-it.de",
        "location": "Bonn",
        "title": "Interner (Senior) Entwickler (m/w/d) SAP HCM",
        "description": "<p>Gestalten Sie mit uns eine der größten und komplexesten IT-Landschaften Deutschlands und unterstützen Sie unser Team als</p>\n<h2><strong>Interner (Senior) Entwickler (m/w/d) SAP HCM</strong></h2>\n<p><strong>ab sofort und in Vollzeit in Bonn.</strong></p>\n<p>Als IT-Partner der Bundeswehr und IT-Dienstleistungszentrum des Bundes bieten wir umfassende IT-Services aus einer Hand. Mit über 4.000 Mitarbeiterinnen und Mitarbeitern zählen wir zu den zehn größten IT-Service-Providern Deutschlands. Wir suchen authentische IT-Liebhaberinnen und IT-Liebhaber, die ihre Leidenschaft mit uns teilen wollen, auf der Suche nach anspruchsvollen IT-Herausforderungen sind und Deutschlands IT gestalten möchten.</p>\n<p>Der Bereich SAP Application Management leistet u.a. den 2nd-Level-Support in allen Belangen der SAP HCM-Anwendungslösung, mit der Zielsetzung den laufenden Betrieb sicherzustellen. Dazu gehören auch die Planung, Organisation und Umsetzung von Kundenprojekten im Lösungsumfeld.</p>\n<p>Erfahren Sie mehr in unserem Portfolio.</p>\n<h2><strong>Ihre Aufgaben:</strong></h2>\n<ul>\n<li>Entwicklung, Integration und Test von kundenspezifischen SAP Anwendungen im HCM-Umfeld</li>\n<li>Analyse von Prozessanforderungen in Zusammenarbeit mit dem Modulbetreuer sowie der Fachabteilung und Erarbeitung von Umsetzungskonzepten</li>\n<li>Technische Neu-Entwicklung von Systemen, Werkzeugen, Programmen, Programmbausteinen, Reports, Klassen und Formularen</li>\n<li>Integration und Entwicklertest der IT-Applikation sowie Erstellen von Testdokumenten (Testfälle,Testpläne, Testergebnisdokumentation)</li>\n<li>Wartung, Pflege, Optimierung und Weiterentwicklung vorhandener Programme und Systeme im Rahmen von Incident-, Problem- und Change-Bearbeitung</li>\n<li>Erstellung der Entwicklerdokumentation sowie Zuarbeit zur Fach- und Betriebsdokumentation</li>\n</ul>\n<h2><strong>Ihr Profil:</strong></h2>\n<ul>\n<li>Erfolgreich abgeschlossenes IT-bezogenes Studium oder eine vergleichbare Qualifikation</li>\n<li>Mehrjährige Berufserfahrung in der Softwareentwicklung mit ABAP-OO, idealerweise in SAP HCM</li>\n<li>Erfahrungen im Bereich WebDynpro und / oder der Implementierung im SAP Formularwesen (SAPscript / Smartforms / SAPInteractive Forms)</li>\n<li>Gute Kenntnisse in Schnittstellentechniken</li>\n<li>Zuverlässigkeit und Teamfähigkeit sowie Kommunikationsfähigkeit und eigenverantwortliches Handeln</li>\n<li>Ausgeprägte analytische und konzeptionelle Fähigkeiten</li>\n</ul>\n<h2><strong>Wir bieten:</strong></h2>\n<ul>\n<li>Spannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen Umfeld</li>\n<li>Vielfältige interne und externe Weiterbildungsmöglichkeiten sowie individuelle Karrieremodelle</li>\n<li>Coaching-Angebote und Möglichkeiten zur Persönlichkeitsentwicklung in einer wertschätzenden Arbeitsatmosphäre</li>\n<li>Gratis Fitnessstudio-Mitgliedschaft über Interfit und weitere attraktive Mitarbeitervergünstigungen</li>\n<li>Vertrauensarbeitszeit. Je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglich</li>\n<li>Ein attraktives Vergütungspaket inkl. arbeitgeberfinanzierter betrieblicher Altersvorsorge</li>\n</ul>\n<h2><strong>Haben wir Ihr Interesse geweckt?</strong></h2>\n<p>Dann bewerben Sie sich hier über das <strong>Bewerbungsformular</strong>.</p>\n<p><a href=\"https://bwi-it.redirect.your-jobresponse.com/interner_senior_entwickler_m_w_d_sap_hcm_bonn/254655/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n<p>Bei Fragen steht Ihnen das Recruiting-Team unter Angabe der Stellen-ID: 20881 gerne zur Verfügung. Tel.: 02225 988 3990</p>\n",
        "how_to_apply": "<p><a href=\"https://bwi-it.redirect.your-jobresponse.com/interner_senior_entwickler_m_w_d_sap_hcm_bonn/254655/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazV4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e756b958f2a46e529942e51701b43a4db4f4bbd1/BWI%20loogo.png"
    },
    {
        "id": "108e4924-3b2d-4ba7-902d-9b5d84df6ecd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/108e4924-3b2d-4ba7-902d-9b5d84df6ecd",
        "created_at": "Fri Sep 06 07:33:29 UTC 2019",
        "company": "BWI GmbH",
        "company_url": "http://www.bwi-it.de",
        "location": "Bonn",
        "title": "Technical Expert (m/w/d) SAP HCM-Berechtigungen",
        "description": "<p>Betreiben Sie mit uns eine der größten und komplexesten IT-Infrastrukturen Deutschlands und unterstützen Sie unser Team als</p>\n<h2><strong>Technical Expert (m/w/d) SAP HCM-Berechtigungen</strong></h2>\n<p><strong>ab sofort in Bonn.</strong></p>\n<p>Als IT-Partner der Bundeswehr und IT-Dienstleistungszentrum des Bundes bieten wir umfassende IT-Services aus einer Hand. Wir suchen echte IT-Liebhaberinnen und IT-Liebhaber, die ihre Leidenschaft mit uns teilen wollen und auf der Suche nach neuen Herausforderungen sind. Mit über 4.000 Mitarbeiterinnen und Mitarbeitern zählen wir zu den zehn größten IT-Service-Providern Deutschlands.</p>\n<p>Der Bereich SAP Application Management leistet u.a. den 2nd-Level-Support in allen Belangen der SAP HCM Anwendungslösung, mit der Zielsetzung den laufenden Betrieb sicherzustellen. Dazu gehören auch die Planung, Organisation und Umsetzung von Kundenprojekten im Lösungsumfeld.</p>\n<p>Erfahren Sie mehr in unserem Portfolio.</p>\n<h2><strong>Ihre Aufgaben:</strong></h2>\n<ul>\n<li>Erstellung und Pflege von Rollen und Berechtigungen im SAP HCM</li>\n<li>Konfiguration und Nutzung der SAP Benutzerverwaltung</li>\n<li>Beratung und Durchführung des 2nd Level Supports für SAP HCM-Berechtigungen</li>\n<li>Analyse und Bearbeitung von Berechtigungsproblemen in einer komplexen SAP Systeminfrastruktur im HCM Umfeld</li>\n<li>Konfiguration und Nutzung von SAP GRC</li>\n</ul>\n<h2><strong>Ihr Profil:</strong></h2>\n<ul>\n<li>Erfolgreich abgeschlossenes IT-bezogenes oder kfm. Studium oder eine vergleichbare Qualifikation</li>\n<li>Mehrjährige Erfahrungen als technischer Berechtigungsadministrator in SAP HCM</li>\n<li>Umfangreiches Knowhow im Bereich systemkritischer Basisberechtigungen</li>\n<li>Kenntnisse in der Konfiguration und Nutzung der SAP Benutzerverwaltung</li>\n<li>Idealerweise Praxiswissen im Coding mit ABAP OO, vor allem im Berechtigungsumfeld</li>\n<li>Kenntnisse in der Nutzung des SAP Solution Manager (min. Release 7.0) und Erfahrungen im Einsatz der SAP Industrielösung \"Defense Forces &amp; Public Security (DFPS)\" wünschenswert</li>\n</ul>\n<h2><strong>Wir bieten:</strong></h2>\n<ul>\n<li>Spannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen Umfeld</li>\n<li>Vielfältige interne und externe Weiterbildungsmöglichkeiten sowie individuelle Karrieremodelle</li>\n<li>Coaching-Angebote und Möglichkeiten zur Persönlichkeitsentwicklung in einer wertschätzenden Arbeitsatmosphäre</li>\n<li>Gratis Fitnessstudio-Mitgliedschaft über Interfit und weitere attraktive Mitarbeitervergünstigungen</li>\n<li>Vertrauensarbeitszeit. Je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglich</li>\n<li>Ein attraktives Vergütungspaket inkl. arbeitgeberfinanzierter betrieblicher Altersvorsorge</li>\n</ul>\n<h2><strong>Haben wir Ihr Interesse geweckt?</strong></h2>\n<p>Dann bewerben Sie sich hier über das <strong>Bewerbungsformular</strong>.</p>\n<p><a href=\"https://bwi-it.redirect.your-jobresponse.com/technical_expert_m_w_d_sap_hcm_berechtigungen_bonn/254651/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n<p>Bei Fragen steht Ihnen das Recruiting-Team unter Angabe der Stellen-ID: 11891 gerne zur Verfügung. Tel.: 02225 988 3990</p>\n",
        "how_to_apply": "<p><a href=\"https://bwi-it.redirect.your-jobresponse.com/technical_expert_m_w_d_sap_hcm_berechtigungen_bonn/254651/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3h4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4d11f6080aa04211959a30c8dba25e10ee8c3f9e/BWI%20loogo.png"
    },
    {
        "id": "969ce579-37f9-4019-a766-968b2ba70a27",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/969ce579-37f9-4019-a766-968b2ba70a27",
        "created_at": "Fri Sep 06 06:57:54 UTC 2019",
        "company": "Abovo Media",
        "company_url": "http:",
        "location": "Hoorn",
        "title": "Application Developer",
        "description": "<h2>Application Developer</h2>\n<p>Krijg je energie bij het bedenken en ontwikkelen van applicaties? Wil je werken aan innovatieve oplossingen bij een snelgroeiend mediabedrijf en onderdeel uitmaken van het IT-development team? Dan is de functie Application Developer bij Abovo Media iets voor jou!</p>\n<h2>Functieomschrijving</h2>\n<p>Als fulltime Application Developer (Full Stack) bouw en onderhoud je de verschillende (interne) systemen waar het hele bedrijf op draait. Van een klantenportaal en media-webshop tot een compleet backoffice-systeem waar het hele bedrijf afhankelijk van is. Je digitaliseert en optimaliseert ordering- en facturatieprocessen en bouwt tools ter ondersteuning van de werkzaamheden van je collega's, waarbij je meedenkt in de wensen van de gebruiker. Daarnaast ben je verantwoordelijk voor:</p>\n<ul>\n<li>Het bedenken en bouwen van technische oplossingen en uitbreiden van bestaande en nieuwe applicaties;</li>\n<li>Het signaleren van mogelijke bottlenecks en het meedenken over vernieuwingen;</li>\n<li>Het analyseren van bedrijfsprocessen en het uitbrengen van advies om deze te optimaliseren, waarna je deze samen met het team tot uitvoer zal brengen.</li>\n</ul>\n<h2>Er is meer……</h2>\n<p>Je werkt binnen een team van developers en designers om processen te optimaliseren en klanten te voorzien van reporting tools. De data waarmee je werkt komt uit een moderne REST API gebouwd in Symfony4 en werkt naadloos samen met de Angular7 front-end. Het visualiseren en optimaliseren van deze data en bijbehorende processen behoord tot jouw belangrijkste taken en verantwoordelijkheden, waarbij je streeft naar kwaliteit, duurzaamheid en efficiëntie. Daarnaast speelt het uitfaseren van een aantal legacy-applicities ook een rol binnen jouw takenpakket, waarbij je niet terugdeinst voor het tijdelijk onderhouden van deze software. Als een ervaringen Full Stack Developer wordt er van jou verwacht dat je jouw kennis kunt overbrengen op collega’s en technisch advies kunt uitbrengen aan product owners en stakeholders.</p>\n<h2>Wat bied jij Abovo Media?</h2>\n<ul>\n<li>Minimaal HBO werk-/denkniveau</li>\n<li>Minimaal 3 jaar relevante werkervaring</li>\n<li>Ervaring met PHP (7) en MySQL (zou top zijn als je ook ervaring hebt met Symfony/Laravel)</li>\n<li>Ervaring met Javascript, HTML/CSS (TypeScript/Angular is wenselijk)</li>\n<li>Pragmatisch, proactief, nauwkeurig en nieuwsgierig</li>\n<li>Gemotiveerd om resultaat te bereiken en schroomt niet om kennis en vaardigheden te delen met collega's</li>\n<li>Vindt het leuk om problemen van gebruikers op te lossen en nieuwe tooling te testen</li>\n<li>Ervaring met VSC (Git), Node/Webpack en unittesting is een pré.</li>\n</ul>\n<h2>Wat biedt Abovo Media jou?</h2>\n<ul>\n<li>Meer dan goed salaris in lijn met jouw kennis en ervaring</li>\n<li>Innovatieve en afwisselende baan waar jij onderdeel bent van het IT innovatieteam</li>\n<li>Ruimte om jezelf te ontwikkelen; opleidingen, cursussen en conferenties</li>\n<li>Goede secundaire arbeidsvoorwaarden (pensioenregeling, minimaal 25 vakantiedagen etc.)</li>\n<li>Informele sfeer (je voelt je thuis), gezellige afdelingsuitjes, LAN-party's, vrijmibo's en georganiseerde (tafelvoetbal) evenementen</li>\n<li>Werken bij het mediabureau met 3 topnoteringen in de Emerce100</li>\n</ul>\n<h2>Contactinfo</h2>\n<p>Voor informatie over de vacature kun je contact opnemen met Thom Kemmink (afdeling HR) op het telefoonnummer 0229 280 275 of mail naar <a href=\"mailto:HR@abovo.nl\">HR@abovo.nl</a>. Solliciteren kan via <a href=\"https://abovomedia.redirect.your-jobresponse.com/application_developer_hoorn/254645/V819/solliciteren\">deze link!</a>\nAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n",
        "how_to_apply": "<p><a href=\"https://abovomedia.redirect.your-jobresponse.com/application_developer_hoorn/254645/V1005/solliciteren\">Klik hier om te solliciteren!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1p4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1e5ddd17d30196dcb32a68bc6ac298ab1d89b2da/Abovo.jpg"
    },
    {
        "id": "4482e131-53c6-4104-aaec-dd0faf343dcb",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4482e131-53c6-4104-aaec-dd0faf343dcb",
        "created_at": "Thu Sep 05 19:56:53 UTC 2019",
        "company": "Expensify",
        "company_url": "https://we.are.expensify.com/",
        "location": "San Francisco",
        "title": "Mobile Full Stack Engineer",
        "description": "<p><strong>Your Mission, Should You Choose to Accept:</strong></p>\n<p>Join our passionate team of top-notch engineers to solve a real-world problem, and help people spend less time managing expenses and more time pursuing their real goals. As we revolutionize the way people manage their expenses, being part of the Expensify team means building the easiest, fastest, and most efficient platform to automate everything expense-related.</p>\n<p>Even though we work hard at Expensify, we make sure our employees are happy. Our most talked about perk is our Offshore where we spend a month abroad working from a remote location as a team. This year we’re going to Vietnam, do you want to join?</p>\n<p>About the Mobile Platform\nWe have a custom-built, cross-platform mobile solution (wow, that’s a mouthful). Our native platforms use a JavaScript engine that allows us to write our business logic in JS and UI using native frameworks.</p>\n<p><strong>About You</strong></p>\n<p>We’re looking for mobile engineers who are passionate about the product they’re building. You’re a self-driven engineer with an entrepreneurial spirit who is not afraid to work with our sales team to better understand and tackle user-facing issues. Ideally, you’ll have a general understanding of and experience in JavaScript, Android and/or iOS SDKs, and mobile design patterns. PHP is a plus, but not a requirement.</p>\n<ul>\n<li>\n<p>As a Mobile Full Stack Engineer, your responsibilities include:</p>\n</li>\n<li>\n<p>Collaborating with the team for large feature development and implementation.</p>\n</li>\n<li>\n<p>Independently develop smaller features and adjustments.</p>\n</li>\n<li>\n<p>Squashing bugs: big, small, and hairy!</p>\n</li>\n</ul>\n<p>For the best possible fit, we’re looking for someone who:</p>\n<ul>\n<li>\n<p>Works great on a small, collaborative team.</p>\n</li>\n<li>\n<p>Can design new features and tackle the annoying bugs.</p>\n</li>\n<li>\n<p>Writes clean, concise, and commented code.</p>\n</li>\n<li>\n<p>Can collaborate with other engineering teams to create new features and fix existing issues.</p>\n</li>\n<li>\n<p>Is comfortable with every part of the software development lifecycle.</p>\n</li>\n<li>\n<p>Can get shit done!</p>\n</li>\n</ul>\n<p><strong>Compensation &amp; Benefits</strong></p>\n<ul>\n<li>\n<p>Full-time, salaried position</p>\n</li>\n<li>\n<p>401k with employer match</p>\n</li>\n<li>\n<p>100% Medical/Dental/Vision contributions</p>\n</li>\n<li>\n<p>Commuter benefits</p>\n</li>\n<li>\n<p>Free lunch</p>\n</li>\n<li>\n<p>Flexible vacation policy</p>\n</li>\n<li>\n<p>Work from home when you need to</p>\n</li>\n</ul>\n<p><strong>Next Steps</strong></p>\n<p>Like what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are many ways to do that, but the easiest way to help us out is by answering the following questions:</p>\n<ul>\n<li>\n<p>What's the URL of your website? If you don't have one, why not?</p>\n</li>\n<li>\n<p>List any published apps that you have.</p>\n</li>\n<li>\n<p>What's your coding history? When did you start, and what have you done between then and now?</p>\n</li>\n<li>\n<p>What do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals?</p>\n</li>\n<li>\n<p>How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.</p>\n</li>\n</ul>\n<p>Resume not your thing? That’s great, we don’t really read them anyway! Forward your responses to the questions to <a href=\"mailto:jobs@expensify.com\">jobs@expensify.com</a>. We're excited to hear from you!</p>\n",
        "how_to_apply": "<p>Apply at <a href=\"https://we.are.expensify.com/\">https://we.are.expensify.com/</a>.</p>\n",
        "company_logo": null
    },
    {
        "id": "bcda41a5-bb85-4b26-ab9b-73a33889aedf",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/bcda41a5-bb85-4b26-ab9b-73a33889aedf",
        "created_at": "Thu Sep 05 15:07:08 UTC 2019",
        "company": "Direct Supply, Inc.",
        "company_url": null,
        "location": "Milwaukee",
        "title": "Staff Engineer - DBE",
        "description": "<p>Job description:\nThe Staff Engineer (with Database focus) is responsible for overseeing and managing our complex database systems. In this role, you will perform database tuning, monitoring, alerting and diagnostic strategies to ensure optimal performance. This is a senior technical position within our Engineering organization and will serve as the lead escalation support for our production database.</p>\n<p>What you'll do:</p>\n<ul>\n<li>Perform configuration and performance tuning on a variety of platforms (MS SQL Server, PostgreSQL, etc.). Review, write, and optimize queries and stored procedures.</li>\n<li>Design, implement, and improve monitoring, alerting, and diagnostic strategies and mechanisms for our complex database systems.</li>\n<li>Provide assistance to software engineering teams to review and optimize database designs and implementations to ensure reliability and correctness.</li>\n<li>Design, develop, and maintain ETL and data replication processes to support our reporting environments.</li>\n<li>Manage database life cycles.  Design and develop specifications for future database requirements including enhancements, upgrades, capacity projections, and cost optimizations; evaluate alternatives and make recommendations. Apply security patches and upgrades as needed, inventory systems, and retire unused items.</li>\n<li>Develop and implement procedures for automated testing, build and deployment using CI/CD patterns and practices.</li>\n<li>Support the production environment, including on-call responsibilities. Participate in post-mortems, investigate root causes for incidents, and provide and implement recommendations for improvement.</li>\n</ul>\n<p>What you'll need:</p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Computer Engineering or Software Engineering</li>\n<li>5+ years of professional software programming or database administration/engineering experience</li>\n<li>3+ years of experience with major database systems (MS SQL, PostgreSQL, etc.)</li>\n</ul>\n<p>Other items of interest:</p>\n<ul>\n<li>Experience with cloud-hosted and non-relational database systems (AWS RDS, DynamoDB)</li>\n<li>Experience with scripting and automation tools/languages</li>\n<li>Knowledge and experience with monitoring systems and frameworks (NewRelic, AWS CloudWatch, Sumologic)</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZL&amp;lang=en\">https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZL&amp;lang=en</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0J4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--191b33d046f1e6ee2b714af601b5d1b4a35f822f/Direct_Supply_logo.png"
    },
    {
        "id": "bbc02e72-cf2a-490a-9382-978689ac272f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/bbc02e72-cf2a-490a-9382-978689ac272f",
        "created_at": "Thu Sep 05 15:05:10 UTC 2019",
        "company": "Direct Supply, Inc.",
        "company_url": null,
        "location": "Milwaukee",
        "title": "Software Systems Analyst II",
        "description": "<p>Job description\nThe Systems Software Analyst II assists in the design, implementation and maintenance of Direct Supply’s various software technology systems.  In this role, you will work with both our development and business unit teams to create integrated, cohesive systems.</p>\n<p>What you'll do:</p>\n<ul>\n<li>Define and refine system requirements and designs while working with a medium to large size development team.</li>\n<li>Provide oversight and ownership of multiple software systems, including system documentation and modeling of software systems.</li>\n<li>Work with other System Analysts to help ensure cohesive design and implementation of software systems.</li>\n<li>Build formal models to better understand and analyze large, complex systems.</li>\n<li>Able to work in an Agile/Scrum development environment and serve as a Product Owner for a development team</li>\n<li>Mentor junior engineers and teams to identify and solve complex technical problems.</li>\n<li>Foster teamwork &amp; trust through technical expertise and desire to help others.</li>\n<li>Establish key performance indicators for systems and components.</li>\n<li>Work with development and testing team members on construction and validation of system requirements.</li>\n</ul>\n<p>What you'll need:</p>\n<ul>\n<li>Bachelor’s Degree, preferably in Software Engineering or related field</li>\n<li>5+ years of experience in Software Development, Systems Analysis, Business Analysis, or similar software technology.</li>\n<li>2+ years of experience as a Software Architect or Systems Analyst.</li>\n</ul>\n<p>Other items of interest:</p>\n<ul>\n<li>Knowledge of MSSQL, C#, or other development languages</li>\n<li>Experience in system testing, problem resolution, and Agile/Scrum coaching</li>\n<li>B2B or other eCommerce experience</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZ4&amp;lang=en\">https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZ4&amp;lang=en</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajV4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--83a5683bcde083fa985788c05d88f9041a42be27/Direct_Supply_logo.png"
    },
    {
        "id": "ed25fdaf-0c80-4dfc-946a-c590ad8c05f7",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ed25fdaf-0c80-4dfc-946a-c590ad8c05f7",
        "created_at": "Thu Sep 05 15:01:15 UTC 2019",
        "company": "Direct Supply, Inc.",
        "company_url": null,
        "location": "Milwaukee",
        "title": "Software Engineer",
        "description": "<p>Job description:</p>\n<p>This role will focus on developing customer-driven product enhancements to our web based products, mobile applications and/or server based transaction systems.  In this position, you will author programming tasks, design for test-ability, debug code and be responsible for creating and maintaining automated tests.</p>\n<p>What you'll do:</p>\n<ul>\n<li>Develop software solutions that meet defined usability, maintainability, scalability and reliability requirements. Solutions must drive efficiency and meet quality standards.</li>\n<li>Take ownership of assigned work, monitor and maintain the health of solutions generated. Increase operating efficiency and adapt to new requirements.</li>\n<li>Author small and well-defined programming tasks.</li>\n<li>Code, test and debug programs as outlined by a system’s technical and functional requirements.</li>\n<li>Create and maintain automated testing and document testing procedures.</li>\n</ul>\n<p>What you'll need:</p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Computer Engineering or Software Engineering</li>\n<li>1-3 years of experience coding in C# (or Java for qualified full stack engineers) and working in the SQL database</li>\n<li>Experience developing with ASP.net with SQL DB JavaScript, JQuery, React JS and MVC framework</li>\n<li>Demonstrated understanding of proven design principles and code practices</li>\n<li>Knowledge and understanding of RESTful APIs</li>\n<li>Experienced in automated testing frameworks</li>\n<li>Experience working in a Microsoft Environment using Visual</li>\n<li>Ability to work autonomously and collaboratively in a team environment using frameworks like - SCRUM &amp; Agile to deliver on customer commitments</li>\n</ul>\n<p>Other items of interest:</p>\n<ul>\n<li>Experience developing large, scalable, highly-available web-based eCommerce software</li>\n<li>AWS/Cloud experience</li>\n<li>Experience working in Git or TFS source control systems</li>\n<li>Knowledgeable in Continuous Integration / Continuous Deployment (CI/CD) / Build automation practices</li>\n<li>Configuring and integrating with Magento</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZC&amp;lang=en\">https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZC&amp;lang=en</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c30be8b167ac5457bbd11e54dbfe777e9c520452/Direct_Supply_logo.png"
    },
    {
        "id": "7ce9367e-d948-4e80-ae65-b7957d562820",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7ce9367e-d948-4e80-ae65-b7957d562820",
        "created_at": "Thu Sep 05 14:49:30 UTC 2019",
        "company": "Direct Supply, Inc.",
        "company_url": null,
        "location": "Milwaukee",
        "title": "Senior Software Engineer",
        "description": "<p>Job description:</p>\n<p>In this role, you will develop software and mentor others to meet Direct Supply’s business goals using an agile methodology. You will be a member of a software development team focused on developing new software functionality for our web-based eCommerce product, our web-based service offerings or our server-based transaction processing systems.</p>\n<p>What you'll do:</p>\n<p>Software development (60%) &amp; Support (10%)</p>\n<ul>\n<li>Large-scale web application design and coding using the Microsoft stack (C#/ASP.Net/WebAPI/MVC/SQL Server), as well as some open source technologies (Git, AngularJS, ReactJS, PostgreSQL, etc.)</li>\n<li>Develop a defined feature or provide direction and guidance to a group of engineers to develop defined feature (set) ranging from small to medium in size</li>\n<li>Define and implement optimizations for maintainability, scalability, availability, security, reusability, and performance</li>\n<li>Identify patterns in defects and implement patterns and/or tools to protect against an entire class of defects</li>\n<li>Proactively monitor and maintain a healthy solution</li>\n<li>Identify and communicate failure modes and take measures to mitigate where reasonable</li>\n<li>Understand the business problem and take ownership of defining how the solution as a whole aligns to the overall technical strategy</li>\n</ul>\n<p>Collaboration &amp; coordination with others (20%)</p>\n<ul>\n<li>Communicate implications of design decisions and propose mitigation plans</li>\n<li>Ensure team buy-in to and reliable delivery of committed outcomes</li>\n<li>Work collaboratively with architects, UX, and other shared groups to ensure quality solutions</li>\n<li>Proactively communicate with stakeholders (operations, customer, other teams, and/or leadership) - regarding solutions and status updates to business problems )</li>\n</ul>\n<p>Continuous learning and mentoring (10%)</p>\n<ul>\n<li>Actively share knowledge through peer mentoring, shared resources (e.g. wikis, readmes) and informal teachings (e.g. lunch and learns)</li>\n<li>Drive best practices and process improvements within the team</li>\n<li>Participate in innovation days and hackathons to experiment and learn new technologies</li>\n</ul>\n<p>What you'll need:</p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Computer Engineering or Software Engineering</li>\n<li>3+ years of software engineering experience</li>\n<li>Strong C# and database development skills in a web-based environment</li>\n<li>Experience with large JavaScript frameworks, such as AngularJS or ReactJS</li>\n<li>Experience applying proven design principles, code practices, and SDLC concepts to improve customer outcomes</li>\n</ul>\n<p>Other items of interest:</p>\n<ul>\n<li>Experience developing large, scalable, highly-available web-based eCommerce software</li>\n<li>AWS/Cloud experience</li>\n<li>Experience working in Git or TFS source control systems</li>\n<li>Knowledgeable in Continuous Integration / Continuous Deployment (CI/CD) / Build automation practices</li>\n<li>Experience working in an agile (Scrum) methodology</li>\n<li>Configuring and integrating with Magento</li>\n<li>Experiencing coding in PHP</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZ5&amp;lang=en\">https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BZ5&amp;lang=en</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanB4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b7831723b6505a4e1a64620ab2b46f9ab832fb03/Direct_Supply_logo.png"
    },
    {
        "id": "bd615df7-3401-404c-9002-a65b9fa7bedc",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/bd615df7-3401-404c-9002-a65b9fa7bedc",
        "created_at": "Thu Sep 05 14:46:23 UTC 2019",
        "company": "Direct Supply, Inc.",
        "company_url": null,
        "location": "Milwaukee",
        "title": "Senior Platform Engineer",
        "description": "<p>Job description:\nAs a Senior Platform Engineer, you will operate as a subject matter expert (SME) in 3-4 of the products related to Integration and Deployment (i.e. Git, Octopus Deploy, Terraform, Jenkins) with responsibilities to help both maintain and expand our existing systems.</p>\n<p>What you'll do:</p>\n<p>Product Ownership and Research &amp; Development (50%)</p>\n<ul>\n<li>Enhance products through additional capabilities (automation, self-service, new features) based on business need, industry trends, and customer feedback.</li>\n<li>Plan the upgrades/migrations of the products/technologies.</li>\n<li>Research emerging technologies / execute proof of concept projects.</li>\n<li>Implement methods to improve system up time and stability</li>\n<li>Set and maintain system standards and best practices.</li>\n<li>Implement programmatic approaches to reduce repetitive tasks and increase speed of execution, i.e. scripting.</li>\n</ul>\n<p>Technology Strategic Planning (20%)</p>\n<ul>\n<li>Monitor vendor road maps and industry trends.</li>\n<li>Complete strategic planning for products as delegated by senior System Engineers.</li>\n<li>Assist in the proposal of technology strategy, budget, and road maps to leadership regularly throughout the year.</li>\n</ul>\n<p>Implementation/Project Execution (30%)</p>\n<ul>\n<li>Execute the upgrades/migrations of the products owned as part of a project team or individually based on project needs.</li>\n<li>Execute business sponsored initiatives as part of a project team.</li>\n<li>Operate within an Agile Scrum team</li>\n</ul>\n<p>What you'll need:</p>\n<ul>\n<li>Bachelor’s degree in Computer Engineering, Information Technology, or related field</li>\n<li>4 - 10+ years related work experience</li>\n<li>Expertise in two or more of the following:</li>\n<li>Microsoft server operating systems and applications</li>\n<li>Linux operating system and open source applications (i.e. GIT, Octopus Deploy)</li>\n<li>System Monitoring and debugging</li>\n<li>Administration of configuration management solutions</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BYX&amp;lang=en\">https://directsupply.taleo.net/careersection/jobdetail.ftl?job=00BYX&amp;lang=en</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamR4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1ddb430d0ba91ebc88ae4514d93418669c0cdad7/Direct_Supply_logo.png"
    },
    {
        "id": "8825a93e-3c8e-46e7-aff7-fc69f54cdd77",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8825a93e-3c8e-46e7-aff7-fc69f54cdd77",
        "created_at": "Thu Sep 05 13:01:23 UTC 2019",
        "company": "Verimi GmbH",
        "company_url": "http://www.verimi.com",
        "location": "Berlin",
        "title": "(Senior) Backend Developer (m/f/d)",
        "description": "<p><strong>We are Verimi – The identity platform for Europe.</strong></p>\n<p>We develop solutions for digital identity management. We are a joint venture of many international shareholders, including Allianz, Axel Springer, Bundesdruckerei, Daimler, Deutsche Bahn, Deutsche Bank, Deutsche Telekom, Giesecke &amp; Devrient, Lufthansa, Samsung and Volkswagen. At our headquarters in Berlin-Kreuzberg we work with approximately 70 highly motivated employees. We want to offer a digitalized world without hurdles for users – where they can store their data once at Verimi and then use it again and again to log in and identify themselves online with just one click. Our focus is on the user: that's why only the user decides when to share data with companies.</p>\n<p>We are looking for team players to support us and who are passionate about making the Internet more convenient, secure and fair.</p>\n<p><strong>Your mission</strong></p>\n<ul>\n<li>You will focus on the backend of the Verimi system as part of an agile development team, making sure the software gets better with every commit.</li>\n<li>Your goal is to build high quality software by applying unit and integration tests and by code reviews.</li>\n<li>You contribute ideas and knowledge when architectural changes are discussed.</li>\n<li>You will support the product management in transferring ideas into great user stories. Building spikes and prototypes is your idea of fun.</li>\n</ul>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>You have an university degree in computer science or a related field.</li>\n<li>You have several years of experience as software developer.</li>\n<li>You are an expert in Java, Spring Boot, a RDBMS like PostgreSQL.</li>\n<li>You know a lot about designing and developing microservices.</li>\n<li>Your favorite working style is Scrum or Kanaban.</li>\n<li>Knowledge in Kubernetes, Swagger, OAuth2.0, Kafka, Javascript and React would be a plus.</li>\n<li>You are fluent  in English, German knowledge would be a plus.</li>\n</ul>\n<p><strong>Why Verimi?</strong></p>\n<ul>\n<li>We have the unique opportunity to shape the future of digital identity management in Europe.</li>\n<li>We are a dynamic start-up company that is built on a solid foundation with 13 well-known shareholders.</li>\n<li>We live flat hierarchies and short communication channels in a highly motivated and diverse team.</li>\n<li>We offer every colleague contribute their own ideas and thus shape our growth together.</li>\n<li>We work in a modern and central office in Berlin-Kreuzberg. Free drinks and fruit are just as much a part of it as flexible working hours, working from home, and 30 days vacation.</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/b92edaf6f158728f9e26e87b0ccad77d5f1483ca/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f65313264353834393735343332313361353262396332653531386163636462643031323339363732393339376566343035356638386662303836393931316331\"></p>\n",
        "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/7c2a498fe35a53c2206f57b81c8dd9909903e74cbd9adf2d869552378f2d4d92\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04d64f03c1046d479779cf5de19b19aec3bba04d/8faf1288cf6168cde93e578ca9f39f1e.png"
    },
    {
        "id": "7e8bfac5-b9f1-49a2-a433-b6f56235a7b8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7e8bfac5-b9f1-49a2-a433-b6f56235a7b8",
        "created_at": "Thu Sep 05 12:58:08 UTC 2019",
        "company": "Verimi GmbH",
        "company_url": "http://www.verimi.com",
        "location": "Berlin",
        "title": "Quality Assurance Engineer (m/f/d)",
        "description": "<p><strong>We are Verimi - The identity platform for Europe.</strong></p>\n<p>We develop solutions for digital identity management. We are a joint venture of many international shareholders, including Allianz, Axel Springer, Bundesdruckerei, Daimler, Deutsche Bahn, Deutsche Bank, Deutsche Telekom, Giesecke &amp; Devrient, Lufthansa, Samsung and Volkswagen. At our headquarters in Berlin-Kreuzberg we work with approximately 70 highly motivated employees. We want to offer a digitalized world without hurdles for users – where they can store their data once at Verimi and then use it again and again to log in and identify themselves online with just one click. Our focus is on the user: that's why only the user decides when to share data with companies.</p>\n<p>We are looking for team players to support us and who are passionate about making the Internet more convenient, secure and fair.</p>\n<p><strong>Your mission</strong></p>\n<ul>\n<li>You drive QA efforts from requirement analysis to production release</li>\n<li>You will write, execute and maintain frontend/backend automation and manual tests</li>\n<li>You have strong programming knowledge in Java, and shell scripting</li>\n<li>You have worked with test automation frameworks like Selenium, Cucumber, TestNG  etc.</li>\n<li>You have a hands-on experience with Git and Maven/Gradle</li>\n<li>You have worked with test case management tool like TestRail</li>\n</ul>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>You have 3+ years hands-on software testing experience</li>\n<li>You have a Bachelor's degree in Computer Science, Engineering, Mathematics</li>\n<li>You have good written and verbal communication skills in English</li>\n<li>You have strong analytical and problem solving skills</li>\n<li>You are passionate for software testing and curious of new IT Technologies</li>\n</ul>\n<p><strong>Why Verimi?</strong></p>\n<ul>\n<li>We have the unique opportunity to shape the future of digital identity management in Europe.</li>\n<li>We are a dynamic start-up company that is built on a solid foundation with 13 well-known shareholders.</li>\n<li>We live flat hierarchies and short communication channels in a highly motivated and diverse team.</li>\n<li>We offer every colleague contribute their own ideas and thus shape our growth together.</li>\n<li>We work in a modern and central office in Berlin-Kreuzberg. Free drinks and fruit are just as much a part of it as flexible working hours, working from home, and 30 days vacation.</li>\n</ul>\n<p><strong>Your contact</strong></p>\n<p>Claudia Vaupel</p>\n<p><img src=\"https://camo.githubusercontent.com/1b10063bac9bdec862d4195758f05fd387dee944/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f30373463376237313265653534376236333734643839366333613832363536363433666562646266323536643131616532623533313535316230653035306636\"></p>\n",
        "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/29215ec4969ce96a2a108c1e0c7ed179c432ae5615b431fcb29aa47ba96399dd\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak54IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5df776eb5eda8c14b26648fafa8f711270994df6/8faf1288cf6168cde93e578ca9f39f1e.png"
    },
    {
        "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
        "created_at": "Sat Aug 03 00:50:23 UTC 2019",
        "company": "Game Closure",
        "company_url": "http://gameclosure.com",
        "location": "San Francisco, Mountain View, Tokyo",
        "title": "Senior Game Engineer",
        "description": "<p>Game Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n<p>Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.</p>\n<p>It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n<p><strong>The Role:</strong></p>\n<ul>\n<li>Be responsible for designing, developing and deploying major game features</li>\n<li>Own game feature areas from end-­to­-end</li>\n<li>Be the champion for the user!</li>\n<li>Insist on the highest standards and create functional and engaging features that will delight our users</li>\n<li>Be part of a tight game development team looking to iterate fast on a fun concept and then building it out</li>\n<li>Have real input on end-user product</li>\n<li>Be a key member of a high performing software engineering team</li>\n<li>Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements</li>\n<li>Hands­ on architect and coder for sophisticated client/server systems for mobile gaming</li>\n<li>Innovate and iterate on process, systems and technology to deliver world­-class social games</li>\n<li>Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!</li>\n</ul>\n<p><strong>Desired Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience, working on cross functional teams.</li>\n<li>Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).</li>\n<li>Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.</li>\n<li>Proficient at using script debuggers like Chrome Debugger.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.</li>\n<li>Solid familiarity with analytics and A/B testing in mobile games</li>\n<li>Familiarity with git, svn or other VCS.</li>\n<li>Self starter, analytical and creative</li>\n<li>Strong team player with a positive attitude.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.</li>\n<li>Check out Everwing on Facebook Instant Games in Messenger. Can you build this game?</li>\n<li>Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).</li>\n</ul>\n<p><strong>Bonus:</strong></p>\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n<li>Expert knowledge of TypeScript</li>\n</ul>\n<p><strong>GC Perks:</strong></p>\n<ul>\n<li>Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered</li>\n<li>Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more</li>\n<li>Commuter Pass + Free Parking: Your commute and parking to the office is on us!</li>\n<li>PTO: Unlimited vacation policy</li>\n<li>Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks</li>\n<li>Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"
    },
    {
        "id": "f3c4b393-1d0d-4ebb-9274-b0545166fd96",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f3c4b393-1d0d-4ebb-9274-b0545166fd96",
        "created_at": "Wed Sep 04 23:21:18 UTC 2019",
        "company": "AppNeta",
        "company_url": "http://AppNeta.com",
        "location": "Vancouver",
        "title": "Senior Site Reliability Engineer",
        "description": "<p><em>AppNeta is a fast-growing global technology company that is taking advantage of the massive performance monitoring marketplace sized by Gartner as $2.2B in 2019. AppNeta has been named five times to the Inc. 5000 Fastest-growing Private Companies list, and has won numerous awards for company culture, including Inc. Magazine and BBJ’s Best Places to Work and BostInno’s Coolest Companies.</em></p>\n<p>After a few years of adopting DevOps practices, AppNeta is doubling-down by creating a dedicated Site Reliability team. Our primary goal is to streamline the 'as-a-Service' part of 'SaaS' by improving reliability for customers, minimizing operational overhead, and maximizing cost-effectiveness of our infrastructure.</p>\n<p>Our vision is to build an elegant, robust cloud-based platform, then migrate all of AppNeta's hosted services into it. We are involved in the full lifecycle for services hosted on this platform. We act as advocates for scalability, security, and fault-tolerance, working with other engineering teams at AppNeta to achieve continuous improvements in these areas.</p>\n<p>We are building a cohesive team with diverse experience and perspectives. We value transparent, respectful, and light-hearted communications, and people who are well-organized, collaborative, pragmatic, and empathetic. We want to work with team-players, not rock stars.</p>\n<p>The ideal candidate derives deep satisfaction from bringing order to chaos, dares to think big, has the technical skill to blaze a new trail, possesses the emotional intelligence to effectively influence direction, and can balance tactical needs against strategic advancement.</p>\n<p>If you're intrigued, please submit your resume. We also love cover letters; stand out by telling us why you’d be a great fit!</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Lead the design and implementation of a new platform, addressing concerns such as builds, continuous integration &amp; delivery, service discovery, network security, secrets management, monitoring &amp; alerting, access control, and vulnerability management</li>\n<li>Work closely with other engineering teams to evolve product/service architecture, and migrate services into our freshly-minted platform, and ensure that new services are designed with operability in mind</li>\n<li>Automate all of the things, freeing yourself and others from the tyranny of manual tasks</li>\n<li>Participate in an on-call rotation, along with other technical team members</li>\n<li>Practice sustainable incident response and coordinate blameless postmortems</li>\n<li>Mentor SRE team members, helping them reach their full potential</li>\n<li>Assist in the definition, prioritization, and planning of work in a fast-paced environment</li>\n</ul>\n<p><strong>Highly desirable traits:</strong></p>\n<p>We’re open to people with a range of experience, but as a senior you should tick more than half of the following:</p>\n<ul>\n<li>Strong interpersonal communication skills (listening, speaking, and writing)</li>\n<li>Solid grasp of Linux systems, scripting, package management, and networking concepts</li>\n<li>Strong familiarity with Amazon Web Services (especially computer, networking, storage), and interacting with them via API/CLI</li>\n<li>Expertise with configuration management tools (e.g. Chef, Ansible, Puppet)</li>\n<li>Proficiency in at least one programming language (Python, Java, Ruby, or Go preferred)</li>\n<li>Experience implementing or maintaining CI/CD pipelines, either self-hosted (e.g. Jenkins, TeamCity), or managed (e.g. AWS CodeBuild, Codeship)</li>\n<li>Experience developing effective operational monitoring and alerting (with tools such as\nPrometheus, CloudWatch, and Splunk)</li>\n<li>Operational knowledge of virtualized and containerized environments (e.g. vSphere, KVM, Docker)</li>\n<li>Demonstrable aptitude to learn new technologies, and apply that knowledge to solve real problems</li>\n</ul>\n<p><strong>Bonus points for:</strong></p>\n<ul>\n<li>Experience (or interest) in team lead/scrum master/project management responsibilities</li>\n<li>Experience operating large-scale, distributed systems on top of cloud infrastructure such as Amazon Web Services, Google Compute Platform, or Microsoft Azure</li>\n<li>Experience with infrastructure management/orchestration tooling (e.g. CloudFormation, Terraform, Rundeck)</li>\n<li>Expertise with container deployment/orchestration technologies, especially Kubernetes</li>\n<li>Experience with service discovery (e.g. Consul, SmartStack), and secrets management (e.g. Vault)</li>\n<li>Professional Java coding experience, or operating Java-based applications</li>\n<li>Skill in identifying performance bottlenecks, identifying anomalous system behavior, and determining the root cause of incidents</li>\n</ul>\n<p><strong>About AppNeta:</strong>\nAppNeta is the leader in proactive end-user performance monitoring solutions built for the distributed enterprise. With AppNeta, IT and Network Ops teams can assure continual and exceptional delivery of business-critical applications. AppNeta’s SaaS-based solutions give IT teams essential application and network performance data, allowing them to continuously monitor user experience across any application, network, data center or cloud.</p>\n<p>At AppNeta, we take application and network performance seriously without taking ourselves too seriously. We are big believers in a work hard, play hard culture. We offer everything from catered lunch and free snacks to commuter benefits and Maternity/Paternity leave, and pride ourselves on providing a challenging yet fun and collaborative environment in both our offices. For more on our company culture, perks, and benefits, check out our website: <a href=\"https://www.appneta.com/about/company-culture/\">https://www.appneta.com/about/company-culture/</a>.</p>\n<p><strong>About AppNeta’s office locations:</strong></p>\n<p><strong>Boston:</strong>  Located just steps from South Station in the heart of the Innovation District, AppNeta’s Boston office is home to our Sales &amp; Sales Engineering, Marketing, Customer Success, Product and G&amp;A teams.\n<strong>Vancouver:</strong> One block from Waterfront Station in the heart of historic Gastown, AppNeta’s Vancouver office is home to our Product, Engineering and Customer Success teams.\n </p>\n",
        "how_to_apply": "<p>To apply, please visit:\n<a href=\"https://grnh.se/9e5475091\">https://grnh.se/9e5475091</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakZ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31c6bda2941a5b85adf335a893591720d40228ca/AppNeta%20Logo.png"
    },
    {
        "id": "fb6c350e-89d6-45c6-8525-b78706baabd8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fb6c350e-89d6-45c6-8525-b78706baabd8",
        "created_at": "Wed Sep 04 21:05:10 UTC 2019",
        "company": "Bloom Insurance",
        "company_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=ddcb8cd1-1033-4b76-867a-ed473c7f1429&ccId=2532527312_4914&type=MP&lang=en_US",
        "location": "Columbus, OH",
        "title": "Sr. Software Developer - Multi Product Environment",
        "description": "<p>Innovate. Grow. Bloom.</p>\n<p>The healthcare insurance industry is growing faster than any other insurance sector in the United States. If you’re looking for a tech career with a growing company where you can make a difference, earn a great salary, and be recognized for your forward thinking, then Bloom is it.</p>\n<p>Who Is Bloom?\nWe are the Insurance Industry's Trusted Growth Partner. We are industry visionaries. We’re solving problems and advancing the healthcare Insurance business through Innovative Technology. We are committed to ensuring our state-of-the-art software products and services provide greater efficiency and cost savings to clients. This is what we do at Bloom and you can be part of it.</p>\n<p>Our Technology\nWe provide advanced sales and enrollment automation software to the insurance industry through our Ascend technology platform. Bloom’s Ascend™ technology platform focuses on sales automation efficiencies and optimizing the member experience from the first moment a prospect considers a health plan membership.</p>\n<p>Your role\nThis role is based at our offices in BLOOMINGTON, INDIANA. As a Sr. Software Developer, you will have the opportunity to work in a collaborative, multi-product team environment. You will design, create, and maintain efficient and quality code, tests, and documentation of software applications and processes for customized .NET applications.</p>\n<p>Our Culture\nWe pride ourselves on being an awesome place to work. Our office environment is fun and casual, we want our team to enjoy the space in which they work. You’ll get to know your fellow employees at our fun events and team lunches. Our community engagement events offer opportunities to give back to the community through volunteering and other activities.</p>\n<p>What’s in it for you</p>\n<ul>\n<li>Competitive compensation</li>\n<li>FT office hours</li>\n<li>Paid vacation, holidays and more</li>\n<li>Comprehensive health benefits package</li>\n<li>Long-term career growth &amp; mentoring</li>\n</ul>\n<p>Responsibilities</p>\n<ul>\n<li>Develop and support customized .NET applications</li>\n<li>Develop and support customized mobile applications using Visual Studio</li>\n<li>Software requirement specifications for the development of new applications</li>\n<li>Discovery on new projects, followed by specification development</li>\n<li>Troubleshoot technical issues</li>\n<li>Work with SQL Developers to create necessary database objects in a .NET environment</li>\n<li>Develop and maintain functional, and automated unit tests for in-house developed software solutions</li>\n<li>Testing of products in controlled environments prior to going live</li>\n<li>Work closely with designers, management, and project managers to ensure satisfaction of client needs</li>\n<li>Participate in regular code reviews</li>\n<li>Mentor other developers on development practices and professional development</li>\n</ul>\n<p>Education/Experience</p>\n<ul>\n<li>B.S. in computer science or equivalent</li>\n<li>10+ years professional experience or equivalent</li>\n<li>Lead developer experience</li>\n</ul>\n<p>Technical Background\nThe ideal candidate will have comfort and proficiency with the majority of the following:</p>\n<ul>\n<li>Demonstrated experience writing complex business apps in .NET with SQL Server back-end</li>\n<li>Thorough understanding of Object Oriented Programming (OOP) concepts and practice</li>\n<li>Thorough understanding of Web development concepts and practice</li>\n<li>Experience working with Visual Studio</li>\n<li>Experience with most of the following technologies</li>\n<li>ASP.NET</li>\n<li>C#</li>\n<li>MVC</li>\n<li>Web API</li>\n<li>HTML</li>\n<li>JavaScript</li>\n<li>Jquery</li>\n<li>CSSREST based web services</li>\n<li>XML &amp; JSON</li>\n<li>Source Control Management (Git, Mercurial, TFS, Subversion)</li>\n<li>Experience using performance tuning tools and techniques for web applications</li>\n<li>Experience in systems integration, business analysis, and project management is also a plus</li>\n<li>Experience with Xamarin a plus</li>\n<li>Experience in cross platform mobile development a plus</li>\n<li>Clear, concise communication skills, attention to details, analytical thinking</li>\n<li>Explain technical solutions to non-technical stakeholders</li>\n<li>Working with reporting tools</li>\n<li>Work with project managers to develop documentation of new features for end users</li>\n</ul>\n<p>We have an opening In BLOOMINGTON, INDIANA with an immediate start date so we invite you to apply NOW!</p>\n<p>Applicants must be authorized to work in the U.S.</p>\n<p>Bloom is an equal opportunity employer and does not discriminate against any employee or applicant for employment based on race, color, religion, national origin, age, gender, sex, ancestry, citizenship status, mental or physical disability, genetic information, sexual orientation, veteran status, or military status.</p>\n",
        "how_to_apply": "<p>Click to apply: <a href=\"https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=ddcb8cd1-1033-4b76-867a-ed473c7f1429&amp;ccId=2532527312_4914&amp;type=MP&amp;lang=en_US\">https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=ddcb8cd1-1033-4b76-867a-ed473c7f1429&amp;ccId=2532527312_4914&amp;type=MP&amp;lang=en_US</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXB4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--10a10f36b4945d82fafb6bcb133482e8b0f54107/bloom-logo-new-colour.png"
    },
    {
        "id": "e3268c79-614c-4978-8f22-e6495c1e067f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e3268c79-614c-4978-8f22-e6495c1e067f",
        "created_at": "Wed Sep 04 19:54:29 UTC 2019",
        "company": "Stride Consulting",
        "company_url": "https://www.stridenyc.com/careers",
        "location": "New York City",
        "title": "Lead Software Development Consultant",
        "description": "<p><strong>Join our Family</strong></p>\n<p>Stride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’re in great company.</p>\n<p>Our goal is to leave our clients functioning at a higher level than when we found them.  We do this by writing high quality code alongside them, and by mentoring their developers, product teams and stakeholders in software development best practices.</p>\n<p>We believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.</p>\n<p><strong>As a Strider, you’ll find an unmatched opportunity. You will:</strong></p>\n<p>Be a senior member of an engineering-driven culture, one that is employee owned, has a 4.9 star Glassdoor review, and has won Crain’s Best Places to Work 2 years in a row.\nWrite high-quality code with some of the smartest engineers in town.\nMentor and manage a Stride team\nManage projects:\nCreate technical engagement strategy with Stride’s account team\nForm trust with client leadership\nHelp structure how the project is run, including Agile process and development/architecture decisions</p>\n<p><strong>Day In The Life of an Engineering Manager</strong></p>\n<p>You are empowered to define what work/life balance means to you. You’ll work onsite at your client in NYC. We are proud to call some of the most outstanding tech teams our clients.</p>\n<p>Your work week will involve 60%-80% client work (coding, managing a Stride team, and running the engagement). The rest of your time will be spent on strategic initiatives.</p>\n<p>A sample day:</p>\n<ul>\n<li>\n<p>9am: Weekly Sprint Planning.  Me and the client Product Owner co-run weekly sprint planning. We’ve got the meeting down to a nice rhythm. We walk away with a plan.</p>\n</li>\n<li>\n<p>10am: Daily Standup.</p>\n</li>\n<li>\n<p>10:10-12:30 Pair Programming. This morning, I’m pairing with another Strider, a mid-level engineer. She’s got strong fundamentals. We’re doing a deep dive into complex backend code. She’s driving, I’m asking questions when I see she gets stuck. She noticed inefficient code and we spent about 20 minutes refactoring.</p>\n</li>\n<li>\n<p>12:30-1:30 Lunch</p>\n</li>\n<li>\n<p>1:30-3:00 Pair Programming</p>\n</li>\n<li>\n<p>3:00-3:30 Mob programming  A team member gets stuck on a piece of code. I sit down with Jean and his pair. We call over 2 other developers and we mob program. We figure out a plan and everyone is excited about the collaboration.</p>\n</li>\n<li>\n<p>3:30-4:30 Mind Map Over the past two months, I’ve observed the team’s strengths and areas for improvement. Today, I’m leading a Mind Mapping session with the Striders. We visually organize areas for improvement. We prioritize each item by complexity and importance. Next Monday, I’m presenting this to the client CTO.</p>\n</li>\n<li>\n<p>4:30- 5: Code Review Today, one of the Striders was coding solo. So, I sit down and review her code.</p>\n</li>\n<li>\n<p>5-6: Stride U DevOps Jam Stride U is ongoing education for Striders by Striders. Seven of us are taking the DevOps Jam course now, it’s 1 hour weekly, for 8 weeks.  DevOps is something I’m dipping a toe in and having a safe space to learn real world stuff that I can bring back to my client is amazing.</p>\n</li>\n<li>\n<p>6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.</p>\n</li>\n</ul>\n<p><strong>About your job at Stride</strong></p>\n<p>Your job: write high quality code, and bring a ‘teach a team to fish’ mentality to your project. You will:</p>\n<ul>\n<li>Embed with tech teams in some of NYC’s most exciting startup, mid-market and enterprise companies to help them up their game and get stuff done.</li>\n<li>Mentor and manage both Strider and client teams on the value of software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement</li>\n<li>Be the reason your client teams are higher performing on your last day with them than they were on your first day.</li>\n<li>Lead and be part of a cross functional team of Striders and client employees.</li>\n<li>Work with, learn and teach others a variety of tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.</li>\n</ul>\n<p><strong>You’re a fit if you have:</strong></p>\n<ul>\n<li>6+ years of software development experience, including 1 year as a lead developer or manager</li>\n<li>Proficiency in multiple programming languages and ability to quickly gain proficiency in unfamiliar languages and frameworks</li>\n<li>Desire to guide team strategy</li>\n<li>Passion for seeing projects through from inception to deployment</li>\n<li>Experience teaching TDD, story estimation, test writing, and effective pair programming</li>\n</ul>\n<p><strong>What you can expect from us:</strong></p>\n<ul>\n<li>Continuous learning on things that you are passionate about</li>\n<li>Competitive Pay and Benefits (including Profit Sharing!)</li>\n<li>Empowerment to work at a self-defined sustainable pace</li>\n<li>Awesome culture</li>\n<li>No travel</li>\n<li>$2,000 and up to two weeks of your time for self-directed professional development</li>\n</ul>\n<p><strong>About Stride Consulting</strong></p>\n<p>Stride Consulting is NYC’s go-to Agile software development consultancy.</p>\n<p>Our mission: Teach the World to Stride! We believe that high functioning development teams give an organization a true competitive advantage. We help tech teams up their game, and become the highest functioning version of themselves in perpetuity.</p>\n<p>We do this by co-locating and literally coding side-by-side with our clients. We come to you. The love for technical mentorship weaves a thread through all that we do. We not only advocate for best practices in software development, we model the way. Our non-dogmatic Agile developers and product managers teach through doing, because we know that every tech team is unique in their challenges and opportunities.</p>\n<p>We are employee owned &amp; run, and profitable. This means we don’t have a board of directors to answer to or investors who need to make a return. We are in control of our growth and can do so at a pace that sustains our culture and  prioritizes the happiness of our employees.</p>\n",
        "how_to_apply": "<p>If interested, please visit the link below to apply: <a href=\"https://boards.greenhouse.io/stride/jobs/1342703\">https://boards.greenhouse.io/stride/jobs/1342703</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b05dfdb553ecacd9b3565dff9e5dbcefb66b4126/Stride%20Consulting%20Logo%20Below%202018.png"
    }
]